[
  {
    "title": "Software Engineer",
    "company_name": "Famwork",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "Job Role:\n\nAs a software developer, you'll be the brain behind crafting, developing, testing, going live and maintaining the system. You are passionate in understanding the business context for features built to drive better customer experience and adoption...\n\nResponsibilities:\n• Familiar with the software development life cycle (SDLC) from analysis to deployment.\n• Comply with coding standards and technical design.\n• Believes in systematic approach to developing the system through clear documentation (flowcharts, layouts, & etc) of functionality, address every use case through creative solutions.\n• Adapts structured coding styles for easy review, testing and maintainability of the code.\n• Integrate the developed functionality and/or component into a fully functional system.\n• Ensure unit and integration level verification plan are in place and adheres to great quality of code at all time.\n• Active participate in troubleshooting, debugging and updating current live system.\n• Verify user feedback in making system more stable and easy.\n• Work closely with analysts, designers and other peer developers.\n• Preparing technical training documents for onboarding new engineers.\n\nRequirements:\n• Bachelor's degree in computer science or equivalent practical experience.\n• 2+ years of experience as Software Engineer or Software Developer or in a relevant role.\n• Understanding of OOPS concepts, Persistence, Threading.\n• Proficient in Java, C++, Ruby on Rails or other programming languages.\n• Hands-on with SQL or NoSQL database.\n• Competent with developing web apps in popular web frameworks (ASP .Net, JQuery, Apache Wicket, JavaServer Faces (JSF) & Spring MVC etc,).\n• Knowledgeable in data structures and algorithms.\n• Experience with open-source projects.\n• Experience in designing interactive applications.\n• A background in Engineering with sound oral and written communication skills.\n• Prior experience with AWS, Azure, Google or Openstack will be a plus.\nEmployment Type: FULL_TIME",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Bachelor's degree in computer science or equivalent practical experience",
          "2+ years of experience as Software Engineer or Software Developer or in a relevant role",
          "Understanding of OOPS concepts, Persistence, Threading",
          "Proficient in Java, C++, Ruby on Rails or other programming languages",
          "Hands-on with SQL or NoSQL database",
          "Competent with developing web apps in popular web frameworks (ASP .Net, JQuery, Apache Wicket, JavaServer Faces (JSF) & Spring MVC etc,)",
          "Knowledgeable in data structures and algorithms",
          "Experience with open-source projects",
          "Experience in designing interactive applications",
          "A background in Engineering with sound oral and written communication skills"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "As a software developer, you'll be the brain behind crafting, developing, testing, going live and maintaining the system",
          "Familiar with the software development life cycle (SDLC) from analysis to deployment",
          "Comply with coding standards and technical design",
          "Believes in systematic approach to developing the system through clear documentation (flowcharts, layouts, & etc) of functionality, address every use case through creative solutions",
          "Adapts structured coding styles for easy review, testing and maintainability of the code",
          "Integrate the developed functionality and/or component into a fully functional system",
          "Ensure unit and integration level verification plan are in place and adheres to great quality of code at all time",
          "Active participate in troubleshooting, debugging and updating current live system",
          "Verify user feedback in making system more stable and easy",
          "Work closely with analysts, designers and other peer developers",
          "Preparing technical training documents for onboarding new engineers"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?hl=en&q=Famwork&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAII1gk",
        "text": "See web results for Famwork"
      }
    ],
    "extensions": ["1 day ago", "Full-time"],
    "detected_extensions": {
      "posted_at": "1 day ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoibnNNSEptWGx6dFlBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSWtVMkZ1SUVaeVlXNWphWE5qYnlCQ1lYa2dRWEpsWVN4VmJtbDBaV1FnVTNSaGRHVnoiLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVMXJNbXhzU1ZjeE9HRndOMTgxVFZSdFdrSm5ZVVJUYWpNelozQlhZMk5DYjNCelJrWnRTa051ZUZGdk5HVTJSelZDYlRORVducERiRUpFZVU1RVJEUmFlbGRuVjNsaVRGTm9RMXBMU1RoWVFrNXlSa2syWTJ0bGRVMUJPWGQzVVVSMGJXVlRXVWs0WlhkTFRrSnZRWFZDY2tGNVh6QlpPV1ZvYURCV2VXTkhWMXBVWVRRM1N6VjFSbnAxVkZkME4wTkNRbkUxT1VwbVMzVm1la3haVW01M0VoWkxZV1pMV2s1bFQwVTFVR010VVdKYWIzQjJaMEZuR2lKQlRFVlRPWFZOVm1wME5XOUhZbmxHU1VKdGFITmpabXBuZG5nMWJVeDViVkZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiIubkZnMmVie2ZvbnQtd2VpZ2h0OjUwMH0uQmk2RGRje2ZvbnQtd2VpZ2h0OjUwMH1BcHBseSBvbiBaaXBSZWNydWl0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cuemlwcmVjcnVpdGVyLmNvbS9jL0ZhbXdvcmsvSm9iL1NvZnR3YXJlLUVuZ2luZWVyLy1pbi1TYW4tRnJhbmNpc2NvLENBP2ppZD02NWI5NGE3NWZlZmI1NGJhXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ==",
    "job_link": "https://www.ziprecruiter.com/c/Famwork/Job/Software-Engineer/-in-San-Francisco,CA?jid=65b94a75fefb54ba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Software Engineering MTS",
    "company_name": "Salesforce, Inc.",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nSoftware Engineering\n\nJob Details\n\nAbout Salesforce\n\nWe're Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too - driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good - you've come to the right place.\n\nSalesforce has an immediate opportunity for a software developer who want their lines of code to have significant and measurable positive impact for users, the company's bottom line, and the industry. You will be working with a group of world-class engineers to build the breakthrough features our customers will love, adopt, and use while keeping our trusted CRM platform stable and scalable. The software engineer role at Salesforce encompasses architecture, design, implementation, and testing to ensure we build products right and release them with high quality.\n\nThis candidate will be involved in code review, mentoring junior engineers, and providing technical guidance to the team (depending on the seniority level). We pride ourselves on writing high-quality, maintainable code that strengthens the stability of the product and makes our lives easier. We embrace the hybrid model and celebrate the individual strengths of each team member while encouraging everyone on the team to grow into the best version of themselves. We believe that autonomous teams with the freedom to make decisions will empower the individuals, the product, the company, and the customers they serve to thrive.\n\nResponsibilities:\n• Build new and exciting components in an ever-growing and evolving market technology to provide scale and efficiency\n• Develop high-quality, production-ready code that can be used by millions of users of our applications.\n• Make design decisions on the basis of performance, scalability, and future expansion\n• Work in a Hybrid Engineering model and contribute to all phases of SDLC including design, implementation, code reviews, automation, and testing of the features\n• Build efficient components/algorithms on a microservice multi-tenant SaaS cloud environment\n• Code review, mentoring junior engineers, and providing technical guidance to the team (depending on the seniority level)\n\nRequired Skills:\n• Master's degree (or its foreign degree equivalent) in Computer Science, Engineering (any field), or a related quantitative discipline, and two (2/3) years of experience in the job offered or related field, OR Bachelor's degree (or its foreign degree equivalent) in Computer Science, Engineering (any field), or a related quantitative discipline, and five (5) years of progressively responsible experience in the job offered or related field\n• Deep knowledge of object-oriented programming and other scripting languages: Java, Python, Node.JS\n• Strong SQL skills and experience and experience with relational and non-relational databases e.g. (Postgress/Trino/redshift/Mongo)\n• Proficiency in queues, locks, scheduling, event-driven architecture, and workload distribution, along with a deep understanding of relational database and non-relational databases\n• A deeper understanding of software development best practices and demonstrating leadership skills\n\nPreferred Skills:\n• Billing/pricing domain knowledge\n• Web Development\n• GitHub\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com.\n\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce.\n\nSalesforce welcomes all.\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFor California-based roles, the base salary hiring range for this position is $133,800 to $220,000.\n\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Master's degree (or its foreign degree equivalent) in Computer Science, Engineering (any field), or a related quantitative discipline, and two (2/3) years of experience in the job offered or related field, OR Bachelor's degree (or its foreign degree equivalent) in Computer Science, Engineering (any field), or a related quantitative discipline, and five (5) years of progressively responsible experience in the job offered or related field",
          "Deep knowledge of object-oriented programming and other scripting languages: Java, Python, Node.JS",
          "Strong SQL skills and experience and experience with relational and non-relational databases e.g. (Postgress/Trino/redshift/Mongo)",
          "Proficiency in queues, locks, scheduling, event-driven architecture, and workload distribution, along with a deep understanding of relational database and non-relational databases",
          "A deeper understanding of software development best practices and demonstrating leadership skills"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "You will be working with a group of world-class engineers to build the breakthrough features our customers will love, adopt, and use while keeping our trusted CRM platform stable and scalable",
          "The software engineer role at Salesforce encompasses architecture, design, implementation, and testing to ensure we build products right and release them with high quality",
          "This candidate will be involved in code review, mentoring junior engineers, and providing technical guidance to the team (depending on the seniority level)",
          "Build new and exciting components in an ever-growing and evolving market technology to provide scale and efficiency",
          "Develop high-quality, production-ready code that can be used by millions of users of our applications",
          "Make design decisions on the basis of performance, scalability, and future expansion",
          "Work in a Hybrid Engineering model and contribute to all phases of SDLC including design, implementation, code reviews, automation, and testing of the features",
          "Build efficient components/algorithms on a microservice multi-tenant SaaS cloud environment"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "For California-based roles, the base salary hiring range for this position is $133,800 to $220,000",
          "Compensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience",
          "Certain roles may be eligible for incentive compensation, equity, benefits"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.salesforce.com/", "text": "salesforce.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Salesforce,+Inc.&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAIInQo",
        "text": "See web results for Salesforce, Inc."
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiercCMzPmfWFqpTtz_tjaFxXDViRn2I2EhmqACfc&s",
    "extensions": ["6 days ago", "Full-time", "Health insurance"],
    "detected_extensions": {
      "posted_at": "6 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyBNVFMiLCJodGlkb2NpZCI6IjlzajJUNzhlOE5jQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lrVTJGdUlFWnlZVzVqYVhOamJ5QkNZWGtnUVhKbFlTeFZibWwwWldRZ1UzUmhkR1Z6IiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTFyTW14c1RGTlVWVXhQY1RCdmF6RlFVWFJhV1hscVEwWkxSSGs0T1hCWlVIRnpSbXRwUlZKbU1ucG9lWEp4WTNkM05tZEhiVWxqT0ZSWk4wcDVhVXhyV1dWSmRuaFNObVJVTkdOWU9GUTRaVmxEU25neVYyTnJhVXhZTVdZd2FHNVdNR2hVVWxCR04zWkJTRmROTkZOUFlUVlpOR3BLVjFCVE5VSjZZbmd6VW1neFJUUkZWRU51Um5wbloydG5NMFJQZEZwSFJXMW9jV1ZzVG14V01HbENMWGhuVEdsQ1FuSlphVzV6TFc1MU5YZzBaalpSY1RZeVpHeHlXRnBDV1VWNWR6WTVkSHBhWVZaakVoWkxZV1pMV2s1bFQwVTFVR010VVdKYWIzQjJaMEZuR2lKQlRFVlRPWFZOYlc4MVNtVm9WVkEwWVhkdWF6STJTa0ZyVEVsZmVYZHpjVEZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBaaXBSZWNydWl0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cuemlwcmVjcnVpdGVyLmNvbS9jL1NhbGVzZm9yY2UsLUluYy4vSm9iL1NvZnR3YXJlLUVuZ2luZWVyaW5nLU1UUy8taW4tU2FuLUZyYW5jaXNjbyxDQT9qaWQ9ZjE3YTczYjI1NDIzZDY5Ylx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=",
    "job_link": "https://www.ziprecruiter.com/c/Salesforce,-Inc./Job/Software-Engineering-MTS/-in-San-Francisco,CA?jid=f17a73b25423d69b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Director, Software Engineering",
    "company_name": "Salesforce, Inc.",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nSoftware Engineering\n\nJob Details\n\nAbout Salesforce\n\nWe're Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too - driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good - you've come to the right place.\n\nMonitoring Cloud is seeking a Director to lead engineers to architect, implement, deliver and operate our monitoring & analytic services that run in the public cloud at massive scale.\n\nMonitoring Cloud is an integral part of the Salesforce Infrastructure that provides key insights for all development teams to quickly detect and remediate incidents to ensure the highest availability of Salesforce products for our customers. This cloud owns the entire telemetry stack starting with the agents that emit, collect and ship telemetry to large-scale backend systems that store data and enable efficient and low-latency queries to provide valuable insights. We support all the key pillars of telemetry - metrics, logs, traces and events at massive scale. Our teams have built these services using a combination of open source technologies and home grown technologies, both of which were essential at Salesforce scale and this has been architected from the ground up to run efficiently in the public cloud.\n\nAs an engineering leader, you will focus on developing the team around you. Bring your technical chops to drive your teams to success around feature delivery and live-site management for a complex cloud infrastructure service. You are as enthusiastic about recruiting and building a team as you are about challenging technical problems that your team will solve. You will also help shape, direct and execute our product vision. You'll be challenged to blend customer-centric principles, industry-changing innovation, and the reliable delivery of new technologies. You will work directly with engineering, product, and design, to create experiences that reinforce the Salesforce brand by delighting and wowing our customers with highly reliable and available services.\n\nResponsibilities\n• Drive the vision for monitoring & analytic engineering across product verticals and define the execution path to achieve the vision.\n• Build and lead a team of engineers to deliver reliable, scalable and secure monitoring and analytic services for various business needs.\n• Solid experience in building and evolving large scale distributed systems to reliably process billions of data points\n• Proactively identify reliability & data quality problems and drive triaging and remediation process.\n• Invest in continuous employee development of a highly technical team by mentoring and coaching engineers and technical leads in the team.\n• Recruit and attract top talent.\n• Drive execution and delivery by collaborating with cross functional teams, architects, product owners and engineers.\n• Experience managing 2+ engineering teams.\n\nRequired Skills/Experiences\n• B.S/M.S. in Computer Sciences or equivalent field.\n• 10+ years of relevant experience in software development teams with 5+ years of experience managing teams\n• Passionate, curious, creative, self-starter and approach problems with right methodology and intelligent decisions.\n• Laser focus on impact, balancing effort to value, and getting things done.\n• Experience providing mentorship, technical leadership, and guidance to team members.\n• Strong customer service orientation and a desire to help others succeed.\n• Top notch written and oral communication skills.\n\nDesired Skills/Experiences\n• Expertise in data processing techniques.\n• Experience with container orchestration systems Kubernetes, Docker, Helios, Fleet\n• Expertise in open source technologies like Elastic Search, Logstash, Kakfa, MongoDB, Hadoop, Spark, Trino/Presto, Hive, Airflow, Splunk\n• Experience building services on public cloud platforms like GCP, AWS, Azure\n• LI-Y\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com.\n\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce.\n\nSalesforce welcomes all.\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFor Washington-based roles, the base salary hiring range for this position is $172,500 to $280,200.\n\nFor California-based roles, the base salary hiring range for this position is $188,200 to $305,600.\n\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Required Skills/Experiences",
          "B.S/M.S. in Computer Sciences or equivalent field",
          "10+ years of relevant experience in software development teams with 5+ years of experience managing teams",
          "Passionate, curious, creative, self-starter and approach problems with right methodology and intelligent decisions",
          "Laser focus on impact, balancing effort to value, and getting things done",
          "Experience providing mentorship, technical leadership, and guidance to team members",
          "Strong customer service orientation and a desire to help others succeed",
          "Top notch written and oral communication skills"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Monitoring Cloud is an integral part of the Salesforce Infrastructure that provides key insights for all development teams to quickly detect and remediate incidents to ensure the highest availability of Salesforce products for our customers",
          "This cloud owns the entire telemetry stack starting with the agents that emit, collect and ship telemetry to large-scale backend systems that store data and enable efficient and low-latency queries to provide valuable insights",
          "Bring your technical chops to drive your teams to success around feature delivery and live-site management for a complex cloud infrastructure service",
          "You will also help shape, direct and execute our product vision",
          "You'll be challenged to blend customer-centric principles, industry-changing innovation, and the reliable delivery of new technologies",
          "You will work directly with engineering, product, and design, to create experiences that reinforce the Salesforce brand by delighting and wowing our customers with highly reliable and available services",
          "Drive the vision for monitoring & analytic engineering across product verticals and define the execution path to achieve the vision",
          "Build and lead a team of engineers to deliver reliable, scalable and secure monitoring and analytic services for various business needs",
          "Solid experience in building and evolving large scale distributed systems to reliably process billions of data points",
          "Proactively identify reliability & data quality problems and drive triaging and remediation process",
          "Invest in continuous employee development of a highly technical team by mentoring and coaching engineers and technical leads in the team",
          "Recruit and attract top talent",
          "Drive execution and delivery by collaborating with cross functional teams, architects, product owners and engineers",
          "Experience managing 2+ engineering teams"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "For California-based roles, the base salary hiring range for this position is $188,200 to $305,600",
          "Certain roles may be eligible for incentive compensation, equity, benefits"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.salesforce.com/", "text": "salesforce.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Salesforce,+Inc.&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAII5go",
        "text": "See web results for Salesforce, Inc."
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiercCMzPmfWFqpTtz_tjaFxXDViRn2I2EhmqACfc&s",
    "extensions": ["7 days ago", "Full-time", "Health insurance"],
    "detected_extensions": {
      "posted_at": "7 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJEaXJlY3RvciwgU29mdHdhcmUgRW5naW5lZXJpbmciLCJodGlkb2NpZCI6Imk4Z1JETmtLN213QUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lrVTJGdUlFWnlZVzVqYVhOamJ5QkNZWGtnUVhKbFlTeFZibWwwWldRZ1UzUmhkR1Z6IiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTFyTW14c1MyY3piV1IxYlhCeGNsTlBOSEJaVlU5MlV6RlJSWFZGWTE5dmVUSTNObHBQU0hoeWFWUlFZVmRpWm5SV1pTMVFaell3VG0xRVl6aE1aRVo1TVhkUVRHeHZZVmxsYUVkb1pFZzFVRzlDVldwUFZUWmhjSEJSUldjeGRGRlJWRzVvWTFRMFQwcGhlVzR0TWpKS2FXZzBSbTloUjJWU1NVZFJWVzR0ZDJGSVMzRlhOaTE2TmxsRlpHRTJhMDR6Wm1OM1puVjFiRE4wZVc1TGRWOVNNMHg2ZVdzNFNtbHlSRTV3YTJORlFUWnRkVTFmVUhKSVdHdElWRGRZVEhSSlkxSjJTRWRFYjJOckVoWkxZV1pMV2s1bFQwVTFVR010VVdKYWIzQjJaMEZuR2lKQlRFVlRPWFZOUTJ0Nk1YWklXRjlhU0ZFME1EQlpSVFE0ZEdGQldGbDFMVFYzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBaaXBSZWNydWl0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cuemlwcmVjcnVpdGVyLmNvbS9jL1NhbGVzZm9yY2UsLUluYy4vSm9iL0RpcmVjdG9yLC1Tb2Z0d2FyZS1FbmdpbmVlcmluZy8taW4tU2FuLUZyYW5jaXNjbyxDQT9qaWQ9YzkzZmYxMmJjNzAyNjQ1ZVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=",
    "job_link": "https://www.ziprecruiter.com/c/Salesforce,-Inc./Job/Director,-Software-Engineering/-in-San-Francisco,CA?jid=c93ff12bc702645e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Principal Software Engineer",
    "company_name": "Salesforce, Inc.",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nSoftware Engineering\n\nJob Details\n\nAbout Salesforce\n\nWe're Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too - driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good - you've come to the right place.\n\nAbout MuleSoft, a Salesforce company\n\nMuleSoft makes it easy to connect the world's applications, data and devices. We provide a flexible, unified software platform that enables organizations to easily build application networks using APIs - the digital glue that allows applications to talk to each other and exchange data. MuleSoft is at the heart of the applications and services you use every day, like Netflix, Spotify and Salesforce, from Global 500 corporations to emerging companies in more than 60 countries.\n\nAbout the Position:\n\nLaunched in 2018, Anypoint Monitoring (see video) provides advanced monitoring and out-of-the-box diagnostic capabilities. It bridges the divide between application performance monitoring and log management, the de-facto monitoring tool types for enterprise-grade visibility. With an integrated monitoring tool, developers, architects, and DevOps teams enjoy granular visibility across various Mule runtimes, APIs, integrations, and other runtime services. This product has enjoyed tremendous growth in the market, and we are looking for engineering talent to help us scale the product to new heights.\n\nAbout the Role:\n• Architect, design and develop software systems and services that handle high volume of data\n• Lead engineers, architects and product owners to develop high quality products and services that meet business requirements while applying the latest available tools and technology\n• Participate in and contribute to design discussions and code reviews\n• Mentor other engineers in their growth and development\n• Participate in setting the vision and strategy for Monitoring and MuleSoft\n• Set a high standard for software development and product quality, foster the adoption of best practices\n• Take operational ownership of services and build a culture of operational excellence\n\nRequirements:\n• 10+ years of professional experience building software products\n• 7+ years working with Big Data and distributed systems: Apache Druid, Spark, Flink, Kafka, open telemetry\n• Industry experience building enterprise-grade ML/AI systems, from prototyping/creating ML models to serving customers with intelligent solutions.\n• A related technical degree require\n• Expertise in building scalable systems using multi-threaded programming, non-blocking IO, and distributed algorithms\n• Expertise in building REST APIs and micro services\n• Solid knowledge of database technologies and database schema design\n• Experience building application performance monitoring (APM) and logging products and services\n• Experience building and delivering highly scalable, reliable, and complex software systems in a hosted cloud environment using AWS, Docker, and Kubernetes\n• Experience with:\n• Java, Scala, Groovy, or other modern languages\n• ElasticSearch, InfluxDB, Cassandra\n• Spring Boot or Akka Framework\n• CI/CD pipelines such as Jenkins\n• Configuration management such as Ansible\n• Infrastructure as code such as Terraform\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com.\n\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce.\n\nSalesforce welcomes all.\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFor California-based roles, the base salary hiring range for this position is $188,200 to $305,600.\n\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "10+ years of professional experience building software products",
          "7+ years working with Big Data and distributed systems: Apache Druid, Spark, Flink, Kafka, open telemetry",
          "Industry experience building enterprise-grade ML/AI systems, from prototyping/creating ML models to serving customers with intelligent solutions",
          "A related technical degree require",
          "Expertise in building scalable systems using multi-threaded programming, non-blocking IO, and distributed algorithms",
          "Expertise in building REST APIs and micro services",
          "Solid knowledge of database technologies and database schema design",
          "Experience building application performance monitoring (APM) and logging products and services",
          "Experience building and delivering highly scalable, reliable, and complex software systems in a hosted cloud environment using AWS, Docker, and Kubernetes",
          "Java, Scala, Groovy, or other modern languages",
          "ElasticSearch, InfluxDB, Cassandra",
          "Spring Boot or Akka Framework",
          "CI/CD pipelines such as Jenkins",
          "Configuration management such as Ansible",
          "Infrastructure as code such as Terraform"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "It bridges the divide between application performance monitoring and log management, the de-facto monitoring tool types for enterprise-grade visibility",
          "With an integrated monitoring tool, developers, architects, and DevOps teams enjoy granular visibility across various Mule runtimes, APIs, integrations, and other runtime services",
          "Architect, design and develop software systems and services that handle high volume of data",
          "Lead engineers, architects and product owners to develop high quality products and services that meet business requirements while applying the latest available tools and technology",
          "Participate in and contribute to design discussions and code reviews",
          "Mentor other engineers in their growth and development",
          "Participate in setting the vision and strategy for Monitoring and MuleSoft",
          "Set a high standard for software development and product quality, foster the adoption of best practices",
          "Take operational ownership of services and build a culture of operational excellence"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "For California-based roles, the base salary hiring range for this position is $188,200 to $305,600",
          "Certain roles may be eligible for incentive compensation, equity, benefits"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.salesforce.com/", "text": "salesforce.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Salesforce,+Inc.&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAIIsAs",
        "text": "See web results for Salesforce, Inc."
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiercCMzPmfWFqpTtz_tjaFxXDViRn2I2EhmqACfc&s",
    "extensions": [
      "6 days ago",
      "Full-time",
      "No degree mentioned",
      "Health insurance"
    ],
    "detected_extensions": {
      "posted_at": "6 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgU29mdHdhcmUgRW5naW5lZXIiLCJodGlkb2NpZCI6IjQtT3JPOU80N3RjQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lrVTJGdUlFWnlZVzVqYVhOamJ5QkNZWGtnUVhKbFlTeFZibWwwWldRZ1UzUmhkR1Z6IiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTFyTW14c1NqVTFRV3R0YkZVNVIwMDJlWFZhWTNWRFNuWnZRbTF5YzA1RFFqaDNaVVJMTTJWUFoxVnBUalpaTVdsMlMzWk5iV1ZQTUVJeGFuSkZWbFJPY1VsSmNEaDBWMFJzZGt0c05tcDRVWE5IT1ZWeWFFcE5TRFY0ZURONVpGSlhiSG8xTTJwaVRXVjRiazVIWTI1RlVqRTVRVmR0TjJ0cGVEZFhhRE5yT0VoNVVrUlNZbFJKZEhWSlVIaHdla2ROU2xSd2RqRkpaSFpDU1RrNVVsWnpNMk0zU1dNemFHbHNaMVYzUkd4YWRIQTJNRFk1TkU5WmFuaEJWVGRYUjJNMVdGcGliMWxQZUZoekVoWkxZV1pMV2s1bFQwVTFVR010VVdKYWIzQjJaMEZuR2lKQlRFVlRPWFZRVjFRdGVsOXhSSEZ4VGxaUFZWVnNaRGxtY2s1Q1UzTllRbTlCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBaaXBSZWNydWl0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cuemlwcmVjcnVpdGVyLmNvbS9jL1NhbGVzZm9yY2UsLUluYy4vSm9iL1ByaW5jaXBhbC1Tb2Z0d2FyZS1FbmdpbmVlci8taW4tU2FuLUZyYW5jaXNjbyxDQT9qaWQ9MWQ5ODI3MDc1YTkwNzI1NVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=",
    "job_link": "https://www.ziprecruiter.com/c/Salesforce,-Inc./Job/Principal-Software-Engineer/-in-San-Francisco,CA?jid=1d9827075a907255&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Software Engineering LMTS",
    "company_name": "Salesforce, Inc.",
    "location": " Anywhere ",
    "via": "via ZipRecruiter",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nSoftware Engineering\n\nJob Details\n\nSalesforce, Inc. has multiple career opportunities in San Francisco, CA for Software Engineering LMTS. Positions require BA/BS, MA/MS, MBA or PhD. Multiple positions/openings. A related technical degree required. Salary: $188,200.00 - $258,700.00 per annum.\n\nSubmit a resume using the apply button on this posting or by email at: onlinejobpostings@salesforce.com at Job #17-2901. Salesforce is an Equal Opportunity & Affirmative Action Employer. Education, experience and criminal background checks will be conducted.\n\n#LI-DNI\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.\n\nSalesforce welcomes all.\n\nMore details about our company benefits can be found at the following link: https://www.getsalesforcebenefits.com/\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFor California-based roles, the base salary hiring range for this position is $188,200 to $258,700.\n\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Positions require BA/BS, MA/MS, MBA or PhD",
          "A related technical degree required"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Salary: $188,200.00 - $258,700.00 per annum",
          "For California-based roles, the base salary hiring range for this position is $188,200 to $258,700",
          "Compensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience",
          "Certain roles may be eligible for incentive compensation, equity, benefits"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.salesforce.com/", "text": "salesforce.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Salesforce,+Inc.&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAII9Qs",
        "text": "See web results for Salesforce, Inc."
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiercCMzPmfWFqpTtz_tjaFxXDViRn2I2EhmqACfc&s",
    "extensions": [
      "20 days ago",
      "Work from home",
      "Full-time",
      "Health insurance"
    ],
    "detected_extensions": {
      "posted_at": "20 days ago",
      "schedule_type": "Full-time",
      "work_from_home": true
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyBMTVRTIiwiaHRpZG9jaWQiOiJ5SlRmVDlNYTc3VUFBQUFBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJa1UyRnVJRVp5WVc1amFYTmpieUJDWVhrZ1FYSmxZU3hWYm1sMFpXUWdVM1JoZEdWeiIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVUxck1teHNUQzFOZW1KYVNrVldXVXBrTTFKZmQxaE5TMnh6UkVGUVpVeFhibmx5V21jemFtNWxlR1JDWm5sdGFXeE1Va1ZRVlZSVE4yaFNURzVUVkVaSFUzSTNXWEpVUkVWT1FtdExTMlJrU1djelVuYzBjVFJ0YTA1QmJIaDZPWFZKYmw5VFRWZzVSVU52ZERsdVdGUklRMnMyYVZOeFNVMUNUakpJUjJFd1FsTmxNM0pFZVVZME4wbHFSVXQxYjNabldsQnpTV2hmWkV0blkyMTZkMjFqUTNadFlVRTRTRkJPVW0xSlVIaE9aMHhZVUVwSE0zQTBabWMzYTNGVU16VTFSMmRXZVZadloyZHFFaFpMWVdaTFdrNWxUMFUxVUdNdFVXSmFiM0IyWjBGbkdpSkJURVZUT1hWUU5tMUtRVmN6ZFMxVVJqWnRaVUkxWTB0Q09GVmFjVlpYZDI5QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gWmlwUmVjcnVpdGVyIiwibGluayI6Imh0dHBzOi8vd3d3LnppcHJlY3J1aXRlci5jb20vYy9TYWxlc2ZvcmNlLC1JbmMuL0pvYi9Tb2Z0d2FyZS1FbmdpbmVlcmluZy1MTVRTLy1pbi1TYW4tRnJhbmNpc2NvLENBP2ppZD1jNDFhMzMxMGQ3MjY0YmM4XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ==",
    "job_link": "https://www.ziprecruiter.com/c/Salesforce,-Inc./Job/Software-Engineering-LMTS/-in-San-Francisco,CA?jid=c41a3310d7264bc8&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Sr Software Engineer - Remote",
    "company_name": "Spring Free EV",
    "location": " Anywhere ",
    "via": "via ZipRecruiter",
    "description": "Introduction\n\nSpring Free EV makes electric vehicles affordable and grid-friendly using just software. We are on a journey to take a gigaton of CO2 emissions off the road. EV adoption is accelerating and our company Spring Free has a great opportunity in front of us...\nIndustry background\n\nThe speed of adoption of Electric Vehicles (EVs) is critical to achieve deep decarbonization of the transport sector. The average gasoline vehicle on the road today has a fuel economy of about 22.0 miles per gallon and drives around 11,500 miles per year. Every gallon of gasoline burned creates about 8,887 grams of CO2. Added-up passenger vehicles emit 10% - 15% of total greenhouse gas emissions.\n\nThe auto finance industry has a massive entrenched ecosystem of loans and leases. Worldwide auto revenues were around $3 Trillion in 2017. EVs are now at a tipping point where the capital cost and total cost of ownership can be lower than gas or diesel powered vehicles.\n\nWe would love to hear from you if you want to join a team with deep FinTech knowledge and startup experience, including dozens of success stories and four IPOs.\nRoles & ResponsibilitiesDesign and develop 1.0 products that will help take a gigaton of tailpipe emissions off the road. As a Senior Full Stack Software Engineer, you will be responsible for designing, developing, and maintaining complex web applications and services. You will work closely with cross-functional teams to deliver high-quality, scalable software solutions that meet Spring Free EV's fintech and mobility needs.\n• Design and develop web applications and services using modern technologies and best practices\n• Collaborate with cross-functional teams, including product management, UX design, and other engineers to define and deliver software solutions\n• Write clean, maintainable, and testable code, using modern programming languages and frameworks\n• Continuously improve software development processes, tools, and practices to increase productivity, quality, and agility\nQualifications\n\nBuilt and shipped 1.0 products\n• 5+ years of experience in full-stack software engineering, developing complex web applications and services.\n• Strong programming skills in one or more programming languages\n• Strong experience in front-end development using modern JavaScript frameworks such as React, Vue, or Angular.\n• Strong experience in back-end development using modern server-side frameworks such as Node.js, Spring Boot, or Django.\n• Strong experience in database design and development, with expertise in one or more database systems such as MySQL, PostgreSQL, or MongoDB.\n• Experience in cloud computing platforms such as AWS, Azure, or Google Cloud Platform.\n• Strong understanding of software engineering principles, design patterns, and software development best practices.\n• A good sense of humor\nLocation\n\nThe company is 100% virtual and is a Delaware corporation. You will need to be authorized to work in the United States and willing to travel when needed to work safely face-to-face with clients, partners, and fellow team members.\nEqual Opportunity Employer\n\nSpring Free EV is an equal-opportunity employer. We are committed to creating a diverse, equitable and inclusive environment in our organization. Every day we strive to accelerate the adoption of clean mobility options for our customers, communities, and planet.\n\nthis is a remote position",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Built and shipped 1.0 products",
          "5+ years of experience in full-stack software engineering, developing complex web applications and services",
          "Strong programming skills in one or more programming languages",
          "Strong experience in front-end development using modern JavaScript frameworks such as React, Vue, or Angular",
          "Strong experience in back-end development using modern server-side frameworks such as Node.js, Spring Boot, or Django",
          "Strong experience in database design and development, with expertise in one or more database systems such as MySQL, PostgreSQL, or MongoDB",
          "Experience in cloud computing platforms such as AWS, Azure, or Google Cloud Platform",
          "Strong understanding of software engineering principles, design patterns, and software development best practices",
          "A good sense of humor",
          "You will need to be authorized to work in the United States and willing to travel when needed to work safely face-to-face with clients, partners, and fellow team members"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Roles & ResponsibilitiesDesign and develop 1.0 products that will help take a gigaton of tailpipe emissions off the road",
          "As a Senior Full Stack Software Engineer, you will be responsible for designing, developing, and maintaining complex web applications and services",
          "You will work closely with cross-functional teams to deliver high-quality, scalable software solutions that meet Spring Free EV's fintech and mobility needs",
          "Design and develop web applications and services using modern technologies and best practices",
          "Collaborate with cross-functional teams, including product management, UX design, and other engineers to define and deliver software solutions",
          "Write clean, maintainable, and testable code, using modern programming languages and frameworks",
          "Continuously improve software development processes, tools, and practices to increase productivity, quality, and agility"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?hl=en&q=Spring+Free+EV&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAIIwAw",
        "text": "See web results for Spring Free EV"
      }
    ],
    "extensions": [
      "200K–225K a year",
      "Work from home",
      "Full-time",
      "No degree mentioned"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time",
      "salary": "200K–225K a year",
      "work_from_home": true
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTciBTb2Z0d2FyZSBFbmdpbmVlciAtIFJlbW90ZSIsImh0aWRvY2lkIjoiOFpKYnNyTURrRjhBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSWtVMkZ1SUVaeVlXNWphWE5qYnlCQ1lYa2dRWEpsWVN4VmJtbDBaV1FnVTNSaGRHVnoiLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVMXJNbXhzU1hsaE1sVlRRblJuTFRGb1pXUnNUVkY1TW1oYVluWmFURTR4V2tZemQzVm1kVGx5TFVkRWNIUjJNbk5aY1U5UGNHTkxUbWR4UzJRME5ubHNZa2cxUVdGc2RtRlZRMHBRUTBwUWEzQnBNVTEyYTNkVWFUTjVaVXRLV0RCck1GbzBWMGxDWVdsVE1GWnhOMWhYWkd0Mk1uTkdWRTVVZEMxR00zQkpSa1k0ZVVsT01VNTZObFV4YkZOVVkzUmFZMmhWV1ZwVFRrTXlWVzE1UWxCZlUzVkZkREJpY1VKMlgydHJWRnBZV0ZaT0xYZG5lSFZYUmtKTFlscENNV0ZWWjBKWlNGSlFRM04wRWhaTFlXWkxXazVsVDBVMVVHTXRVV0phYjNCMlowRm5HaUpCVEVWVE9YVk5iamQwY1d0WmNqbHZNRlpzTlhFMFRFb3RkbFZVUWpKdlEwNVIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBaaXBSZWNydWl0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cuemlwcmVjcnVpdGVyLmNvbS9jL1NwcmluZy1GcmVlLUVWL0pvYi9Tci1Tb2Z0d2FyZS1FbmdpbmVlci1SZW1vdGUvLWluLVNhbi1GcmFuY2lzY28sQ0E/amlkPTU4MzE2NmI1NTRmNDQ3YzVcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19",
    "job_link": "https://www.ziprecruiter.com/c/Spring-Free-EV/Job/Sr-Software-Engineer-Remote/-in-San-Francisco,CA?jid=583166b554f447c5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "AMTS, Software Engineer",
    "company_name": "Salesforce, Inc.",
    "location": " Anywhere ",
    "via": "via ZipRecruiter",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nSoftware Engineering\n\nJob Details\n\nAbout Salesforce\n\nWe're Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too - driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good - you've come to the right place.\n\nSalesforce, Inc. seeks AMTS, Software Engineer in San Francisco, CA:\n\nJob Duties: Operate effectively in the hybrid engineering model where engineers design and execute the necessary work to ensure quality in their own code as well as other engineers'. Champion and improve standards for development, code reviews, performance, security, and quality for code and code written by team members. Contribute to architecture, and design and deliver highly scalable products. Learn, grow, and share knowledge to mentor and foster growth in other software engineers. Present designs to internal/external groups and review designs of others. Independently deliver on tasks and fearlessly make decisions within the Software Engineer decision space. Develop test strategies, design automation frameworks, and write unit/functional tests to drive up code coverage and automation metrics. ˆHQ address additionally encompasses the following Salesforce locations in San Francisco: 350 Mission Street, 415 Mission Street, and 50 Fremont Street. The permanent position may be offered at any of these locations in San Francisco. Telecommuting is permitted.\n\nMinimum Requirements: Bachelor's degree (or its foreign degree equivalent) in Computer Science, Engineering (any field), or a related quantitative discipline, and six (6) months of experience in the field of software engineering/program analysis or six (6) months of experience in the job offered.\n\nA related technical degree required (Computer Science, Engineering (any field)).\n\nSpecial Skill Requirements: (1) C++; (2) Python; (3) Vue.js; (4) AWS; (5) Selenium; (6) analyze datasets; (7) Automated PR; (8) Java; (9) Javascript; and (10) SQL. Any suitable combination of education, training and/or experience is acceptable. Education, experience, and criminal background checks will be conducted. Telecommuting is permitted.\n\nSalary: $108,800.00 - $152,880.00 per annum.\n\nSubmit a resume using the apply button on this posting or by email at: onlinejobpostings@salesforce.com at Job # 21-10861. Salesforce is an Equal Opportunity & Affirmative Action Employer. Education, experience and criminal background checks will be conducted.\n\n#LI-DNI\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com.\n\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce.\n\nSalesforce welcomes all.\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFor New York-based roles, the base salary hiring range for this position is $108,800 to $152,880.\n\nFor Colorado-based roles, the base salary hiring range for this position is $108,800 to $152,880.\n\nFor Washington-based roles, the base salary hiring range for this position is $108,800 to $152,880.\n\nFor California-based roles, the base salary hiring range for this position is $108,800 to $152,880.\n\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Minimum Requirements: Bachelor's degree (or its foreign degree equivalent) in Computer Science, Engineering (any field), or a related quantitative discipline, and six (6) months of experience in the field of software engineering/program analysis or six (6) months of experience in the job offered",
          "Special Skill Requirements: (1) C++; (2) Python; (3) Vue.js; (4) AWS; (5) Selenium; (6) analyze datasets; (7) Automated PR; (8) Java; (9) Javascript; and (10) SQL",
          "Any suitable combination of education, training and/or experience is acceptable",
          "Education, experience, and criminal background checks will be conducted"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Job Duties: Operate effectively in the hybrid engineering model where engineers design and execute the necessary work to ensure quality in their own code as well as other engineers'",
          "Champion and improve standards for development, code reviews, performance, security, and quality for code and code written by team members",
          "Contribute to architecture, and design and deliver highly scalable products",
          "Learn, grow, and share knowledge to mentor and foster growth in other software engineers",
          "Present designs to internal/external groups and review designs of others",
          "Independently deliver on tasks and fearlessly make decisions within the Software Engineer decision space",
          "Develop test strategies, design automation frameworks, and write unit/functional tests to drive up code coverage and automation metrics"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Salary: $108,800.00 - $152,880.00 per annum",
          "Compensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience",
          "Certain roles may be eligible for incentive compensation, equity, benefits"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.salesforce.com/", "text": "salesforce.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Salesforce,+Inc.&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAIIiQ0",
        "text": "See web results for Salesforce, Inc."
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiercCMzPmfWFqpTtz_tjaFxXDViRn2I2EhmqACfc&s",
    "extensions": [
      "7 days ago",
      "Work from home",
      "Full-time",
      "Health insurance"
    ],
    "detected_extensions": {
      "posted_at": "7 days ago",
      "schedule_type": "Full-time",
      "work_from_home": true
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJBTVRTLCBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiYTFXREpBNkVETjRBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSWtVMkZ1SUVaeVlXNWphWE5qYnlCQ1lYa2dRWEpsWVN4VmJtbDBaV1FnVTNSaGRHVnoiLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVMXJNbXhzU2xsUGFFcHJaSE53VFY5SWVXVlNkSEV5ZHpKNmNFMHllVWxJUmxNdFFXRm9jRTh3VDJVelgwZDBXbDlFYkdaS1dYTjVOV2RYWWtab1RITllZMUE0YVRjeFkyMXVRbFowTWtwWWVWcFZPRVZtYzBKbGVXUmFiVGxQTFRkaVFWZHlRVlZxWVhCVFNTMVVkWHB4VnpkdldsaG9UbWhEU0V4T1dXTklTMVJtUWtkMGFHY3lOakZ2TnkxaFFTMVdSMVZYZG10T2RUSkROVVpEYUhaM1lWb3dkbHBWUkZSSkxXZFRWSGQyWjFSdWVtTjNaR3cxTUY4MU1GaE1WMnhqWDJFdFZsUTNNWGhCRWhaTFlXWkxXazVsVDBVMVVHTXRVV0phYjNCMlowRm5HaUpCVEVWVE9YVlBObXRSV0ZFM1VEWTFMVmRtYVZCRFNYbEdUWFZGUkc5U2VYSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBaaXBSZWNydWl0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cuemlwcmVjcnVpdGVyLmNvbS9jL1NhbGVzZm9yY2UsLUluYy4vSm9iL0FNVFMsLVNvZnR3YXJlLUVuZ2luZWVyLy1pbi1TYW4tRnJhbmNpc2NvLENBP2ppZD0wNTExOGFkN2U5MzZlMWRkXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ==",
    "job_link": "https://www.ziprecruiter.com/c/Salesforce,-Inc./Job/AMTS,-Software-Engineer/-in-San-Francisco,CA?jid=05118ad7e936e1dd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Software Engineer, Developer Experience",
    "company_name": "OpenAI",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "About the Team\n\nThe Research Acceleration team builds high-quality research tools and frameworks to increase research productivity across OpenAI, with the goal of accelerating progress towards AGI. We frequently collaborate with other teams to speed up the development of new state-of-the-art capabilities...\n\nAbout the Role\n\nAs we scale up with more researchers and engineers joining OpenAI, we seek a pragmatic and passionate engineer with a strong focus on the researcher experience.\n\nIn this role, you will be responsible for building and maintaining systems that allow our research + engineering organization to iteratively develop, test, and deploy new features reliably, with high velocity, and with a frictionless and fast development cycle.\n\nYou will be tasked with profiling and optimizing continuous integration pipelines, building better testing infrastructure, and serving as the go-to expert for any build or test-related inquiries. Our current environment relies heavily on Python, Rust, and C++, which you will take ownership of and strive to transform into a state of the art development experience for research.\n\nUltimately, your role will be to provide the necessary tools and metrics to support our fast-paced culture and ensure a stable, scalable platform for growth, while also fostering a seamless and low friction experience for OpenAI's research.\n\nThis role is based in our San Francisco HQ. We offer relocation assistance to new employees.\n\nYou might thrive in this role if you:\n• Are a proficient Python programmer, with experience using Rust in production\n• Have worked with and on build systems\n• Are proficient with Kubernetes\n\nAbout OpenAI\n\nOpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. We push the boundaries of the capabilities of AI systems and seek to safely deploy them to the world through our products. AI is an extremely powerful tool that must be created with safety and human needs at its core, and to achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity.\n\nAt OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.\n\nCompensation, Benefits and Perks\n\nThe annual salary range for this role is $245,000 - $370,000. Total compensation also includes generous equity and benefits.\n• Medical, dental, and vision insurance for you and your family\n• Mental health and wellness support\n• 401(k) plan with 4% matching\n• Unlimited time off and 18+ company holidays per year\n• Paid parental leave (20 weeks) and family-planning support\n• Annual learning & development stipend ($1,500 per year)\n\nWe are an equal opportunity employer and do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, veteran status, disability or any other legally protected status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records.\n\nWe are committed to providing reasonable accommodations to applicants with disabilities, and requests can be made via this link.\n\nOpenAI US Applicant Privacy Policy",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Are a proficient Python programmer, with experience using Rust in production",
          "Have worked with and on build systems",
          "Are proficient with Kubernetes"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "In this role, you will be responsible for building and maintaining systems that allow our research + engineering organization to iteratively develop, test, and deploy new features reliably, with high velocity, and with a frictionless and fast development cycle",
          "You will be tasked with profiling and optimizing continuous integration pipelines, building better testing infrastructure, and serving as the go-to expert for any build or test-related inquiries",
          "Our current environment relies heavily on Python, Rust, and C++, which you will take ownership of and strive to transform into a state of the art development experience for research"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "The annual salary range for this role is $245,000 - $370,000",
          "Total compensation also includes generous equity and benefits",
          "Medical, dental, and vision insurance for you and your family",
          "Mental health and wellness support",
          "401(k) plan with 4% matching",
          "Unlimited time off and 18+ company holidays per year",
          "Paid parental leave (20 weeks) and family-planning support",
          "Annual learning & development stipend ($1,500 per year)"
        ]
      }
    ],
    "related_links": [
      { "link": "http://openai.com/", "text": "openai.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=OpenAI&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAII0w0",
        "text": "See web results for OpenAI"
      }
    ],
    "extensions": [
      "245K–370K a year",
      "Full-time",
      "No degree mentioned",
      "Health insurance",
      "Dental insurance",
      "Paid time off"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time",
      "salary": "245K–370K a year"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgRGV2ZWxvcGVyIEV4cGVyaWVuY2UiLCJodGlkb2NpZCI6IlBMREUzZVhIRktBQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lrVTJGdUlFWnlZVzVqYVhOamJ5QkNZWGtnUVhKbFlTeFZibWwwWldRZ1UzUmhkR1Z6IiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTFyTW14c1NXOWhPRlZHY2xWSU9ESlNZVVZzTWxSVVN5MXNiWE5oTUVKNFUwRnFXaTE1TkRVeFJIQndUMFl6YW10NFZIUklWRTlHYVU0dFdGWktjSGQ2VmpCM1MycEdSSE5GYlVSU1gxWTNSeTFGVnpSRlEwUnRlbXRNYWxKSlR6RnNUbXhPV1c5dVpIcFZNRk54Y0hNMWJsTmxMV2R1YW5weVZVRnVabkJyUW1STk9GaEhRMVl4ZUhSWWRsOWhXbU5mVUhwaVoxaFZYMlJLWTFwWVYxaFBkRE52T1dSVlRFaHRjRE5EV0ZkU2RFWlBkVTF0Y21oUVpteGpUREpSWVhCUmFtVnBXVVpqYTJvMGNHMU1RbXhZY0VSMGNHWlhVeTFmZGpNNFpIQTRVUklXUzJGbVMxcE9aVTlGTlZCakxWRmlXbTl3ZG1kQlp4b2lRVXhGVXpsMVRYQkVkRFoxY1hjMmQxQjVTbHBsVjFvMU5WOUVZVU5zUTA1aFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gWmlwUmVjcnVpdGVyIiwibGluayI6Imh0dHBzOi8vd3d3LnppcHJlY3J1aXRlci5jb20vYy9PcGVuQUkvSm9iL1NvZnR3YXJlLUVuZ2luZWVyLC1EZXZlbG9wZXItRXhwZXJpZW5jZS8taW4tU2FuLUZyYW5jaXNjbyxDQT9qaWQ9ODY1OWZmMWZlNjg1YjkzY1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=",
    "job_link": "https://www.ziprecruiter.com/c/OpenAI/Job/Software-Engineer,-Developer-Experience/-in-San-Francisco,CA?jid=8659ff1fe685b93c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Software Engineering SMTS",
    "company_name": "Salesforce, Inc.",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category...\nSoftware Engineering\n\nJob Details\n\nAbout Salesforce\n\nWe're Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too - driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good - you've come to the right place.\n\nSalesforce Database team enables Salesforce Data Base on Hyperforce at scale and has services and a suite of capabilities to meet SLAs. Our team consists of smart and tenacious engineers dedicated to excellence through platform expertise and uncompromising integrity. While we understand that delivery is important, we consider quality to be our highest priority. The code we deliver must be secure, perform well at scale, and provide the functionality promised to our customers.\n\nAs we scale our services in both in size and complexity - we must consistently provide the uptime and predictable performance that our customers demand. We are looking to grow our team to develop and manage our next generation of a cloud-scale Database. Our team is involved in building, automating, managing Salesforce Database and supporting service delivery pipelines and artifacts; life cycle management components and scaling and healing solutions; observability dashboards, Runbooks and troubleshooting guides. Our Goal is Deliver Highly Available (99.999%), Elastically Scalable and Cost Optimized Services on all Salesforce supported substrates and environments with Effective and Easy-to-Use Operability and Observability tools.\n\nResponsibilities:\n• Work on the service that powers strategic & high-impact company initiatives to help shape the future and improve internal and external customers' experience\n• Design and develop high-quality code to improve platform reliability, availability, and scalability\n• Influence and drive end-to-end solutions that help a cloud-scale database service remain highly available and operating with predictable performance\n• Contribute to the success of the scrum team through code reviews, deployment process automation, documentation, and refinement, planning, and retros\n• Develop test strategies, design automation frameworks, and write unit/functional tests to drive up code coverage and automation metrics\n• Lead, collaborate, communicate, and mentor others on the team and in the company\n• Work closely with cross-functional teams to deliver a roadmap to meet shared business goals\n• Resolve complex technical issues and drive innovations that improve system scalability, robustness and availability\n• Troubleshoot issues with the services that our team develops and owns, be passionate about automation\n• Participate in the team's on-call rotation to address complex problems in real-time and keep services operational and highly available\n• Create, maintain and share technical documentation used by engineers and other team members\n\nRequired Skills:\n• Bachelor's degree in Computer Sciences or equivalent field, 5+ years of relevant experience\n• Deep knowledge of object oriented programming and experience with at least one scripting programming language: Java, Go, Scala, Python\n• Experience using telemetry and metrics to drive operational excellence\n• Experience with managing large, complex systems in the cloud.\n• In depth experience of design patterns, data structures, algorithms, and concurrency\n• Knowledge of infra structure as code for large complex systems - helm/terraform\n• Strong Experience in Kubernetes, managing the statefulset application and deployment through helm charts\n• Experience in the public cloud technologies like AWS, mainly on EKS, EC2, IAM, VPC, S3\n• Programming. Proficiency in object-oriented programming in at least one of the following languages: Golang, Java, Python\n• CI/CD automation experience, including the understanding of key open sources technologies like Jenkins, Spinnaker, and Docker.\n• Experience with test frameworks like JUnit or Rest Assured.\n• Experience with Scrum in an Agile Development environment\n• Ability to debug, optimize code, and automate routine tasks.\n\nPreferred Skills:\n• Public cloud engineering on GCP, AWS, Alibaba and/or Azure platforms\n• Experience in designing and managing services to deploy/upgrade stateful applications at scale with robustness and availability in mind\n• Experience with open source projects like HBase, MapReduce, Elastic Search, Kafka,Spark, Presto, Cassandra, Zookeeper Pig, or Hive SOAP/REST APIs\n• Experience with container orchestration systems Kubernetes, Docker, Helios, Fleet or Mesos etc\n• Experience owning and operating multiple instances of mission-critical infrastructure services including, monitoring, alerting, logging, and reporting applications\n• Experience designing, developing, debugging, and operating resilient distributed systems\n\nAccommodations\n\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com.\n\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce.\n\nSalesforce welcomes all.\n\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\n\nFor California-based roles, the base salary hiring range for this position is $160,000 to $258,700.\n\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Bachelor's degree in Computer Sciences or equivalent field, 5+ years of relevant experience",
          "Deep knowledge of object oriented programming and experience with at least one scripting programming language: Java, Go, Scala, Python",
          "Experience using telemetry and metrics to drive operational excellence",
          "Experience with managing large, complex systems in the cloud",
          "In depth experience of design patterns, data structures, algorithms, and concurrency",
          "Knowledge of infra structure as code for large complex systems - helm/terraform",
          "Strong Experience in Kubernetes, managing the statefulset application and deployment through helm charts",
          "Experience in the public cloud technologies like AWS, mainly on EKS, EC2, IAM, VPC, S3",
          "Proficiency in object-oriented programming in at least one of the following languages: Golang, Java, Python",
          "CI/CD automation experience, including the understanding of key open sources technologies like Jenkins, Spinnaker, and Docker",
          "Experience with test frameworks like JUnit or Rest Assured",
          "Experience with Scrum in an Agile Development environment",
          "Ability to debug, optimize code, and automate routine tasks"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "The code we deliver must be secure, perform well at scale, and provide the functionality promised to our customers",
          "Work on the service that powers strategic & high-impact company initiatives to help shape the future and improve internal and external customers' experience",
          "Design and develop high-quality code to improve platform reliability, availability, and scalability",
          "Influence and drive end-to-end solutions that help a cloud-scale database service remain highly available and operating with predictable performance",
          "Contribute to the success of the scrum team through code reviews, deployment process automation, documentation, and refinement, planning, and retros",
          "Develop test strategies, design automation frameworks, and write unit/functional tests to drive up code coverage and automation metrics",
          "Lead, collaborate, communicate, and mentor others on the team and in the company",
          "Work closely with cross-functional teams to deliver a roadmap to meet shared business goals",
          "Resolve complex technical issues and drive innovations that improve system scalability, robustness and availability",
          "Troubleshoot issues with the services that our team develops and owns, be passionate about automation",
          "Participate in the team's on-call rotation to address complex problems in real-time and keep services operational and highly available",
          "Create, maintain and share technical documentation used by engineers and other team members"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "For California-based roles, the base salary hiring range for this position is $160,000 to $258,700",
          "Compensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience",
          "Certain roles may be eligible for incentive compensation, equity, benefits"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.salesforce.com/", "text": "salesforce.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Salesforce,+Inc.&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAIIoA4",
        "text": "See web results for Salesforce, Inc."
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiercCMzPmfWFqpTtz_tjaFxXDViRn2I2EhmqACfc&s",
    "extensions": ["6 days ago", "Full-time", "Health insurance"],
    "detected_extensions": {
      "posted_at": "6 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyBTTVRTIiwiaHRpZG9jaWQiOiI5U05oakM4d0phMEFBQUFBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJa1UyRnVJRVp5WVc1amFYTmpieUJDWVhrZ1FYSmxZU3hWYm1sMFpXUWdVM1JoZEdWeiIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVUxck1teHNTVXAyYnpoWFEycGxkM1pxZEZaRWVUSnBiMUF5WWpGSVFUUmZkVXhGT0hsNGNrZHlSSGhEUWxsTlZGZG9SazV5Vm5VNVMyYzNlRXBLZVZNNGFuRnJVeloyWlMxNVZYQkNMV1Z6UVZGc2EyUjVVRUpKVGs5elpFRktTMmMwZEVselozTkVPSGxaUTJWTGFWaGxSWFpRYVhCUGIweHZRekpLUWtsWmFXcFlVRkpmVkZWc1ZHUm5VVlptYVZreFQycEVRVlJLUXpjdFlqSndZVmRFV0haeVJIVkpVbkpPTkd0TVNXUXpPVGhSTlRSVFpIcDZjalZ2VDNsUlMxWnRhbnBpVkdOSWFVMU9FaFpMWVdaTFdrNWxUMFUxVUdNdFVXSmFiM0IyWjBGbkdpSkJURVZUT1hWUWMzbE5RVmxGUjNJNVdIVlZWa2QyVkdOT1VrRnJVbXRtYWpKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFppcFJlY3J1aXRlciIsImxpbmsiOiJodHRwczovL3d3dy56aXByZWNydWl0ZXIuY29tL2MvU2FsZXNmb3JjZSwtSW5jLi9Kb2IvU29mdHdhcmUtRW5naW5lZXJpbmctU01UUy8taW4tU2FuLUZyYW5jaXNjbyxDQT9qaWQ9ZWJmNDMxNDU3YTZhOGEyN1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=",
    "job_link": "https://www.ziprecruiter.com/c/Salesforce,-Inc./Job/Software-Engineering-SMTS/-in-San-Francisco,CA?jid=ebf431457a6a8a27&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Lead Software Engineer",
    "company_name": "Capital One",
    "location": "  San Francisco, CA   ",
    "via": "via ZipRecruiter",
    "description": "201 Third Street (61049), United States of America, San Francisco, California\n\nLead Software Engineer...\n\nLead Software Engineer position with Capital One Services, LLC in San Francisco, CA; Multiple positions available:\n\n- Lead overall technical design, development, modification, and implementation of computer applications using existing and emerging technology platforms.\n\n- Analyze internal user needs and desired results and develop software solutions with responsibility for the delivery of software applications.\n\n- Coordinate the work of project teams along multiple workstreams.\n\n- Develop complex applications using Jenkins, Chef, CI/CD, Python, and Splunk.\n\n- Write, design, test, implement, and debug software applications adhering to corporate requirements and standards.\n\n- Perform application testing, validation, and documentation.\n\n- Document design decisions and develop software components, adhering to existing process guidelines.\n\n- Coordinate software installation and monitor implementation process.\n\n- Monitor software performance trends and identify potential issues.\n\n- Own change management process for assigned configuration items.\n\n- Present complex IT concepts and project metrics to both technical and non-technical audiences.\n\n- Identify opportunities for improvement.\n\nEligible for employee referral program.\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThis position requires a Master's degree or foreign equivalent in Computer Science, Engineering, Computer Information Systems, Science, or a related technical field and 2 years of experience in job offered or application development. In lieu of a Master's degree or foreign equivalent in Computer Science, Engineering, Computer Information Systems, Science, or a related technical field and 2 years of experience in job offered or application development will accept a Bachelor's degree or foreign equivalent in the stated field and 5 years of progressive post-baccalaureate experience as stated. Said or other experience must include at least 6 months of experience in: Jenkins; Chef; CI/CD; Python; and Splunk . All listed qualifications may or may not be acquired concurrently. Must pass company's assessment.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nSan Francisco, California:\n$212,000 - $272,600 for Lead Software Engineer\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate's offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nNo agencies please. Capital One is an Equal Opportunity Employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex, race, color, age, national origin, religion, physical and mental disability, genetic information, marital status, sexual orientation, gender identity/assignment, citizenship, pregnancy or maternity, protected veteran status, or any other status prohibited by applicable national, federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City's Fair Chance Act; Philadelphia's Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "In lieu of a Master's degree or foreign equivalent in Computer Science, Engineering, Computer Information Systems, Science, or a related technical field and 2 years of experience in job offered or application development will accept a Bachelor's degree or foreign equivalent in the stated field and 5 years of progressive post-baccalaureate experience as stated",
          "Said or other experience must include at least 6 months of experience in: Jenkins; Chef; CI/CD; Python; and Splunk",
          "All listed qualifications may or may not be acquired concurrently"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Lead overall technical design, development, modification, and implementation of computer applications using existing and emerging technology platforms",
          "Analyze internal user needs and desired results and develop software solutions with responsibility for the delivery of software applications",
          "Coordinate the work of project teams along multiple workstreams",
          "Develop complex applications using Jenkins, Chef, CI/CD, Python, and Splunk",
          "Write, design, test, implement, and debug software applications adhering to corporate requirements and standards",
          "Perform application testing, validation, and documentation",
          "Document design decisions and develop software components, adhering to existing process guidelines",
          "Coordinate software installation and monitor implementation process",
          "Monitor software performance trends and identify potential issues",
          "Own change management process for assigned configuration items"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked",
          "Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate's offer letter",
          "This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI)",
          "Incentives could be discretionary or non discretionary depending on the plan",
          "Capital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being"
        ]
      }
    ],
    "related_links": [
      { "link": "http://www.capitalone.com/", "text": "capitalone.com" },
      {
        "link": "https://www.google.com/search?hl=en&q=Capital+One&sa=X&ved=0ahUKEwiXx7jp076AAxUTbt4KHVnRBiw4ChCYkAII5Q4",
        "text": "See web results for Capital One"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR7rBwV2eGRGo3OqcsU5RxRhlNEbn0PkJfre4J&s=0",
    "extensions": ["Full-time", "Health insurance"],
    "detected_extensions": { "schedule_type": "Full-time" },
    "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNvZnR3YXJlIEVuZ2luZWVyIiwiaHRpZG9jaWQiOiJzUnp5aWtDT3VrTUFBQUFBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJa1UyRnVJRVp5WVc1amFYTmpieUJDWVhrZ1FYSmxZU3hWYm1sMFpXUWdVM1JoZEdWeiIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVUxck1teHNTMWxUVjJkeVIweEdVbEpIZEdwV1RUYzBiMVV5YjBsSWFIRnhXaTFPYkhWamIyRm9Va1ZJV1daSE1uZGhWbTFsUTI5QmRFbHlXR1ZXUkZFMU1GVjZOVzFhTURrd2JIZzNPV0pMTURaSmNYbDBVRVpHVFdWUWJYWkZaVFJxU1RadU1qUkJSbTFxTFVSdlUydEVURGxHU1VWQk9IaFVWM281Ym5KNU5ucE1PSGRyZG5GTVNHUnhNemhNU2xvMVJHWmtha1JrVTJ0UmJEYzBiVlF0VTJkSlEzaHpWbHBUZDNGcWJHNU9TRUZWT1c5NE1VOWlMVkJwTFdWcVRVZFZORTFtT0UxVk5VMTFFaFpMWVdaTFdrNWxUMFUxVUdNdFVXSmFiM0IyWjBGbkdpSkJURVZUT1hWTlFYQnNRVXhDYWtSTVUwaGxaMlYxYjJkc1ltWlpVRXh0WTJWUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFppcFJlY3J1aXRlciIsImxpbmsiOiJodHRwczovL3d3dy56aXByZWNydWl0ZXIuY29tL2MvQ2FwaXRhbC1PbmUvSm9iL0xlYWQtU29mdHdhcmUtRW5naW5lZXIvLWluLVNhbi1GcmFuY2lzY28sQ0E/amlkPTRlYzIzNzk2NGE0NmU4YjNcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19",
    "job_link": "https://www.ziprecruiter.com/c/Capital-One/Job/Lead-Software-Engineer/-in-San-Francisco,CA?jid=4ec237964a46e8b3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  }
]
