[
  {
    "url": "https://twitter.com/aureliusbtc/status/1610496794886127616?s=46",
    "title": "Frontend Engineer at Synapse Protocol",
    "location": "Remote",
    "compensation": "Competitive Salary • Referral Bonus: $10k for successful hires",
    "description": "Synapse is a universal interoperability protocol that enables secure cross-chain communication. We're now expanding our team and looking for 2-3 killer frontend engineers to join us, working on new decentralized applications (dapps) & core infrastructure. This is an opportunity to be ambitious with your time spent in crypto, and to contribute to an innovative project at the forefront of blockchain technology. Our technology connects blockchains by offering an extensible cross-chain messaging protocol that supports assets, smart contract calls, and more. You will: Contribute to the development of new dapps and core infrastructure. Collaborate closely with other engineers, product managers, and designers. Actively participate in a fast-paced, highly collaborative and iterative environment. Work on technology that is shaping the future of finance and the blockchain industry. If you're a smart, experienced frontend engineer with strong software engineering fundamentals and you love to write and ship things quickly, we would love to hear from you.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "preferredTimezones": "Any",
    "remoteWorkPolicy": "Fully Remote",
    "experience": "Open to all levels",
    "skills": [
      "Frontend Development",
      "Blockchain",
      "Decentralized Applications (dapps)",
      "Cross-chain Protocol"
    ],
    "company": {
      "name": "Synapse Protocol",
      "description": "Universal interoperability protocol that enables secure cross-chain communication",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Innovative Blockchain Project"
        }
      ],
      "markets": [
        "Blockchain",
        "Interoperability",
        "Cross-chain Communication",
        "Decentralized Applications"
      ]
    }
  }
]
