[
  {
    "url": "https://wellfound.com/company/traba-3/jobs/2602409-software-engineer",
    "title": "Software Engineer at Traba",
    "location": "New York City",
    "compensation": "$120k – $165k Wellfound Est.",
    "published": "1 week ago",
    "description": "Traba’s mission is to empower workers and businesses to reach their full productivity and potential. We are revolutionizing the broken staffing industry through a marketplace that connects workers with flexible, meaningful opportunities while providing businesses with reliable, on-demand talent. By connecting both, we unlock new levels of productivity, earning potential, and avenues for growth. We’re proud to be backed by the world’s best investors, such as Founders Fund, Khosla Ventures, and General Catalyst. We are seeking an experienced &amp; entrepreneurial full-stack engineer to join the founding team to help build our core suite of products—the React Native worker mobile app, the React/Node.js business web app, and a React/Node.js tools platform for our ops team. You'll partner with our CTO to help provide key input on the product roadmap, own product decisions, and build our foundational tech platform. About You Voracious learner. You love diving into new areas and exploring new languages, frameworks, and technologies, and can discuss product with a UX designer one minute and deployment infrastructure with tech leads the next. Value clear communication. You recognize the importance of clear communication, documented planning, and transparent, frequent feedback. Sweat the small stuff. You have strong opinions on design patterns, IDEs, tabs vs. spaces—you understand that how you do one thing is how you do everything, so you care about the details. Experience with or desire to learn React Native. You have the front-end chops to build beautiful performant apps and love creating products that delight users. You Will Write &amp; review high quality, performant code for our React Native mobile app, React/Typescript web apps, and Firebase/Node.js/PostgreSQL APIs Architect &amp; document our tech platform and advise key product &amp; infrastructure decisions Collaborate with designers to implement pixel-perfect, eye-pleasing UIs Implement our CI/CD workflows, using Docker &amp; GitlabCI Add analytics &amp; monitoring to help understand our user experience &amp; application health Contribute in a ton of other ways to a scrappy founding team building the future of flexible light industrial staffing! You Have 3+ years experience with Typescript, Javascript, React Native, React, Node.js, and PostgreSQL Experience with Firebase &amp; Docker Experience working in an early-stage engineering team, working through ambiguity, and being a self-starter A passion for helping people find meaningful work that works for them Benefits: Founding Equity in Traba 100% healthcare, dental, and vision Dinner provided in office + a fully stocked kitchen! Health Advocate coverage, Gympass, OneMedical, Teladoc Virtual, TalkSpace Mental Health Therapy Our Values Dream BIG - We are on a path to change the world for the better. We create and communicate a bold direction that inspires a life-changing vision. We don’t sacrifice long-term value for short-term results. Olympian’s Work Ethic - Changing the world never comes easy. We work harder, longer, and smarter, not just two out of three. We put everything we have on the field. Growth Mindset - We confront the toughest challenges head-on and persevere. Sometimes we fail, but we brush ourselves off, adapt, learn, and push forward with resilience. Customer Obsession - We go the extra mile for our workers and businesses. We remain focused on delivering high-quality products and services that solve these often overlooked communities’ problems. What is light industrial labor? Light industrial flexible staffing is a $40B labor market that encompasses entry-level jobs in warehouses &amp; distribution centers. These workers pack boxes, load trucks, and manage warehouse operations to keep supply chains running at peak efficiency. Our workers also help event companies set up and take down equipment (such as chairs, tables, or a concert stage).",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "",
      "position": ""
    },
    "company": {
      "name": "Traba",
      "description": "Traba connects you to vetted and proven workers with open shifts",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/9413568-13482b87426021829e2ed84449b563d0-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/traba-3",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        },
        {
          "text": "Same investor as Airbnb"
        }
      ],
      "markets": ["Technology", "Staffing Firms"],
      "locations": ["Miami", "New York City"],
      "totalRaised": "$23.6M"
    }
  },
  {
    "url": "https://wellfound.com/company/whop/jobs/2703543-senior-software-engineer",
    "title": "Senior Software Engineer at Whop",
    "location": "New York City • Brooklyn",
    "compensation": "$180k – $240k • 0.2% – 0.3%",
    "published": "1 week ago",
    "description": "About Whop: Whop is building a platform to service the internet economy. Millions of people are building new products that they are selling guerrilla style on social media and on forums throughout the internet. Whop gives these sellers a sleek storefront that can accept payments, seamlessly deliver digital products, and attract new customers visiting our marketplace. We currently handle over $100M+ in yearly payments with thousands of active merchants. To further our important mission of helping everyone start internet businesses, we are looking for an experienced senior engineer to help lead and grow a team. This role will oversee the major architectural changes, sprint planning, as well as aid in core infrastructure improvements and enhancements. To make $5,000 by referring someone you know, please use this form. About the role: Title: Senior Software Engineer Salary: $180K - $240K | Equity: 0.2% - 0.3% Location: Brooklyn, NY Meals: Paid for lunch and dinner of your choice everyday Gym: State of the art gym access in beautiful office building Technology: Latest 16 inch Macbook Pro + 2 Studio Display Monitors The role is broad in scope and requires the ability to switch contexts without losing sight of the most important objectives. Who you are You love high level architecture and debating implementations. You are hard working, relentless, and understand that building something great takes grit. You are exceptionally organized and efficient. You geek out over the latest technical implementations. You love getting under the hood. You can dig into details, learn from mistakes, and figure out the underlying reasons for bad and good outcomes. You love solving unsolved problems that are incredibly difficult. If this sounds like you regardless of your background, we’d love to hear from you. Responsibilities Build and architect features from scratch. Plan, execute, and maintain projects. Make our current codebase more scaleable. Improve developer experience and onboarding for new developers joining our team. Build scalable solutions on “how to” do things from a product standpoint. Key Qualifications 4+ years developing full-stack applications professionally Experience with modern frontend javascript frameworks Experience with GraphQL preferred Experience integrating payment services (Stripe, PayPal, checkout.com) preferred Ability to quickly learn new technologies on the job Our Tech Stack Next.JS + Typescript React + Tailwind Ruby on Rails Postgres + Redis Heroku, Vercel Notion, Slack, GitHub Linear",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "remoteWorkPolicy": "In office",
    "experience": "4+ years",
    "skills": ["TypeScript", "React.js", "Next.Js"],
    "hiringContact": {
      "name": "steven schwartz",
      "position": "Employee"
    },
    "company": {
      "name": "Whop",
      "description": "Whop is building a marketplace to service the internet economy",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8463438-8ab94a258570442cff15546dbc8bfa88-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/whop",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Recently funded"
        }
      ],
      "markets": ["SaaS", "Marketplaces", "Startups"],
      "totalRaised": "$17M"
    }
  },
  {
    "url": "https://wellfound.com/company/whop/jobs/2703544-senior-backend-engineer-ruby-on-rails",
    "title": "Senior Backend Engineer - Ruby on Rails at Whop",
    "location": "New York City • Brooklyn",
    "compensation": "$200k – $260k • 0.2% – 0.3%",
    "published": "1 month ago",
    "description": "About Whop: Whop is building a platform to service the internet economy. Millions of people are building new products that they are selling guerrilla style on social media and on forums throughout the internet. Whop gives these sellers a sleek storefront that can accept payments, seamlessly deliver digital products, and attract new customers visiting our marketplace. We currently handle over $100M+ in yearly payments with thousands of active merchants. To further our important mission of helping everyone start internet businesses, we are looking for an experienced senior engineer to help lead and grow a team. This role will oversee the major architectural changes, sprint planning, as well as aid in core infrastructure improvements and enhancements. To make $5,000 by referring someone you know, please use this form. About the role: Title: Senior Software Engineer Salary: $200K - $260K | Equity: 0.2% - 0.3% Location: Brooklyn, NY Meals: Paid for lunch and dinner of your choice everyday Gym: State of the art gym access in beautiful office building Technology: Latest 16 inch Macbook Pro + 2 Studio Display Monitors The role is broad in scope and requires the ability to switch contexts without losing sight of the most important objectives. Who you are You love high level architecture and debating implementations. You are hard working, relentless, and understand that building something great takes grit. You are exceptionally organized and efficient. You geek out over the latest technical implementations. You love getting under the hood. You can dig into details, learn from mistakes, and figure out the underlying reasons for bad and good outcomes. You love solving unsolved problems that are incredibly difficult. If this sounds like you regardless of your background, we’d love to hear from you. Responsibilities Build and architect features from scratch. Plan, execute, and maintain projects. Make our current codebase more scaleable. Improve developer experience and onboarding for new developers joining our team. Build scalable solutions on “how to” do things from a product standpoint. Key Qualifications 4+ years developing full-stack applications professionally Experience with modern frontend javascript frameworks Experience with GraphQL preferred Experience integrating payment services (Stripe, PayPal, checkout.com) preferred Ability to quickly learn new technologies on the job Our Tech Stack Next.JS + Typescript React + Tailwind Ruby on Rails Postgres + Redis Heroku, Vercel Notion, Slack, GitHub Linear",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "remoteWorkPolicy": "In office",
    "experience": "4+ years",
    "skills": ["TypeScript", "React.js", "Next.Js"],
    "hiringContact": {
      "name": "steven schwartz",
      "position": "Employee"
    },
    "company": {
      "name": "Whop",
      "description": "Whop is building a marketplace to service the internet economy",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8463438-8ab94a258570442cff15546dbc8bfa88-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/whop",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Recently funded"
        }
      ],
      "markets": ["SaaS", "Marketplaces", "Startups"],
      "totalRaised": "$17M"
    }
  },
  {
    "url": "https://wellfound.com/company/fintron/jobs/2734547-staff-software-engineer-backend",
    "title": "Staff Software Engineer, Backend at FinTron",
    "location": "Remote • California • New York City • Pennsylvania • Texas • Utah • Massachusetts • Connecticut • New Jersey",
    "compensation": "$190k – $230k",
    "published": "today",
    "description": "About Us FinTron Invest is a fast-growing FinTech startup, SEC registered, FINRA member broker-dealer. FinTron is on a mission to make investing, banking, and personal financial management more accessible and appealing to young consumers. FinTron is deeply rooted in the belief that investing has been intimidating for too long, and that anyone should be able to take control of their finances (not just the 1%). FinTron operates a direct-to-consumer FinTech app, an EdTech platform, and B2B embedded technology solutions. We are an agile, tech-enabled company, we are committed to educating and serving Gen Y &amp; Z. Job Description As a backend Staff Software Engineer, you will work with developers, and operational staff to play a critical role in the development of FinTron’s B2B offering and maintaining FinTron’s direct-to-consumer application. You will be working on significant critical projects and will take responsibility for all facets of the development process. You will support and mentor other team members to improve team performance and velocity. We are looking for a highly experienced developer who is eager to join our team in building a modern event Driven microservice architecture to support our auto-scalable and highly available multi-tenant SaaS platform. Job Responsibilities Hands-on senior developer capabilities, individualistic contributor, and a team player A strong command of domain driven design and building large scale, fault-tolerant distributed systems Ability to own the end-to-end delivery of products from inception to production Lead a team of engineers and have strong conflict-resolution skills Optimize application performance by identifying and addressing bottlenecks, implementing best practices, and leveraging modern mobile and web development tools and techniques. Conduct code reviews, provide constructive feedback to team members, and ensure adherence to best practices and coding standards. Can coordinate releases in a timely manner and maintain deadlines Creative problem solver with a passion for testing, debugging, and overall code quality Participate in agile development processes, including sprint planning, daily stand-ups, and sprint retrospectives. Effectively communicate technical concepts and progress updates to both technical and non-technical stakeholders. The engineer will be reporting directly to the CTO; working in close collaboration with the existing development team. The developer should be well-versed in current technological trends and familiar with a variety of languages and databases as outlined below. You’ll be utilizing several languages and technologies such as: Go Python Pytest and other testing frameworks Protocol Buffers GraphQL SigNoz gRPC AWS (VPC, EC2, RDS, S3, Glacier, CloudTrail, Route 53, Inspector, Systems Manager, and GuardDuty) Jenkins Github Actions PostgreSQL RedPanda or Kafka Desired Qualification &amp; Background 10+ years of programming experience, with significant experience in Golang, Python, and AWS. 3+ years as an engineering manager Startup experience strongly preferred in the fintech space Experience with end-to-end full-stack mobile, web, and QA testing Strong command of SQL, PostgreSQL, and MongoDB Excellent verbal and written communication with C-suite Manage time efficiently and is highly collaborative Strong leadership skills and ability to manage a team of developers Ability to meet tight deadlines under pressure Preferred: BSc/BA in Computer Science, Engineering or a related field; MBA or other relevant graduate degree is a plus Why join the FinTron Team? Remote friendly Competitive cash/equity blend compensation Unlimited room for self-growth and opportunity with a scaling fintech startup Located in Stamford, CT less than 1 mile from the train station Casual dress code &amp; holistic workplace environment Opportunity to be a part of a close-knitted &amp; quirky company culture, immerse yourself in highly interactive work with a talented, energetic and passionate team! PTO Health Insurance Program Gym Membership On-Site Salary and stock options package commensurate with experience. Actual salaries will vary and will be based on various factors, such as the candidate’s qualifications, skills, experience, and competencies, as well as internal equity and alignment with market data for companies of our size and industry. FinTron is proud to be an Affirmative Action Equal Opportunity Employer and is committed to building an inclusive environment for people of all backgrounds. We celebrate people of all race, color, religion, age, sex, national origin, disability status, genetics, veteran status, sexual orientation, gender identity, expression, or any other status protected by law.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "preferredTimezones": "Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "10+ years",
    "skills": [
      "Python",
      "PostgreSQL",
      "Jenkins",
      "Backend Development",
      "AWS/EC2/ELB/S3/DynamoDB",
      "SDK",
      "Go (Golang)",
      "Grpc",
      "GraphQL",
      "Multitenancy",
      "Pytest",
      "Redpanda"
    ],
    "hiringContact": {
      "name": "Kristina DiNardo",
      "position": "Director of Human Resources • 3 years"
    },
    "company": {
      "name": "FinTron",
      "description": "Accelerating personal finance for the Mobile-First Generation!",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7076095-1e97075f5eb0a2b2509e102a242b32dc-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/fintron",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Mobile",
        "Financial Services",
        "Education",
        "Personal Finance",
        "Application Platforms",
        "Apps",
        "Banking",
        "Finance Technology",
        "E Banking",
        "Education Technology",
        "Mobile Application",
        "Edtech",
        "Website",
        "Fin Tech"
      ],
      "locations": ["Connecticut", "Stamford", "Fairfield County"],
      "totalRaised": "$7.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/thirdweb-1/jobs/2354211-software-engineer-infrastructure",
    "title": "Software Engineer, Infrastructure at thirdweb",
    "location": "Remote • San Francisco • Brooklyn",
    "compensation": "$160k – $240k • 0.05% – 0.3%",
    "published": "1 month ago",
    "description": "What is thirdweb? Glad you asked! We’re empowering builders to create a new generation of the internet. Cool. So, what does that mean? We make building in web3 incredibly easy. Our tools help everyone from developers to creators build the web3 apps and features of their dreams. Y’know, no one knows what exactly the future of web3 will look like, but what we do know is that it will a transformative impact on our world. That’s why we’re focused on unleashing the many promises of web3 to a whole generation of builders. Because when builders have the right tools at their fingertips—magic happens. We started thirdweb in the second half of 2021 and our community of builders has exploded ever since. Over 1M unique wallets have interacted with our contracts on mainnet, deploying tens of thousands of projects to the same. It’s been a hell of a journey so far, and the momentum is only increasing. We’re looking to grow our team to help us become the default platform of choice for anyone who wants to build web3 apps and services. Our Founders thirdweb was founded by builders with deep experience in tech and a track record of creating epic companies: Furqan Rydhan, previous Founder and CTO of Applovin (IPO), and CTO of Bebo (Acquired by Amazon); and Steven Bartlett, previous Founder and CEO of Social Chain (IPO). Now they’ve got their sights set on a new challenge, and are building a bold team to pave the way with them. *What we offer: * 🧾 Competitive salary, equity, 401K 👩‍⚕️ Full healthcare, vision, dental ⌨️ $1,500 home office equipment stipend 💻 Latest and greatest laptop of your choice 💪 Physical and mental wellness programs 🏢 Office stipend to rent out-of-home office space ✈️ The ability to work remotely or in one of our stunning office spaces in Fort Mason, San Francisco and Williamsburg, Brooklyn. The role Work in a small team of engineers to build excellent developers' experiences on thirdweb. You will build the infrastructure that powers the thirdweb platform. You will make critical decisions on setting up the infrastructure for the unified interface to upload files to decentralized storage, web, and blockchain analytical data pipeline, and low latency indexing for smart contracts. What a typical week might look like Plan, develop, and support core products for decentralized storage uploader, data infrastructure, and indexers. Collaborate with the team to brainstorm solutions to customer challenges, plan new features, and extract learnings from technical misses Communicate with our customers to assist in integrating thirdweb into their application or platform Outside-the-box critical thinking in solution designs to push the limit of decentralization without compromising user experiences. Maintain operational excellence and high availability for all services What we're looking for Have 2+ years experience on a software development team for a developer-focused product Have experience in Typescript, Python, Go or Rust Have experience in automating software delivery orchestration using Docker and Kubernetes Are passionate about decentralization, especially for data availability, and constantly pushing the boundary of decentralized technologies Are excited about working in a fast-paced, unstructured environment that prioritizes delivering impact and learning over process Are curious about technology outside of your direct expertise and have an appetite for learning Are a self-starter in proposing and carrying out technical solutions to ambiguous business problems Know when and how to make calculated tradeoffs to meet the needs of the customer and business Bonus Points Experience in developer-first products (SDKs, API design, technical documentation) Experience in blockchain development and technologies (EVM, L2, Solana, Flow, NEAR, Cosmos) Experience in developing scalable real-time systems",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "preferredTimezones": "Hawaii, Alaska, Pacific Time, Mountain Time, Central Time, Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "2+ years",
    "skills": [
      "Python",
      "TypeScript",
      "Docker",
      "React.js",
      "Go (Golang)",
      "Blockchain",
      "Kubernetes",
      "Rust​",
      "Docker / Docker Compose / Kubernetes"
    ],
    "hiringContact": {
      "name": "Adam Lee",
      "position": "Head of Corp Dev & Strategy • 1 year"
    },
    "company": {
      "name": "thirdweb",
      "description": "we make it easy to build web3 apps",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8582367-4b6588765b8f2c82b3a0b69f0c2e9d05-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/thirdweb-1",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Developer Tools",
        "Blockchain / Cryptocurrency",
        "Web3",
        "NFT"
      ],
      "locations": ["New York City", "San Francisco"],
      "totalRaised": "$29M"
    }
  },
  {
    "url": "https://wellfound.com/company/thirdweb-1/jobs/2692841-software-engineer-contracts",
    "title": "Software Engineer, Contracts at thirdweb",
    "location": "Remote • San Francisco • Brooklyn",
    "compensation": "0.05% – 0.3%$135k – $190k Wellfound Est.",
    "published": "1 month ago",
    "description": "*What is thirdweb? * Glad you asked! We’re empowering builders to create a new generation of the internet. Cool. So, what does that mean? We make building in web3 incredibly easy. Our tools help everyone from developers to creators build the web3 apps and features of their dreams. Y’know, no one knows what exactly the future of web3 will look like, but what we do know is that it will a transformative impact on our world. That’s why we’re focused on unleashing the many promises of web3 to a whole generation of builders. Because when builders have the right tools at their fingertips—magic happens. We started thirdweb in the second half of 2021 and our community of builders has exploded ever since. Over 1M unique wallets have interacted with our contracts on mainnet, deploying tens of thousands of projects to the same. It’s been a hell of a journey so far, and the momentum is only increasing. We’re looking to grow our team to help us become the default platform of choice for anyone who wants to build web3 apps and services. Our Founders thirdweb was founded by builders with deep experience in tech and a track record of creating epic companies: Furqan Rydhan, previous Founder and CTO of Applovin (IPO), and CTO of Bebo (Acquired by Amazon); and Steven Bartlett, previous Founder and CEO of Social Chain (IPO). Now they’ve got their sights set on a new challenge, and are building a bold team to pave the way with them. What we offer: 🧾 Competitive salary, equity, 401K 👩‍⚕️ Full healthcare, vision, dental ⌨️ $1,500 home office equipment stipend 💻 Latest and greatest laptop of your choice 💪 Physical and mental wellness programs 🏢 Office stipend to rent out-of-home office space ✈️ The ability to work remotely or in one of our stunning office spaces in Fort Mason, San Francisco and Williamsburg, Brooklyn. The role Work in a small team of engineers to build excellent developers' experiences on thirdweb. You will collaborate with the product team to simplify Web3 development across all platforms (web, mobile, backend, game engine). What a typical week might look like Plan, develop, and support core product features for [Web3 SDK], [Contracts SDK] and [smart contracts] Collaborate with the team to brainstorm solutions to customer challenges, plan new features, and extract learnings from technical misses Communicate with our customers to assist in integrating thirdweb into their application or platform Write developer documentation to explain the functionality of the SDKs Design and implement gas optimized gas contracts deployed by hundred of thousands of developers Create new smart contract frameworks and tools to help developers create safe and optimal smart contracts Engage with a large community of developers, companies and auditors accross the industry What we're looking for 1+ year of professional smart contract development experience Experience in popular languages and framework in Solidity, EVM, Foundry Excited about working in a fast-paced, unstructured environment that prioritizes delivering impact and learning over process Curious about technology outside of your direct expertise and have an appetite for learning A self-starter in proposing and carrying out technical solutions to ambiguous business problems Know when and how to make calculated tradeoffs to meet the needs of the customer and business Bonus Points Experience in developer-first products (SDKs, API design, technical documentation) Experience in blockchain development (interacting with wallets or smart contracts) Experience in blockchain technologies (EVM, L2, Solana, Flow, NEAR, Cosmos)",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "preferredTimezones": "Hawaii, Alaska, Pacific Time, Mountain Time, Central Time, Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "1+ years",
    "skills": [
      "Python",
      "TypeScript",
      "SDK",
      "Go (Golang)",
      "Rust​",
      "Solidity (Ethereum)",
      "Solana"
    ],
    "hiringContact": {
      "name": "Jake Loo",
      "position": "CTO"
    },
    "company": {
      "name": "thirdweb",
      "description": "we make it easy to build web3 apps",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8582367-4b6588765b8f2c82b3a0b69f0c2e9d05-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/thirdweb-1",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Developer Tools",
        "Blockchain / Cryptocurrency",
        "Web3",
        "NFT"
      ],
      "locations": ["New York City", "San Francisco"],
      "totalRaised": "$29M"
    }
  },
  {
    "url": "https://wellfound.com/company/thirdweb-1/jobs/2354214-software-engineer-product",
    "title": "Software Engineer, Product at thirdweb",
    "location": "Remote • San Francisco • Brooklyn",
    "compensation": "$120k – $200k • 0.05% – 0.5%",
    "published": "4 months ago",
    "description": "*What is thirdweb? * Glad you asked! We’re empowering builders to create a new generation of the internet. Cool. So, what does that mean? We make building in web3 incredibly easy. Our tools help everyone from developers to creators build the web3 apps and features of their dreams. Y’know, no one knows what exactly the future of web3 will look like, but what we do know is that it will a transformative impact on our world. That’s why we’re focused on unleashing the many promises of web3 to a whole generation of builders. Because when builders have the right tools at their fingertips—magic happens. We started thirdweb in the second half of 2021 and our community of builders has exploded ever since. Over 1M unique wallets have interacted with our contracts on mainnet, deploying tens of thousands of projects to the same. It’s been a hell of a journey so far, and the momentum is only increasing. We’re looking to grow our team to help us become the default platform of choice for anyone who wants to build web3 apps and services. Our Founders thirdweb was founded by builders with deep experience in tech and a track record of creating epic companies: Furqan Rydhan, previous Founder and CTO of Applovin (IPO), and CTO of Bebo (Acquired by Amazon); and Steven Bartlett, previous Founder and CEO of Social Chain (IPO). Now they’ve got their sights set on a new challenge, and are building a bold team to pave the way with them. What we offer: 🧾 Competitive salary, equity, 401K 👩‍⚕️ Full healthcare, vision, dental ⌨️ $1,500 home office equipment stipend 💻 Latest and greatest laptop of your choice 💪 Physical and mental wellness programs 🏢 Office stipend to rent out-of-home office space ✈️ The ability to work remotely or in one of our stunning office spaces in Fort Mason, San Francisco and Williamsburg, Brooklyn. The role Work in a small team of engineers to build excellent developers' experiences on thirdweb. You will collaborate with the design and product team to bring great user experiences to life for Dashboard and Developer Portal. What a typical week might look like Plan, develop, and support core product features for Dashboard, Developer Portal, CLI and React SDK Collaborate with the team to brainstorm solutions to solve customer challenges, plan new features, and extract learnings from technical misses Communicate with our customers to assist in integrating thirdweb into their application or platform Write documentation to explain how new product features work What we're looking for 2+ years experience on a software development team for a product-focused web application Experience in Javascript web frameworks (React, Next.js, Docusaurus), Typescript, or NodeJS Excited about working in a fast-paced, unstructured environment that prioritizes delivering impact and learning over process Curious about technology outside of your direct expertise and have an appetite for learning A self-starter in proposing and carrying out technical solutions to ambiguous business problems Know when and how to make calculated tradeoffs to meet the needs of the customer and business Bonus points Experience in developer-first products (SDKs, API design, technical documentation) Experience in blockchain development (interacting with wallets or smart contracts)",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "preferredTimezones": "Hawaii, Alaska, Pacific Time, Mountain Time, Central Time, Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "2+ years",
    "skills": [
      "Javascript",
      "API",
      "TypeScript",
      "SDK",
      "React.js",
      "NodeJS",
      "Next.Js"
    ],
    "hiringContact": {
      "name": "Furqan Rydhan",
      "position": "Founder • 2 years"
    },
    "company": {
      "name": "thirdweb",
      "description": "we make it easy to build web3 apps",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8582367-4b6588765b8f2c82b3a0b69f0c2e9d05-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/thirdweb-1",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Developer Tools",
        "Blockchain / Cryptocurrency",
        "Web3",
        "NFT"
      ],
      "locations": ["New York City", "San Francisco"],
      "totalRaised": "$29M"
    }
  },
  {
    "url": "https://wellfound.com/company/code-climate/jobs/1443285-software-engineer",
    "title": "Software Engineer at Code Climate",
    "location": "New York",
    "compensation": "$125k – $175k Wellfound Est.",
    "published": "1 year ago",
    "description": "Code Climate empowers software engineering organizations to achieve excellence across people, process, and code with data-driven insights. Our Engineering intelligence products are trusted by thousands of organizations- from enterprises to startups - helping align engineering initiatives with strategic priorities, accelerate software delivery, and drive continuous improvement. Code Climate is based in New York and was founded in 2011, by engineering leaders who were frustrated by decisions being made in the dark or by gut instinct. Code Climate envisions a world where technology leaders can drive business success through increased transparency, efficiency, and actionable data. Since the launch of our company, our automated code review tool, Quality, has helped over 100,000 developers improve their code bases. After nearly a decade, we launched our flagship product, Velocity. Velocity enables technology leaders to make confident, data-driven decisions that fuel elite team performances at scale. The Engineering Team at Code Climate is responsible for building our polished customer-facing experiences and the underlying technology platform, which processes about two billion lines of source code every weekday across more than 10 programming languages (including Java, JavaScript, Ruby, Go, Python and Swift). We are a small but growing and highly effective team, whereas every team member is vital to the success of the company. We are certain that you will have the opportunity to work on significant technical projects and grow tremendously as an engineer through the unique challenges we face as a company that is growing immensely in 2022. Examples of Problems You’ll Be Solving: Working across the stack to deliver new features for Quality and Velocity. Collaborate with Product and Design to develop engaging and usable UIs for both our products. Improve the performance of our scaling platform. Monitor all of the above in a scalable way. We all do ops, so we depend on automation. Contribute to our agile development process by participating in code reviews, stand-ups, sprint planning, and retrospectives. Develop your solution incrementally and deploy often, sometimes several times a day, using CI/CD. Interact with a wide range of technologies like AWS, Docker, Kafka, MongoDB and more! You’re Awesome Because: You have 3+ years of Ruby on Rails experience. You have 3+ years of ReactJS experience. You love solving big problems. You want to have an impact on the software engineering community. You enjoy being with peers who strive for engineering excellence. You like working in a fast paced environment. You always want to learn more and constantly improve as an engineer. You are passionate about building maintainable, efficient, clean code. You have a strong sense of product and empathy for the human who is using it. Desired Qualifications: You have familiarity with Docker You have been part of a team that works on large-scale distributed systems and are comfortable working in JavaScript. Working at Code Climate New York-headquartered startup with a hybrid working environment. Fast paced, high growth, start-up full of talented and mission driven individuals that love what they do. Competitive salary and meaningful stock options. Health, dental and vision insurance. We pay 100% of the premium for employees and 50% of the premium for dependents. Flexible and generous paid time off including an open vacation policy and parental leave. Opportunities to continue your professional development, including attending conferences. The best technology to get your job done. Base Salary - 125-160k / year Backed by leading VC firms, including PSG, Union Square Ventures, Foundry Group, Lerer Hippeau Ventures, and NextView Ventures, Code Climate has raised $66M in funding to date having closed a Series C round in August 2021. Code Climate is an equal opportunity employer. Consistent with our mission of serving a diverse and global audience, we value a diverse workforce and inclusive culture which reflects that. We encourage applications from all qualified individuals without regard to race, color, religion gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Bryan Helmkamp",
      "position": "CEO • 13 years"
    },
    "company": {
      "name": "Code Climate",
      "description": "Giving you the insights you need to make lasting improvements to your team’s productivity",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/141031-a0a5921bd4348d315f0f7bbaa70cb6c1-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/code-climate",
      "badges": [
        {
          "text": "Same investor as Twitter"
        }
      ],
      "markets": [
        "SaaS",
        "B2B",
        "Analytics",
        "Business Intelligence",
        "Developer Tools",
        "Software Engineering"
      ],
      "locations": ["New York City", "New York"],
      "totalRaised": "$15M"
    }
  },
  {
    "url": "https://wellfound.com/company/code-climate/jobs/1982278-senior-system-reliability-engineer",
    "title": "Senior System Reliability Engineer  at Code Climate",
    "location": "New York",
    "compensation": "$165k – $200k Wellfound Est.",
    "published": "1 year ago",
    "description": "Code Climate empowers software engineering organizations to achieve excellence across people, process, and code with data-driven insights. Our Engineering intelligence products are trusted by thousands of organizations- from enterprises to startups - helping align engineering initiatives with strategic priorities, accelerate software delivery, and drive continuous improvement. Code Climate is based in New York and was founded in 2011, by engineering leaders who were frustrated by decisions being made in the dark or by gut instinct. Code Climate envisions a world where technology leaders can drive business success through increased transparency, efficiency, and actionable data. Since the launch of our company, our automated code review tool, Quality, has helped over 100,000 developers improve their code bases. After nearly a decade, we launched our flagship product, Velocity. Velocity enables technology leaders to make confident, data-driven decisions that fuel elite team performances at scale. As the first SRE at Code Climate, you’ll be collaborating closely with the VP of Engineering, Director of Engineering and Senior Engineers to identify and make changes that increase the security, reliability and performance of our system. The code climate Engineering team cares deeply about infrastructure and developer best practices. Our infrastructure is managed entirely by Terraform, we have a comprehensive monitoring and alerting in place using Datadog and ship to production multiple times each day using our chatops driven CI/CD system. We’re looking for an experienced SRE to join our team and take what’s in place today to the next level, as we scale to hundreds of thousands of users. Examples of Problems You’ll Be Solving: Build and maintain our infrastructure (with Terraform) to run our set of applications. Infrastructure scaling strategy based on usage and stress metrics. Responsibility of our disaster recovery plan and our infrastructure fault tolerant strategy. Apply security patches to our AMIs on a regular basis. Interact as an Engineer with a wide range of technologies including AWS, Docker, Postgres, Kafka/Kinesis &amp; Ruby. You’re Awesome Because: You’re interested in security, reliability and infrastructure as code. You are looking for a role that gives you exposure to a broad range of challenges. You enjoy working with others, and thrive in a dynamic fast-paced environment. You are passionate about your work and want to contribute to building a product that impacts the software development community. You value mentoring juniors and sharing knowledge in a blame-free environment. Desired Qualifications: 4+ years AWS experience. 4+ years Terraform and scripting languages (e.g. Python, Ruby, BASH, …). Proficiency in load/stress testing. Efficient communication skills. Experience with Kubernetes is a plus. Working at Code Climate New York-headquartered startup with a hybrid working environment. Fast paced, high growth, start-up full of talented and mission driven individuals that love what they do. Competitive salary and meaningful stock options. Health, dental and vision insurance. We pay 100% of the premium for employees and 50% of the premium for dependents. Flexible and generous paid time off including an open vacation policy and parental leave. Opportunities to continue your professional development, including attending conferences. The best technology to get your job done. Base Salary - 145-200k / year Backed by leading VC firms, including PSG, Union Square Ventures, Foundry Group, Lerer Hippeau Ventures, and NextView Ventures, Code Climate has raised $66M in funding to date having closed a Series C round in August 2021. Code Climate is an equal opportunity employer. Consistent with our mission of serving a diverse and global audience, we value a diverse workforce and inclusive culture which reflects that. We encourage applications from all qualified individuals without regard to race, color, religion gender, sexual orientation, gender idenity or expresion, age, national origin, maritial status, disability, and veteran status.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Bryan Helmkamp",
      "position": "CEO • 13 years"
    },
    "company": {
      "name": "Code Climate",
      "description": "Giving you the insights you need to make lasting improvements to your team’s productivity",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/141031-a0a5921bd4348d315f0f7bbaa70cb6c1-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/code-climate",
      "badges": [
        {
          "text": "Same investor as Twitter"
        }
      ],
      "markets": [
        "SaaS",
        "B2B",
        "Analytics",
        "Business Intelligence",
        "Developer Tools",
        "Software Engineering"
      ],
      "locations": ["New York City", "New York"],
      "totalRaised": "$15M"
    }
  },
  {
    "url": "https://wellfound.com/company/traba-4/jobs/2291472-software-engineer",
    "title": "Software Engineer at Traba",
    "location": "New York City",
    "compensation": "$120k – $165k Wellfound Est.",
    "published": "1 year ago",
    "description": "Traba’s mission is to empower workers and businesses to reach their full productivity and potential. We are revolutionizing the broken staffing industry through a marketplace that connects workers with flexible, meaningful opportunities while providing businesses with reliable, on-demand talent. By connecting both, we unlock new levels of productivity, earning potential, and avenues for growth. We’re proud to be backed by the world’s best investors, such as Founders Fund, Khosla Ventures, and General Catalyst. We are seeking an experienced &amp; entrepreneurial full-stack engineer to join the founding team to help build our core suite of products—the React Native worker mobile app, the React/Node.js business web app, and a React/Node.js tools platform for our ops team. You'll partner with our CTO to help provide key input on the product roadmap, own product decisions, and build our foundational tech platform. About You Voracious learner. You love diving into new areas and exploring new languages, frameworks, and technologies, and can discuss product with a UX designer one minute and deployment infrastructure with tech leads the next. Value clear communication. You recognize the importance of clear communication, documented planning, and transparent, frequent feedback. Sweat the small stuff. You have strong opinions on design patterns, IDEs, tabs vs. spaces—you understand that how you do one thing is how you do everything, so you care about the details. Experience with or desire to learn React Native. You have the front-end chops to build beautiful performant apps and love creating products that delight users. You Will Write &amp; review high quality, performant code for our React Native mobile app, React/Typescript web apps, and Firebase/Node.js/PostgreSQL APIs Architect &amp; document our tech platform and advise key product &amp; infrastructure decisions Collaborate with designers to implement pixel-perfect, eye-pleasing UIs Implement our CI/CD workflows, using Docker &amp; GitlabCI Add analytics &amp; monitoring to help understand our user experience &amp; application health Contribute in a ton of other ways to a scrappy founding team building the future of flexible light industrial staffing! You Have 3+ years experience with Typescript, Javascript, React Native, React, Node.js, and PostgreSQL Experience with Firebase &amp; Docker Experience working in an early-stage engineering team, working through ambiguity, and being a self-starter A passion for helping people find meaningful work that works for them Benefits: Founding Equity in Traba 100% healthcare, dental, and vision Dinner provided in office + a fully stocked kitchen! Health Advocate coverage, Gympass, OneMedical, Teladoc Virtual, TalkSpace Mental Health Therapy Our Values Dream BIG - We are on a path to change the world for the better. We create and communicate a bold direction that inspires a life-changing vision. We don’t sacrifice long-term value for short-term results. Olympian’s Work Ethic - Changing the world never comes easy. We work harder, longer, and smarter, not just two out of three. We put everything we have on the field. Growth Mindset - We confront the toughest challenges head-on and persevere. Sometimes we fail, but we brush ourselves off, adapt, learn, and push forward with resilience. Customer Obsession - We go the extra mile for our workers and businesses. We remain focused on delivering high-quality products and services that solve these often overlooked communities’ problems. What is light industrial labor? Light industrial flexible staffing is a $40B labor market that encompasses entry-level jobs in warehouses &amp; distribution centers. These workers pack boxes, load trucks, and manage warehouse operations to keep supply chains running at peak efficiency. Our workers also help event companies set up and take down equipment (such as chairs, tables, or a concert stage).",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Mike Shebat",
      "position": "Employee"
    },
    "company": {
      "name": "Traba",
      "description": "Our mission is to connect workers & businesses to unlock productivity & earning potential",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8430211-17cdbb6cb65fb4e7384d161053773a18-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/traba-4",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": ["Technology", "Future Of Work"],
      "totalRaised": "$20M"
    }
  },
  {
    "url": "https://wellfound.com/company/traba-4/jobs/2291473-senior-software-engineer",
    "title": "Senior Software Engineer at Traba",
    "location": "New York City",
    "compensation": "$145k – $190k Wellfound Est.",
    "published": "1 year ago",
    "description": "Traba’s mission is to empower workers and businesses to reach their full productivity and potential. We are revolutionizing the broken staffing industry through a marketplace that connects workers with flexible, meaningful opportunities while providing businesses with reliable, on-demand talent. By connecting both, we unlock new levels of productivity, earning potential, and avenues for growth. We’re proud to be backed by the world’s best investors, such as Founders Fund, Khosla Ventures, and General Catalyst. We are seeking an experienced &amp; entrepreneurial full-stack engineer to join the founding team to help build our core suite of products—the React Native worker mobile app, the React/Node.js business web app, and a React/Node.js tools platform for our ops team. You'll partner with our CTO to help make key architectural decisions, iterate on the product roadmap, own product decisions, and architect &amp; build our foundational tech platform. About You: Voracious learner. You love diving into new areas and exploring new languages, frameworks, and technologies, and can discuss product with a UX designer one minute and deployment infrastructure with tech leads the next. Value clear communication. You recognize the importance of clear communication, documented planning, and transparent, frequent feedback. Sweat the small stuff. You have strong opinions on design patterns, IDEs, tabs vs. spaces—you understand that how you do one thing is how you do everything, so you care about the details. Deep experience building full-stack web applications. You have designed and built performant, scalable applications, and have expertise in developing APIs, data modeling, &amp; deploying &amp; scaling distributed systems. You Will: Architect and lead the development of our React/Typescript web apps and Firebase/Node.js APIs Architect &amp; document our tech platform and advise key product &amp; infrastructure decisions Implement our CI/CD workflows, using Docker &amp; Github Build analytics &amp; monitoring to help understand our user experience &amp; application health Contribute in a ton of other ways to a scrappy founding team building the future of flexible light industrial staffing! You Have: 5+ years experience with Typescript, Javascript, React Native, React, Node.js, Nest.js, and noSQL Experience with Firebase &amp; Docker Experience building APIs Experience working in an early-stage engineering team, working through ambiguity, and being a self-starter A passion for helping people find meaningful work that works for them Benefits: Founding Equity in Traba 100% healthcare, dental, and vision Dinner provided in office + a fully stocked kitchen! Health Advocate coverage, Gympass, OneMedical, Teladoc Virtual, TalkSpace Mental Health Therapy Our Values Dream BIG - We are on a path to change the world for the better. We create and communicate a bold direction that inspires a life-changing vision. We don’t sacrifice long-term value for short-term results. Olympian’s Work Ethic - Changing the world never comes easy. We work harder, longer, and smarter, not just two out of three. We put everything we have on the field. Growth Mindset - We confront the toughest challenges head-on and persevere. Sometimes we fail, but we brush ourselves off, adapt, learn, and push forward with resilience. Customer Obsession - We go the extra mile for our workers and businesses. We remain focused on delivering high-quality products and services that solve these often overlooked communities’ problems. What is light industrial labor? Light industrial flexible staffing is a $40B labor market that encompasses entry-level jobs in warehouses &amp; distribution centers. These workers pack boxes, load trucks, and manage warehouse operations to keep supply chains running at peak efficiency. Our workers also help event companies set up and take down equipment (such as chairs, tables, or a concert stage).",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Mike Shebat",
      "position": "Employee"
    },
    "company": {
      "name": "Traba",
      "description": "Our mission is to connect workers & businesses to unlock productivity & earning potential",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8430211-17cdbb6cb65fb4e7384d161053773a18-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/traba-4",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": ["Technology", "Future Of Work"],
      "totalRaised": "$20M"
    }
  },
  {
    "url": "https://wellfound.com/company/wingspanapp/jobs/2629420-senior-software-engineer",
    "title": "Senior Software Engineer at Wingspan",
    "location": "Remote • New York",
    "compensation": "$130k – $155k",
    "published": "3 months ago",
    "description": "Who We Are In today’s economy, an increasing number of workers are choosing to freelance. By 2027, half the U.S. workforce will be independent contractors. Yet there is no system of record for this vast self-employed community and the legions of businesses that increasingly rely on it. A new paradigm is needed to accommodate the future of work that is suddenly no longer in the future. That is what Wingspan is building. Wingspan is the first payroll platform designed specifically for independent contractors and their businesses. We make onboarding, payments, and compliance easy for flexible workforces of all sizes. Whether you’re a one-person business or a large enterprise, Wingspan has you covered. We’re a Series A startup based in NYC with backing from some of the best VCs and operators around, including Andreessen Horowitz (a16z) and the CEOs and founders of Warby Parker, Harry’s, Allbirds, Invision, and Flatiron Health. Now we're hiring for you: an ambitious individual ready to help build, design, and support enterprise-grade software scaled to millions of individuals. Are you ready to be part of a team redefining the future of work? Apply now! Impact of the Role: As a Senior Software Engineer at Wingspan, you will play a pivotal role in shaping the future of technology by developing cutting-edge solutions that empower businesses and improve people's lives. You will work alongside a team of passionate and talented engineers, helping us maintain our position as industry leaders and ensuring our products continue to outperform the competition. What you'll do: Design, develop, and implement high-quality, scalable software solutions that meet client needs and exceed expectations Collaborate with cross-functional teams to ensure seamless integration and timely delivery of projects Continuously improve and optimize existing software systems by identifying inefficiencies, refactoring code, and implementing best practices Participate in agile development processes, including sprint planning, daily standups, and retrospectives, to ensure project success and team alignment Contribute to the growth of our engineering culture by sharing knowledge, mentoring new engineering hires, and actively participating in code reviews and technical discussions Stay current with industry trends, emerging technologies, and best practices, and proactively identify opportunities to incorporate these into our tech stack Qualifications: Extensive experience with at least one back-end programming language (we use Node) Strong communication and collaboration skills, with a track record of working effectively in cross-functional teams and adapting to diverse perspectives Experience in proactively identifying opportunities for process improvements and driving the adoption of best practices to optimize cross-functional collaboration and overall team productivity. Track record of promoting a culture of continuous learning and innovation, encouraging the exploration of new technologies and techniques to enhance backend system performance and capabilities. Proven ability to lead and manage complex projects end-to-end, from initial planning and scoping to successful implementation and delivery, ensuring timely completion and alignment with business objectives. Requirements: 5+ years of professional software development experience, with a strong background in object-oriented programming Solid understanding of data structures, algorithms, and software design principles Familiarity with software testing methodologies, including unit, integration, and system testing Knowledge of industry trends, emerging technologies, and best practices in software development Experience with agile development processes, such as sprint planning, daily standups, and retrospectives Must be authorized to work in the United States. At this time we are unable to transfer or sponsor visas Compensation At Wingspan, we pride ourselves on offering a competitive and comprehensive compensation package that reflects our commitment to attracting top talent. The annual base salary for this role ranges from $155,000-$180,000 and is accompanied by a target equity package and an extensive suite of benefits, including medical, dental, and vision insurance. All figures cited are in USD and pertain to workers located in the United States. We understand that each candidate brings a unique combination of skills, experience, and qualifications to the table, which is why we tailor our compensation packages based on factors such as expertise, years of experience, certifications, and other factors. Join us in our mission to innovate and excel, knowing that you will be valued and recognized for your job-related knowledge, skills, and experience. Our comprehensive benefits and rewards are designed to help you thrive both professionally and personally, as we work together to shape the future of our industry. Benefits &amp; Perks Unlimited vacation Competitive stock option package $300 one-time WFH stipend Medical, dental, and vision benefits Top of the line 14\" Macbook Pro Travel stipend for team off-sites We appreciate candidates who are open and honest about what they’re looking for so we can ensure it’s a fit on both sides. To all recruitment firms we do not work with: Wingspan does not permit the submission of agency-provided resumes. Kindly refrain from sending resumes to our job-related email addresses and Wingspan staff members. Wingspan will not be held accountable for any charges associated with unsought resumes. At Wingspan, we are an equal opportunity employer passionately dedicated to fostering a diverse and inclusive workplace. We wholeheartedly believe that embracing diversity of perspectives and backgrounds is essential to building the best products and providing delightful experiences for our users and team members. We are proud to maintain an environment free from discrimination, retaliation, and harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, ancestry, ethnicity, marital status, pregnancy, disability, genetic information, protected veteran status, or any other characteristic protected by law or ordinance. As we strive for excellence, we are committed to ensuring fair employment practices and business dealings and rejecting any form of discrimination or retaliation. These protections and commitments extend to all management practices and decisions, including recruitment and hiring, appraisal systems, promotions, training, and career development programs. Consistent with these obligations, Wingspan also provides reasonable accommodations to employees and applicants with disabilities and for sincerely held religious beliefs, observances, and practices. If you would like to request an accommodation as part of the application process, please contact [Clifton Jadoo at [email protected]]. Join us in our mission to create a company and products we love, as we celebrate our diverse workforce and promote an inclusive work environment that drives innovation and success.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "Chicago • Los Angeles • New York City • San Diego • United States • San Francisco • San Francisco Bay Area",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "4+ years",
    "skills": ["Node.js", "TypeScript", "NodeJS"],
    "hiringContact": {
      "name": "Clifton Jadoo",
      "position": "Employee"
    },
    "company": {
      "name": "Wingspan",
      "description": "Gusto for freelancers",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7156140-6667dcb19da8daa2fb728715a670670d-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/wingspanapp",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        },
        {
          "text": "Recently funded"
        }
      ],
      "markets": [
        "Financial Services",
        "Payments",
        "Banking",
        "Finance Technology",
        "Freelancers",
        "Hr Tech",
        "Fin Tech",
        "Insurtech"
      ],
      "locations": ["New York City", "Remote"],
      "totalRaised": "$14M"
    }
  },
  {
    "url": "https://wellfound.com/company/grow-therapy/jobs/1814926-senior-software-engineer",
    "title": "Senior Software Engineer at Grow Therapy",
    "location": "Remote • New York City • United States",
    "compensation": "$150k – $170k • 0.01% – 0.1%",
    "published": "1 month ago",
    "description": "About the Role As an early engineer at Grow, you’ll have a huge amount of scope and autonomy. You get to see a number of different product surface areas (provider portal, marketplace, client experience, infrastructure, and enabling operations) in addition to working full-stack (Flask/Python on the backend, React/TypeScript on the frontend, infrastructure on AWS). What you'll do Making a robust cost estimation and eligibility checking platform - You’ll pull in data from different sources and implement the logic and infrastructure that allows us to give cost estimates for every insurance type our providers accept. Creating a world-class note-taking experience for providers - Notes are where our providers spend most of their day! You’ll own the full-stack experience of notes syncing, intelligent prefilling, and caching notes to create a best-in-class experience. Optimizing search ranking and performance at scale - there are hundreds and soon to be thousands of providers who accept many different insurance types, have unique backgrounds, and differing amounts of availability. Help us create a search algorithm that matches clients with the right therapist for them! Who you are 3+ years in engineering. You’ve built and scaled systems, made complex engineering decisions, and have proved out your technical skills in industry. Full-stack web development experience. You have experience working with REST APIs, web frameworks, an understanding of HTML, CSS, JS and at least one backend language. Entrepreneurial spirit. You have worked in a startup or on your own side projects and built products from the ground up. Product thinker. You want to build through a user-centric lens and be involved not only in engineering decisions but product and design decisions as well. Leader. You’ll do anything to achieve your goal. You know how to think on the fly and persist through setbacks and roadblocks and to motivate your teammates to do the same. Team Player. You are collaborative by nature, relish in camaraderie and group wins, and are looked to by colleagues as a steadfast partner and source of encouragement Highly Motivated. You want ownership of your work. Bonus Points Experience with React, TypeScript, and GraphQL Python and Flask Experience Interesting side projects! Engineering team principles You own what you build. You will feel ownership of the code you write, articulate the importance of the feature, and follow up to ensure it's successful. We build solutions for our providers and clients. We write code to solve user problems, not just for the sake of solving technical problems. You are not part of the tech team, but rather part of the team itself! Grow is a tech-enabled business and not a pure software business, so understanding how the business works is integral to your job. The salary range for this position is $167 - 189K per year.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "remoteWorkPolicy": "Onsite or remote",
    "skills": [],
    "hiringContact": {
      "name": "Alan Ni",
      "position": "Cofounder, CTO"
    },
    "company": {
      "name": "Grow Therapy",
      "description": "Grow enables therapists to launch their own in-network teletherapy practices",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8042601-c1415caa16e3346735fdefa1429ee606-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/grow-therapy",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": ["Software", "Health and Insurance", "Mental Health"],
      "totalRaised": "$90M"
    }
  },
  {
    "url": "https://wellfound.com/company/convex_dev/jobs/2529352-software-engineer-nyc",
    "title": "Software Engineer, NYC at Convex",
    "location": "New York",
    "compensation": "$174k – $250k",
    "published": "3 months ago",
    "description": "Convex is the backend application platform that combines a powerful custom database with an integrated execution environment to empower developers to build fast, reliable, and dynamic apps without complex backend engineering or database administration. The early team at Convex has built and designed some of the largest backends in the world, with exabytes of data, millions of transactions per second, and shipped desktop and mobile software onto billions of devices. Come help us build the serverless revolution! We are excited to be building a new office and looking to hire our first landing team members to establish the Convex NYC team. What Excites Us: Highly motivated engineers with the ability to work with a high degree of agency as part of an early office team focused on building Convex's foundational core products (distributed databases, servers, caching, storage, developer experience, etc) Extremely good communication and collaboration skills with the ability to set culture and help establish norms for a team that will be working closely with other team members in New York and San Francisco Industry experience and expertise in full-stack, backend, infrastructure, and/or systems engineering (unfortunately, we are not hiring new-grads or early-career engineers at this point in time in NYC) Qualifications: Bachelors, Masters, or PhD in Computer Science (or related technical field) with a minimum of 5 years of relevant experience with backend, systems, product, or full-stack engineering Rust and/or Typescript experience is nice to have (most of our backend development is in Rust and our frontend libraries are primarily in Typescript) Ability to work in-person at Convex's office located in Midtown Manhattan *The salary range for this full-time position is $174,000-$250,000 + equity + benefits",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "5+ years",
    "skills": [
      "Databases",
      "Database and Systems Design",
      "Full Stack Development",
      "Backend Development",
      "TypeScript",
      "Rust",
      "Rust​",
      "Rust Programming"
    ],
    "hiringContact": {
      "name": "Bryan Liu",
      "position": "Talent • 1 year"
    },
    "company": {
      "name": "Convex",
      "description": "Serverless Cloud Operating System",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8327042-337e7a95633e8c48411d53ed42ae2102-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/convex_dev",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "SaaS",
        "Databases",
        "Application Platforms",
        "Developer Tools",
        "Web Development"
      ],
      "totalRaised": "$26M"
    }
  },
  {
    "url": "https://wellfound.com/company/mosaicml-1/jobs/2350736-software-engineer-ml",
    "title": "Software Engineer- ML at MosaicML",
    "location": "New York City • San Francisco",
    "compensation": "$140k – $200k",
    "published": "2 months ago",
    "description": "Company Introduction MosaicML is a deep learning startup with a mission to make ML training more efficient for everyone through fundamental innovations in algorithms, systems, and platforms. We believe that large scale training should be available beyond the well-resourced companies, and bridging the gap between research and industry is core to our success. Our products will enable our customers to train the best neural networks efficiently as possible within given time, cost, or other resource constraints – and to do so with a great user experience. Job Description We are seeking engineers passionate about open source and the PyTorch developer ecosystem. You will be responsible for building open source libraries to share MosaicML’s training efficiency developments with the entire community. Come solve the challenging problems in delivering our innovations across the machine learning stack, from kernels to software to algorithms, in an accessible way. You will: Design and implement our open source technologies and libraries on top of PyTorch Balance performance and usability for our developers and customers Build tools for machine learning training Facilitate our community through documentation, talks, tutorials, and collaborations Collaborate with external researchers and companies We look for: 4+ Years experience required Experience with deep learning frameworks (e.g. PyTorch, TensorFlow) Strong sense of design and usability Prior history of contributing to or developing open source projects is a bonus but not a requirement. We value candidates who are curious about all parts of the company's success and are willing to learn new technologies along the way.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "preferredTimezones": "Pacific Time, Mountain Time, Central Time, Eastern Time",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "4+ years",
    "skills": [],
    "hiringContact": {
      "name": "Ericka Callahan",
      "position": "Technical Recruiter • 2 years"
    },
    "company": {
      "name": "MosaicML",
      "description": "MosaicML is a Deep Learning startup on a mission to make ML training efficient",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/9043053-a8eb9e5f1aba8e685e70eb617f0042c7-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/mosaicml-1",
      "badges": [],
      "markets": [
        "Infrastructure",
        "Machine Learning",
        "Software Engineering",
        "Deep Learning",
        "Artificial Intelligence / Machine Learning"
      ],
      "locations": ["New York City", "San Diego", "San Francisco"]
    }
  },
  {
    "url": "https://wellfound.com/company/acala-network/jobs/1634328-software-engineer-in-test",
    "title": "Software Engineer in Test at Acala Network",
    "location": "Remote • Los Angeles • New York City • Auckland",
    "compensation": "$45k – $55k",
    "published": "1 month ago",
    "description": "About Acala Acala's mission is to build and nurture the autonomous financial infrastructure of the decentralized web. Delivering on this mission will bring more financial accessibility, opportunity, and prosperity to everyone on the planet through a new, open financial system. Our core project is the Acala Network itself, which we expect to become the multichain DeFi hub built on top of Polkadot. We’ve built a suite of financial primitives including; decentralized, multi-collateral stablecoin; trustless liquid staking derivatives, and Decentralized Exchange, EVM app platform, and multichain asset router. These primitives will be used by us and other teams to power open DeFi innovations, and remove the need for the intermediaries that inhabit almost every conventional trust-based financial system. We have secured our support from eminent backers like Polychain, Coinbase Venture, Pantera and many more. Acala began its launch process on December 18, 2021, and we've an exciting new roadmap planned throughout 2023/24, so there’s no better time to join the DeFi mission and be a part of the future that we’re building...because we're building it for you, too. About the role We are looking for an experienced SDET to join Acala's Blockchain Engineering team of 10+ Engineers. Our platform consists of; Rust-based blockchain nodes; an EVM of Solidity-based smart contracts; and a variety of other Fullstack elements like Typescript / React / Node.js. Our Developers already have mature pre-release checklists for these various projects, but it will be your job to help us tie them all together into a unified Test &amp; Release Strategy - and to automate as much of it as possible. As the 1st SDET at Acala you will have an 'open menu' regarding what tools to use for; internal release; public beta release(s); production release; and deciding what we should (or shouldn't) be automating in the process. We have created this role now because we are ready for a dedicated SDET, and we know that there are great Engineers out there who know how to setup and run QA processes 'from zero' but haven't yet been given the chance to do so - this is your opportunity. Our ideal candidate(s) will also have some exposure to build management for a set of web-based applications, and will be able to discuss the highs and lows of release scheduling at interview. We're expecting to hire someone who is familiar with blockchain concepts, but we’re open to a wide range of Engineers that might be focused on more traditional applications, provided they are aware of blockchain trends and what we're building. Competitive Salary | Full Time | Contract | Remote anywhere What you'll do Work closely with our CTO to maintain Acala's QA, Build &amp; Release strategy Work with our COO &amp; Product Team to identify new and vulnerable test cases Work with our experienced JS Engineers to enhance their QA &amp; Release checklists Own Release Management tasks, and Issue tracking/sorting on Github Possible extensions; Security / Vulnerability auditing; Load and performance testing What it takes 5 years (or more) experience with Production Quality Software Processes At least 3 years focused on BackEnd QA &amp; Release for web-based applications Experience as a SDET or QAE in a startup, preferably using JS tools &amp; frameworks Expert knowledge of test tools &amp; frameworks for Js/Ts; Mocha, Jest, Nightwatch, etc Basic knowledge of common Smart Contracts use cases Bonus: Experience building/testing Rust applications What we offer Competitive contract-based compensation (you'll have to invoice us from wherever you are) Flexible working hours within Pacific timezones Collaborative, transparent and empowering work culture Meaningful work on creating better technologies for a fairer future Opportunity to work in a multinational, high-performance team with diverse backgrounds More Information Series A statement by CEO Ruitao Su Web3 Grant statement by COO Bette Chen Coinbase investment statement by Growth VP Dan Reecer Find us on GitHub, YouTube, Twitter &amp; Discord Get started! Try out our Testnet for yourself Our Team With approximately 20+ full-time team members working across 8 different countries, our team is truly decentralised. We’re some of the leading blockchain innovators, Substrate &amp; Rust engineers, full-stack dApp developers, &amp; Economist Analysts. But we're just people like you, working from our shared desire for a fairer and more inclusive financial system, in direct contrast to the clear shortcomings of the current institutions that run our world. Our Values The community we’re building is shaped by our values and fuelled by the needs of all humans: Inclusion, Care, Trust, and Respect Empowerment Guidance and Support Friendship, Community, Real Relationships We’re building Acala based on a core set of values we believe are in line with the tenets of web3: True decentralisation Less Trust, More Truth Integrity Accountability Empowering individuals with more autonomy NOTE: To all external Recruiters who have 'exciting profiles' to share with us, please do so knowing that without signed terms &amp; conditions Acala deem any introductions made to be a complimentary courtesy to the development of the world's Web3 infrastructure. Thank you for your support.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "preferredTimezones": "Pacific Time, China Standard Time, Auckland, Wellington",
    "remoteWorkPolicy": "Remote only",
    "experience": "3+ years",
    "skills": [],
    "hiringContact": {
      "name": "Simon Carr",
      "position": "Talent Manager • 2 years"
    },
    "company": {
      "name": "Acala Network",
      "description": "Acala is an appchain powering Web3 finance",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7843732-62bf73daf6cb264453fffcd3ec53935f-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/acala-network",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": ["Global", "Blockchain / Cryptocurrency", "Web3"],
      "locations": ["Los Angeles", "New York City", "Auckland"],
      "totalRaised": "$8.3M"
    }
  },
  {
    "url": "https://wellfound.com/company/knoetic/jobs/2615594-senior-software-engineer-full-stack",
    "title": "Senior Software Engineer (Full-stack) at Knoetic",
    "location": "New York City",
    "compensation": "$140k – $190k • 0.01% – 0.08%",
    "published": "4 weeks ago",
    "description": "Hello, we’re Knoetic (&lt;-rhymes with “poetic” 😊)! We've raised over $50MM from Accel, EQT Ventures, Menlo, and 100s of angels (like Adam Grant). Why did these world-class VCs and angels want in on Knoetic? Because we’re building a “brain” for Chief People Officers that enables them to build healthy, productive, equitable workforces – and ultimately shapes the future of work. How does it work? The “left brain” is Knoetic Analytics – the quantitative insights. We integrate with HR systems (HRIS, recruiting platforms, performance platforms, etc), ingest all that disparate employee data, manipulate it via a complex transform process, and then push insights back to the customer in a user-friendly way. Chief People Officers use Knoetic Analytics to visualize their workforce, prepare for Board meetings, influence their executive team, workforce plan, uncover performance trends, and much more. The “right brain” is CPOHQ – the qualitative insights. Chief People Officers join our executive community to tap the wisdom of their peers, find best practices, workshop pressing business challenges, and make meaningful connections. The role of the CPO has never been more complex, and CPOHQ is where they turn to inform the decisions that impact their employees. By bringing Analytics &amp; CPOHQ together, we give CPOs and their People teams a holistic view of what drives employees to come, stay, and feel valued at work. This is a platform unlike any other. That’s where you come in! We’re building a diverse team of Knoeticons who can thrive in our culture. If you're motivated to improve the work lives of millions of people as part of an ambitious and collaborative team, we'd love for you to join us on this ride :) About The Role We are building out our founding Engineering team. Senior Full-stack Engineers have the opportunity to work across the stack, front to back. You’ll take ideas from inception to reality by rapidly building prototypes, iterating, and releasing them. You’ll build scalable products that make the people analytics experience for People leaders and organizations more insightful and more efficient. Overall you will: Produce high-quality, production-ready, readable, maintainable code Lead large projects from initial inception to production Collaborate with leadership and with peers across engineering, design, product, and go-to-market Build beautiful, scalable solutions to make the people Analytics experience for CPOs, people leaders, and entire organizations 100x more efficient Within your first week, you will: Onboard and learn more about the company’s mission, culture, and values. You’ll write a user manual and a Professional Development Plan outlining exactly how you want to grow professionally over the next 1-2 years. Understand Knoetic's tech infrastructure in-depth. We will pair you up with a peer to help you get up to speed. Deploy your first Pull Request to production Within your first month, you will: Participate in road mapping and architecture discussions Pair program with talented, ambitious engineers within a highly-collaborative team Collaborate with the team which includes our product manager and product designer to deliver a low/medium-sized project At three months, you'll be fully ramped! You will: Lead a complex project from inception to deployment that will immediately provide value to our users Identify, evaluate, and define improvements to the existing infrastructure and product What we’re looking for BS degree in Computer Science or equivalent practical experience 4+ years of experience building modern web applications using Javascript frameworks like ReactJS or similar, and with backend programming languages like NodeJS, Python, or similar Demonstrated comfort building applications using our backend tech stack (Go, AWS, Kubernetes, SQL, NodeJS) You pride yourself on being able to identify and address issues before they become problems, and are skilled at finding signals in the noise If this sounds like an amazing opportunity for you, apply now, and let's shape the future of work together! The key attributes we value in teammates: You like to win. You run through walls to achieve your goals, and you don't settle for participation trophies. You're intellectually curious, and intellectually humble. You approach problems with intellectual rigor, and with an open mind and ear. You’re not afraid to say, “I don’t know - but I’ll figure it out, fast.” You never say, “that’s not my job” - you take full ownership and responsibility over outcomes. You’re a force of nature that gets the job done no matter what it takes. You make everyone else on the team better. Your presence, positivity, and drive inspire others to step up their game. You put the company above your own wants. You’re known for your work ethic. You pride yourself on being one of the hardest-working person most people know. You’re constantly improving. You know there’s no such thing as perfection, and you’re always pushing yourself (and our company) to be better than you were yesterday. You’re confident that you are good, and humble to know you can be better: You’re honest, principled, smart, open to giving/receiving feedback, and focused on doing right for the company and doing right for the customer In compliance with New York City Pay Transparency Law, the base salary range for this role, adjusted for level, is between $140,000 - $190,000 in New York City. When determining a candidate’s compensation, we consider a number of factors including level, skillset, experience, job scope, location, and current market data. This range is not inclusive of our competitive equity package. Note - even if you don’t check every box in the job description, we still encourage you to apply! Knoetic is committed to fostering an inclusive workplace, and does not discriminate on the basis of ethnicity, age, gender, gender identity, sexual orientation, disability, protected veteran status, or any legally protected status. If you’re missing a few qualifications or don’t have the exact experience listed above, you may still be the next right candidate for this role or another role we have open at Knoetic! We look forward to hopefully meeting you soon!",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "preferredTimezones": "Pacific Time, Mountain Time, Central Time, Eastern Time",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "4+ years",
    "skills": ["SQL", "Node.js", "React.js", "Go (Golang)"],
    "hiringContact": {
      "name": "Yash Kochar",
      "position": "Employee"
    },
    "company": {
      "name": "Knoetic",
      "description": "The only analytics software for strategic People teams",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8499794-3df3d202b6631f717b02823bb1d507fc-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/knoetic",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Same investor as Meta"
        }
      ],
      "markets": ["SaaS", "Enterprise Software"],
      "totalRaised": "$54M"
    }
  },
  {
    "url": "https://wellfound.com/company/shiftsmart/jobs/2488459-software-engineer-all-levels",
    "title": "Software Engineer (all levels) at Shiftsmart",
    "location": "Remote • New York",
    "compensation": "$150k – $225k",
    "published": "1 month ago",
    "description": "Why Shiftsmart We’re building the Amazon of labor - a platform for hourly work in the enterprise. At Shiftsmart we work with the largest companies and government agencies in the world - including Walmart, PepsiCo, Google, and Circle K - to fractionalize jobs into shifts, increasing labor supply and liquidity, and enabling our global network of over 2.5M workers to work across locations, employers, and categories of work. We’ve grown to &gt;$100M ARR, doubling each year since we started, paid over $130M in wages to hourly workers, and raised $120M from top tier investors like D1 Capital &amp; Imaginary Ventures. And we’re only getting started. Our mission is to build the world’s leading platform for hourly workers and enterprises enabling flexibility, choice, and upward social mobility. Join a rocketship. This is a unique opportunity to join the ground floor of a rapidly scaling business that is changing the way hourly labor works and capturing a $2 trillion dollar opportunity in the US alone. Ownership + impact. Join a team that is challenging and supporting one another to build a great business and create flexibility, choice, and upward social mobility for workers everywhere. Captain your career path. Enjoy accelerated learning and growth working with a world class team from top tech companies (e.g. Uber, Airbnb, Google, Amazon), business schools (e.g. HBS, GSB, Wharton), and professional services (e.g. Bain, BCG, Goldman). Become a world class executor. We believe that #ExecutionIsBinary, and are dedicated to helping you master that skill for life here and beyond. We're transforming the labor industry Who you are The Engineering Team enables Shiftsmart to anticipate and creatively solve problems across multiple functions with solutions that have a lasting impact for both our customers (employers) and our users (workers). Our mission is simple: To build the world’s leading platform for hourly workers and enterprises enabling flexibility, choice, and upward social mobility. What you’ll do: Own a vertical pillar or horizontal function within our Product &amp; Engineering team. Drive the technical vision, influence product strategy, and conduct regular technical reviews. Design, architect, and build highly-performant and reliable technical features, tools, and services using Node.js, React/React Native, Mongo, Python, GCP. Lead complex technical projects from ideation and design through production and deployment. Serve as a mentor for junior engineers and participate in scaling our team Who you are We’re actively hiring full stack, front-end, and back-end developers across all levels (SWE, Senior, Staff, Principal). You have 2+ years of software engineering experience. You enjoy working cross functionally with leadership, PMs, designers, and other engineers to build products across a modern tech stack (MERN) to solve complex problems. You are eager to work in a dynamic and fast-paced early stage startup, and have an ability to roll up your sleeves to #GetShiftDone. Compensation philosophy To provide greater transparency we share base salary ranges, which are based on role and level benchmarked against similar stage, high growth companies. Offers are determined based on multiple factors including skills, work experience, and relevant credentials. In addition to competitive salaries and meaningful equity we offer the following benefits: Comprehensive healthcare coverage: We cover 100% of employee premiums for medical, dental, and vision care (60-75% for dependents) 401(k) match program: We match 100% on the first 3% of your contributions and 50% on the next 2% for a maximum match of 4% Generous, fully paid parental and family leave policies Pre-tax commuter benefits Unlimited and flexible PTO Collaborative office with fully stocked kitchen @ 1 World Trade in Manhattan Equal opportunity employer Shiftsmart is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. Operating Principles @ Shiftsmart Inspired by Leadership Principles @ Amazon Execution Is Binary We #GetShiftDone. We take immense pride in both the quality of our work and our relentless determination to deliver on our commitments. If we say we are going to do something, we do it. We own the outcome with an unstoppable mindset through the finish line and are impatient to move the ball forward. This means we work really hard, execute with urgency, and ruthlessly challenge timelines for anything important. As a result, we do not defer responsibility to other teams or individuals. Instead, we take the problem as far as we can and only when needed ask others for help. Each time a crisis or opportunity emerges we take the hill as one team, because we are allergic to the words “it can’t be done”. Missionaries, Not Mercenaries We before me. We believe in our mission to build a better world for workers. We understand why our work matters and take seriously how it impacts our customers and our partners. This belief permeates everything we do from the strategic to the mundane. We are energetic, ambitious, and want to win. We constantly raise the standards for ourselves and everyone around us. We show up for our customers, our partners, and most importantly our teammates, and make every effort to build lasting relationships with each of them. We do not measure success based on our titles or the size of our empires. This also means we put the needs of the business before the details of our job descriptions. Rather than fight for a bigger piece of the pie, we fight to grow the entire thing and recognize this is how to grow our careers too. Inputs &gt; Outcomes We work really hard. Fundamentally changing how labor works is not easy. It often requires long days, late nights, and weekends to deliver on our commitments. We lean into this challenge. We focus on the process. We think in terms of value chains and appreciate that a bad process with a good outcome is simply dumb luck. We lead with data. We use facts, not fiction, to build narratives and make decisions. To do this we prepare written memos in advance and resist the urge to engage in endless water cooler what ifs, because we value the time and attention of our teammates. We hire and develop the best. When we decide to hire a new team member, we do so because we believe they will increase the talent density on our team. We view ourselves as leverage maximizers rather than inconvenience reducers and strive to increase the output of everyone we interact with. Honesty Over Harmony We share the truth even when it is painful. We do not, however, share the truth callously to hurt people’s feelings or make them look bad. We also assume positive intent. If someone is not delivering in a way that we need, we ask them and tell them before assuming the worst. We embrace mutual feedback. As people leaders we care more about our team’s growth and success than how much others like us. As individuals we seek, accept, and apply feedback. We do not give or take feedback personally because we understand it enables us to learn and grow. We tell the truth to ourselves. We reject a pollyannaish view of our world. Instead if something isn’t going well that we are responsible for, we call it out. And when someone calls out their own truth that may be less optimal, we don’t punish them for it. We have the meeting in the meeting. If something is broken or we disagree, we call it out and say something in the moment even if it feels uncomfortable to do so. This means that if something is broken, we do not just accept it and complain later. Invent &amp; Iterate We are inventors @ heart. We categorically reject the phrase “that is how it’s always been done”, and constantly discover new and better ways to do more with less. This means we are resourceful and often do things that don’t scale, only to create ways to scale them later. We’re builders. We think BIG. At every level of the company, we embrace big, hairy, audacious, and transformative goals. We fear lack of progress and incremental thinking more than failing to deliver or falling short of an audacious goal. We believe courage means to try without fear and learn without ego. We do not let perfect get in the way of better. When faced with the choice we prioritize delivering something, even if imperfect, over endless debate and alignment. We embrace good mistakes.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "preferredTimezones": "Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "3+ years",
    "skills": [],
    "hiringContact": {
      "name": "Pavan Patel",
      "position": "Employee"
    },
    "company": {
      "name": "Shiftsmart",
      "description": "We're building the future of labor. We empower hourly workers to find rewarding, flexible work",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/879656-def6432cf19e41bc4952cca2114dd49c-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/shiftsmart",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Enterprise Software",
        "B2B",
        "Marketplaces",
        "Application Platforms"
      ],
      "totalRaised": "$120.6M"
    }
  },
  {
    "url": "https://wellfound.com/company/knoetic/jobs/2662012-principal-staff-software-engineer",
    "title": "Principal/Staff Software Engineer at Knoetic",
    "location": "New York City",
    "compensation": "130k – 195k Wellfound Est.",
    "published": "2 months ago",
    "description": "Hello, we’re Knoetic (&lt;-rhymes with “poetic” 😊)! We've raised over $50MM from Accel, EQT Ventures, Menlo, and 100s of angels (like Adam Grant). Why did these world-class VCs and angels want in on Knoetic? Because we’re building a “brain” for Chief People Officers that enables them to build healthy, productive, equitable workforces – and ultimately shapes the future of work. How does it work? The “left brain” is Knoetic Analytics – the quantitative insights. We integrate with HR systems (HRIS, recruiting platforms, performance platforms, etc), ingest all that disparate employee data, manipulate it via a complex transform process, and then push insights back to the customer in a user-friendly way. Chief People Officers use Knoetic Analytics to visualize their workforce, prepare for Board meetings, influence their executive team, workforce plan, uncover performance trends, and much more. The “right brain” is CPOHQ – the qualitative insights. Chief People Officers join our executive community to tap the wisdom of their peers, find best practices, workshop pressing business challenges, and make meaningful connections. The role of the CPO has never been more complex, and CPOHQ is where they turn to inform the decisions that impact their employees. By bringing Analytics &amp; CPOHQ together, we give CPOs and their People teams a holistic view of what drives employees to come, stay, and feel valued at work. This is a platform unlike any other. That’s where you come in! We’re building a diverse team of Knoeticons who can thrive in our culture. If you're motivated to improve the work lives of millions of people as part of an ambitious and collaborative team, we'd love for you to join us on this ride :) About The Role We are building out our founding Engineering team, and are looking for a Staff or Principal Engineer to lead our integrations with HR tech systems. The number of, and quality of, our data connectors is essential for Knoetic’s success. This means you’ll be doing the most important (and arguably the most challenging!) work at the company. This role will be the right fit for a talented engineer who’s been in a world-class data engineering and integrations environment, and is excited to roll up their sleeves and build a powerhouse Knoetic 2.0 - all while ensuring data quality for our end users. Overall you will: Design, develop, and maintain scalable and robust data infrastructure and pipelines to support Knoetic Analytics Collaborate closely with engineers, product teams, and customers to define data requirements for new and existing Analytics offerings, and translate them into efficient data processing and transformation workflows. Implement best practices in data modeling, capture, quality, and governance to ensure the integrity, consistency, and security of our data assets. Optimize and monitor our data infrastructure and pipelines for performance, throughput, and reliability, proactively identifying and addressing bottlenecks and other issues. Stay current with the latest trends and technologies, continuously seeking opportunities to innovate and improve our data infrastructure. Within your first week, you will: Onboard and learn more about Knoetic’s mission, culture, and values. You’ll write a User Manual and a Professional Development Plan outlining exactly how you want to grow professionally over the next 1-2 years. Understand Knoetic's tech infrastructure in-depth. Review existing ELT data pipelines and their integration with our partner APIs to identify areas for improvement and potential optimizations. Deploy your first Pull Request to production. Within your first month, you will: Work closely with cross-functional teams to understand customer needs and define data requirements for new and existing workforce analytics, such as compensation, DEIB, spans of control, and attrition - and translate them into efficient data processing and transformation workflows. Design, develop, and maintain scalable and robust ELT data pipelines to support Knoetic Analytics. Implement best practices in data modeling, data quality, and data governance, ensuring the integrity, consistency, and security of our data assets, while complying with data privacy regulations (PII). Monitor and begin to optimize data pipelines for performance, throughput, and reliability, addressing bottlenecks and other issues to enhance the customer experience. At three months, you'll be fully ramped! You will: Continuously innovate and improve our data infrastructure by staying current with the latest trends and technologies in data engineering, as well as advancements in HR tech systems and their APIs. Proactively identify opportunities for data-driven insights and collaborate with cross-functional teams to develop new features and enhance existing workforce analytics offerings. Mentor and support junior team members, fostering a culture of collaboration, continuous learning, and growth. Collaborate with cross-functional teams to troubleshoot and resolve complex engineering challenges, ensuring the smooth operation of our data pipelines and the satisfaction of our customers. What we’re looking for BS degree in Computer Science or equivalent practical experience 7+ years of experience in a world-class data engineering environment Data engineering or integrations experience Demonstrated comfort building applications using our backend tech stack (Go, AWS, Kubernetes, SQL, NodeJS) You pride yourself on being able to identify and address issues before they become problems, and are skilled at finding signals in the noise If this sounds like an amazing opportunity for you, apply now, and let's shape the future of work together! The key attributes we value in teammates: You like to win. You run through walls to achieve your goals, and you don't settle for participation trophies. You're intellectually curious, and intellectually humble. You approach problems with intellectual rigor, and with an open mind and ear. You’re not afraid to say, “I don’t know - but I’ll figure it out, fast.” You never say, “that’s not my job” - you take full ownership and responsibility over outcomes. You’re a force of nature that gets the job done no matter what it takes. You make everyone else on the team better. Your presence, positivity, and drive inspire others to step up their game. You put the company above your own wants. You’re known for your work ethic. You pride yourself on being one of the hardest-working person most people know. You’re constantly improving. You know there’s no such thing as perfection, and you’re always pushing yourself (and our company) to be better than you were yesterday. You’re confident that you are good, and humble to know you can be better: You’re honest, principled, smart, open to giving/receiving feedback, and focused on doing right for the company and doing right for the customer In compliance with New York City Pay Transparency Law, the base salary range for this role, adjusted for level, is between $200,000 and $240,000 in New York City. When determining a candidate’s compensation, we consider a number of factors including level, skillset, experience, job scope, location, and current market data. This range is not inclusive of our competitive equity package. Note - even if you don’t check every box in the job description, we still encourage you to apply! Knoetic is committed to fostering an inclusive workplace, and does not discriminate on the basis of ethnicity, age, gender, gender identity, sexual orientation, disability, protected veteran status, or any legally protected status. If you’re missing a few qualifications or don’t have the exact experience listed above, you may still be the next right candidate for this role or another role we have open at Knoetic! We look forward to hopefully meeting you soon!",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Mila Sheeline",
      "position": "Director of Business Operations & Community • 2 years"
    },
    "company": {
      "name": "Knoetic",
      "description": "The only analytics software for strategic People teams",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8499794-3df3d202b6631f717b02823bb1d507fc-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/knoetic",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Same investor as Meta"
        }
      ],
      "markets": ["SaaS", "Enterprise Software"],
      "totalRaised": "$54M"
    }
  },
  {
    "url": "https://wellfound.com/company/dydx/jobs/1260878-senior-software-engineer-backend",
    "title": "Senior Software Engineer - Backend at dYdX",
    "location": "Remote • New York City",
    "compensation": "$230k – $290k • 0.02% – 0.1%",
    "published": "2 months ago",
    "description": "(Location: New York, NY - Hybrid) At dYdX you'll have an opportunity to build state-of-the-art decentralized technology that will redefine global financial markets. By joining us at this early stage you will make fundamental decisions that will shape the course of dYdX. → Learn more about working at dYdX and our benefits Take our coding challenge here. We'll reach out if it's a good fit! About dYdX: We’ve built the world’s leading decentralized exchange for crypto assets dYdX is founded by an ex-Coinbase, ex-Uber engineer, with a Princeton CS background. Our team has previous experience at Google, Bloomberg, Amazon, Bain, NerdWallet, Facebook, Lyft and other top companies We're a world-class team with top backers and advisors, including Andreessen Horowitz, Polychain Capital, Brian Armstrong, Fred Ehrsam, Naval Ravikant, Elad Gil and more RESPONSIBILITIES: Write low latency financial software that will process billions of dollars a day worth of trading volume, including order book matching engines, trading engines, and REST &amp; Websocket API endpoints Develop open source blockchain-based code that powers the dYdX protocol Build high performance REST &amp; WebSocket APIs to power our frontend app as well as programmatic traders Write open source TypeScript &amp; Python clients that allow users to interact directly with our on-chain smart contracts Work together with multi-functional teams to develop the best overall product Architect performant and reliable backend systems Mentor and develop junior engineers REQUIREMENTS: 5+ years experience working as a full-time developer You write secure, efficient, high quality code and have a good understanding of CS fundamentals You have experience with or are open to learning JavaScript, TypeScript, Node.js, PostgreSQL, Redis, Kafka, Express, WebSockets, Docker You are a fast learner who can quickly master new technologies NICE TO HAVES: You've worked on high quality products in the finance or security space Interest in fullstack development. Experience building Web Services, SQL, CSS, React, Redux You have an strong interest in decentralized finance You have experience building blockchain applications / smart contracts CS Degree or equivalent experience Preferred location NYC Salary range for this role is $175K to $270K USD (NY). Compensation subject to experience and location. Published salary bands pursuant to transparency laws, and do not include possible variable compensation such as annual merit increases, bonus eligibility, commission, or equity incentive.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "experience": "5+ years",
    "skills": [],
    "hiringContact": {
      "name": "Gian Raciti",
      "position": "Employee"
    },
    "company": {
      "name": "dYdX",
      "description": "The world's leading decentralized exchange for crypto assets",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/4710116-491299b98749ea92b6da062838790260-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/dydx",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Same investor as Airbnb"
        }
      ],
      "markets": ["Financial Services", "Cryptocurrency", "Blockchains"],
      "totalRaised": "$87M"
    }
  },
  {
    "url": "https://wellfound.com/company/tiptopxyz/jobs/2498794-sr-backend-engineer",
    "title": "Sr. Backend Engineer at TipTop",
    "location": "Remote • Los Angeles • New York City • San Francisco",
    "compensation": "$150k – $200k • 0.25% – 0.5%",
    "published": "4 months ago",
    "description": "We’re inviting experienced, generalist senior backend engineers to join the core TipTop team. We are looking for a self-starter who is a highly motivated and autonomous operator. Are you a seasoned engineer with previous experience in a fast paced, blue sky, startup environment who can solve problems from a blank slate? About us We’re building consumer and enterprise systems at the intersection of e-commerce, fintech, and logistics that will change our relationship with the things we purchase. We’re pre-market, envisioning an entirely new consumer finance paradigm and developing its first version. Note that we’re a distributed team collaborating remotely and meet up in person quarterly. Postmates founder banks $23 million for his new crypto startup TipTop | TechCrunch TipTop Funding Information | AngelList Talent You Will Solve complex challenges building software systems for products and verticals that don’t yet exist Develop scalable services that manage sensitive financial data and critical business logic Partner and collaborate closely with product designers, blockchain, infrastructure, and machine learning teams Contribute to the development of consumer facing experimentation and risk platforms Have the opportunity to build and lead a team You Have 5+ years of experience as a software engineer architecting, building, launching, and maintaining end-to-end services from whiteboard to production Proven experience leading and implementing complex payment systems and integrations in a scalable way Demonstrated ability turning business and product ideas into engineering solutions – you can go from zero to one Strong CS fundamentals and programming experience in Go and Python A desire to experiment, test assumptions, and challenge hypotheses rapidly The ability to see complex problems as solvable challenges Even Better Deep experience of backend services that are needed to run e-commerce platforms and move money on the web Passion for building, bias for action, and are excited by uncertainty You are autonomous and adaptable – own the work, move fast, react quickly Interest and ability to pick up new technologies quickly Curiosity in evolving ML platforms and technologies like ChatGPT Tech You'll Use Go Python SQL/Postgres GCP Docker Kubernetes How To Apply Send us an email with a copy of your resume or LinkedIn, your GitHub, and any projects you think we should see to [email protected]",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "5+ years",
    "skills": ["Python", "Go (Golang)"],
    "hiringContact": {
      "name": "Gregory B Carlson",
      "position": "Product"
    },
    "company": {
      "name": "TipTop",
      "description": "Stealth",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8889400-27042869faf5be6ac965cf1de99d8926-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/tiptopxyz",
      "badges": [],
      "markets": [
        "Financial Services",
        "E-Commerce",
        "Logistics",
        "Finance Technology"
      ],
      "locations": ["Los Angeles", "New York City", "Seattle"],
      "totalRaised": "$23.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/parabola/jobs/2530903-senior-software-engineer-infrastructure",
    "title": "Senior Software Engineer, Infrastructure at Parabola",
    "location": "California • New York City • United States • San Francisco",
    "compensation": "$145k – $195k Wellfound Est.",
    "published": "2 days ago",
    "description": "About us: Parabola is transforming the way companies operate by empowering non-technical teams to automate complex data processes with ease. Our mission is to provide non-technical teams (\"operators\") with the same type of leverage as their technical counterparts. We do this by providing a no-code platform to build, automate and collaborate on data workflows. By empowering teams to solve the problems they're already experts on, Parabola helps businesses of all shapes and sizes improve operations, drive revenue and, ultimately, operate with excellence. Parabola is proud to partner with companies like Flexport, Sonos, Volcom and Durex and is backed by Matrix Partners, Thrive Capital, and many other amazing angel investors. About the role: As a software engineer on our rapidly growing team, you’ll help build our core platform features, reinforce and evolve our technical foundation, and work with a unique flow-based calculation engine that already demonstrates high throughput and availability but needs your help to continue scaling. What you'll be doing: Leading major infrastructure and developer experience projects from the ground up - from ideation, to implementation, to roll-out, to hand-off &amp; documentation. Taking ownership over Parabola's cloud infrastructure, and continuously look for opportunities to improve efficiency, security, and reliability. Building and maintaining tooling to support and promote developer efficiency. Optimizing our services for scalability, stability, and observability as our customer base grows and our product becomes more sophisticated. Collaborating with a small-but-mighty group of engineers with a wide array of backgrounds and areas of expertise. Helping our team define processes and practices that will serve us for years of growth and success What (we think) you’ll need to do it: 5+ years of DevOps, infrastructure, or site reliability experience working in a team-based high-availability production environment. Proficiency implementing and managing AWS infrastructure from the ground up and the ability to continuously evolve the stack to improve efficiency, security, and reliability. Proficiency managing Linux systems and Docker containers. Experience implementing and deploying infrastructure-as-a-service (IaaS) tools to manage production cloud environments (e.g. Terraform, Ansible)Proficiency managing CI/CD pipeline for multiple environments. Experience with private cloud and public internet services networking (e.g https, SSH, multi-factor auth) and implementing security best practices into infrastructure. You’re not afraid to ask for help, and you’re happy to give it, too. You care about the craft of engineering, and you’re dedicated to making sure your work is stable, secure, and maintainable. You’re an enthusiastic communicator and you like working with a team that provides both mutual support and thoughtful critique Nice to haves: Proficiency managing developer experience (e.g. code coverage tooling, static analysis tooling, pull request merge queues). Experience with cloud infrastructure cost management. Stellar scripting skills. Experience working in dynamic high-growth organizations. Rich interests and can bring a unique perspective to our team Salary Range: $150,000 - $190,000 *This salary range represents the minimum and maximum for this role based in San Francisco and New York. The salary given for this position is dependent on multiple factors, including years of experience, interview performance and anticipated responsibilities of the role. Our base salary is one component of Parabola’s competitive total package, which also includes equity and premium health and wellness benefits. *",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "4+ years",
    "skills": ["Infrastructure", "DevOps", "Reliability", "Kubernetes"],
    "hiringContact": {
      "name": "Maddy DeCarlo",
      "position": "Recruiter • 9 months"
    },
    "company": {
      "name": "Parabola",
      "description": "The best place to work with data",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/901853-20474fe4f3b15b1415fc193df359bcc2-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/parabola",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        }
      ],
      "markets": [
        "SaaS",
        "Enterprise Software",
        "Sales and Marketing",
        "Developer Tools",
        "Web Tools",
        "Data",
        "Logistics Software",
        "Ecommerce"
      ],
      "locations": ["New York City", "San Francisco"],
      "totalRaised": "$10.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/parabola/jobs/2563673-full-stack-software-engineer",
    "title": "Full Stack Software Engineer at Parabola",
    "location": "California • New York City • United States • San Francisco",
    "compensation": "$110k – $150k Wellfound Est.",
    "published": "2 days ago",
    "description": "About us: Parabola is transforming the way companies operate by empowering non-technical teams to automate complex data processes with ease. Our mission is to provide non-technical teams (\"operators\") with the same type of leverage as their technical counterparts. We do this by providing a no-code platform to build, automate and collaborate on data workflows. By empowering teams to solve the problems they're already experts on, Parabola helps businesses of all shapes and sizes improve operations, drive revenue and, ultimately, operate with excellence. Parabola is proud to partner with companies like Flexport, Sonos, Volcom and Durex and is backed by Matrix Partners, Thrive Capital, and many other amazing angel investors. About the role: As a Full Stack Software Engineer on our growing team, you’ll be driving the development of greenfield features, reinforcing our technical foundation, and working with a unique flow-based calculation engine that demonstrates high throughput and availability. What you'll be doing: Partnering with product managers and designers to implement new product functionality from start to finish. Collaborating with a small-but-mighty group of engineers with a wide array of backgrounds and areas of expertise. Consulting with the Customer Experience team to solve unique customer problems and find out where our product should grow next. Writing Python, React, and Redux code in a mature TypeScript codebase Building and extending our core platform, from database schema to API design. Implementing the logic behind the steps that make up Parabola flows. Optimizing our services for scalability, stability, and observability as our customer base grows and our product becomes more sophisticated. Helping our team define processes and practices that will serve us for years of growth and success. What (we think) you'll need to do it: You have 2+ years of full-stack experience working in a team-based, high-uptime, continuously-delivered codebase. You’re not afraid to ask for help, and you’re happy to give it, too. You care about the craft of engineering, and you’re dedicated to making sure your work is stable, secure, and maintainable. You’re an enthusiastic communicator and you like working with a team that provides both mutual support and thoughtful critique. You have experience with relational databases, REST APIs, and OOP principles Nice to haves: Experience working in dynamic high-growth organizations Rich interests and can bring a unique perspective to our team Experience writing Python, Typescript, React, Redux, or Node.js in a professional setting Salary Range: $130,000 - $160,000 *This salary range represents the minimum and maximum for this role based in San Francisco and New York. The salary given for this position is dependent on multiple factors, including years of experience, interview performance and anticipated responsibilities of the role. Our base salary is one component of Parabola’s competitive total package, which also includes equity and premium health and wellness benefits. *",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Maddy DeCarlo",
      "position": "Recruiter • 10 months"
    },
    "company": {
      "name": "Parabola",
      "description": "The best place to work with data",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/901853-20474fe4f3b15b1415fc193df359bcc2-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/parabola",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        }
      ],
      "markets": [
        "SaaS",
        "Enterprise Software",
        "Sales and Marketing",
        "Developer Tools",
        "Web Tools",
        "Data",
        "Logistics Software",
        "Ecommerce"
      ],
      "locations": ["New York City", "San Francisco"],
      "totalRaised": "$10.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/parabola/jobs/2530902-senior-full-stack-software-engineer",
    "title": "Senior Full Stack Software Engineer at Parabola",
    "location": "California • New York City • United States • San Francisco",
    "compensation": "$115k – $160k Wellfound Est.",
    "published": "2 days ago",
    "description": "About us: Parabola is transforming the way companies operate by empowering non-technical teams to automate complex data processes with ease. Our mission is to provide non-technical teams (\"operators\") with the same type of leverage as their technical counterparts. We do this by providing a no-code platform to build, automate and collaborate on data workflows. By empowering teams to solve the problems they're already experts on, Parabola helps businesses of all shapes and sizes improve operations, drive revenue and, ultimately, operate with excellence. Parabola is proud to partner with companies like Flexport, Sonos, Volcom and Durex and is backed by Matrix Partners, Thrive Capital, and many other amazing angel investors. About the role: As a Senior Full Stack Software Engineer on our growing team, you’ll be a technical leader across the stack, design and build our core platform features, reinforce and evolve our technical foundation, work with a unique flow-based calculation engine that demonstrates high throughput and availability. What you'll be doing: Partnering with product managers and designers to define, plan, and build new product functionality from start to finish. Consulting with the Customer Experience team to solve unique customer problems and find out where our product should grow next. Collaborating with a small-but-mighty group of engineers with a wide array of backgrounds and areas of expertise. Writing React + Redux code in a mature TypeScript codebase. Building and extending our core platform, from database schema to API design. Implementing the logic behind the steps that make up Parabola flows. Optimizing our services for scalability, stability, and observability as our customer base grows and our product becomes more sophisticated. Helping our team define processes and practices that will serve us for years of growth and success. What (we think) you'll need to do it: You have 4+ years of full-stack experience working in a team-based, high-uptime, continuously-delivered codebase. You’re not afraid to ask for help, and you’re happy to give it, too. You care about the craft of engineering, and you’re dedicated to making sure your work is stable, secure, and maintainable. You’re an enthusiastic communicator and you like working with a team that provides both mutual support and thoughtful critique. Nice to haves: Experience working in dynamic high-growth organizations Rich interests and can bring a unique perspective to our team Experience writing Python, Typescript, React, Redux, or Node.js in a professional setting Experience leading large technical projects across the stack Salary Range: $150,000 - $190,000 *This salary range represents the minimum and maximum for this role based in San Francisco and New York. The salary given for this position is dependent on multiple factors, including years of experience, interview performance and anticipated responsibilities of the role. Our base salary is one component of Parabola’s competitive total package, which also includes equity and premium health and wellness benefits. *",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "4+ years",
    "skills": [
      "Python",
      "Javascript",
      "Full Stack Development",
      "Backend Development",
      "Frontend Development",
      "TypeScript",
      "React.js"
    ],
    "hiringContact": {
      "name": "Maddy DeCarlo",
      "position": "Recruiter • 9 months"
    },
    "company": {
      "name": "Parabola",
      "description": "The best place to work with data",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/901853-20474fe4f3b15b1415fc193df359bcc2-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/parabola",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        }
      ],
      "markets": [
        "SaaS",
        "Enterprise Software",
        "Sales and Marketing",
        "Developer Tools",
        "Web Tools",
        "Data",
        "Logistics Software",
        "Ecommerce"
      ],
      "locations": ["New York City", "San Francisco"],
      "totalRaised": "$10.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/k-health-1/jobs/2658929-senior-android-engineer",
    "title": "Senior Android Engineer at K Health",
    "location": "New York City",
    "compensation": "$175k – $205k",
    "published": "2 months ago",
    "description": "About the role: Join our mission as a Senior Android Engineer that will lead our Android mobile strategy as we build new applications and experiences aimed at revolutionizing healthcare for the better. By regularly shipping a variety of products, you will directly and meaningfully impact the experience of millions of people. With an engaged community of users, you'll then have opportunities to improve your work based on the feedback and data you've collected to help measure your success. We believe in constantly evolving and improving through user research, testing, iteration, and experimentation. We are seeking Android engineers who have significant experience building robust mobile applications from the ground-up with attention to accessibility, maintainability, and efficiency. As an experienced Android engineer seeking an opportunity to help shape the future of one of the world's largest digital healthcare platforms, we hope you'll consider joining K Health! What you'll be doing: Lead architecture and design of features, from conception to launch Collaborate with product designers, product managers, and other software engineers to deliver excellent user experiences with high quality Work with team members to investigate design approaches, prototype technology and evaluate technical feasibility Make critical engineering decisions considering risks, trade offs, and alternative solutions Spearhead investigations, production issues and bugs Identify tech debt before it becomes an issue and work with team to prioritize it appropriately Mentor other mobile engineers and improve engineering processes to increase team effectiveness What we're looking for: 5+ years experience developing, releasing, and maintaining customer-facing Android applications Proficiency with Kotlin, Android Studio, Gradle, and Dagger Experience writing testable code and automating test regressions Experience with REST architecture for web services Knowledge full software development life cycle best practices, including coding standards, code reviews, source control management, continuous deployments, testing and operations Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies Strong problem solving and analytical/reasoning skills Excellent verbal and written communication skills Bonus Experience in mobile design patterns (MVVM, MVI, VIPER), building mobile frameworks / SDKs, building custom UX widgets and optimizing apps for performance Experience with automated mobile build / release pipelines, multi-module application development Experience with embedded databases Benefits &amp; Perks: #LI-Hybrid Hybrid work schedule with weekly lunches and stocked fridges Monthly social committees for company events 20 paid vacation days &amp; 5 sick days per year 10+ Holidays plus 10 additional 3-day weekends per year Stock options for every full-time employee Paid parental leave 401k benefit Commuter Benefits Competitive health, dental, and vision insurance options",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "skills": [],
    "hiringContact": {
      "name": "Elliot Parauda",
      "position": "Employee"
    },
    "company": {
      "name": "K Health",
      "description": "The first medical app that uses AI to deliver primary care better, faster, and cheaper",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7784387-1078e2c5a7b36705ad2478d0b4fd4e1f-medium_jpg.jpg",
      "size": "201-500 employees",
      "url": "https://wellfound.com/company/k-health-1",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Healthcare",
        "Artificial Intelligence",
        "Personal Health",
        "Health and Wellness",
        "Mobile Health",
        "Digital Health",
        "Telemedicine",
        "Artificial Intelligence / Machine Learning"
      ],
      "locations": ["Indianapolis", "New York City", "Tel Aviv-Yafo"],
      "totalRaised": "$273M"
    }
  },
  {
    "url": "https://wellfound.com/company/amazon/jobs/2354480-software-engineer-ii",
    "title": "Software Engineer II at Amazon",
    "location": "New York City • Seattle • Toronto • Santa Monica",
    "compensation": "$120k – $200k • No equity",
    "published": "10 months ago",
    "description": "Job summary Amazon is building a world class advertising business and we are responsible for defining and delivering a collection of self-service performance advertising products that drive discovery and sales. Our products are strategically important to our Retail and Marketplace businesses driving long term growth. We deliver billions of ad impressions and millions of clicks daily and are breaking fresh ground to create world-class products. We are highly motivated, collaborative and fun-loving with an entrepreneurial spirit and bias for action. With a broad mandate to experiment and innovate, we are growing at an unprecedented rate with a seemingly endless range of new opportunities. Our team's mandate is to launch and accelerate the advertising business in categories that require a differentiated customer and advertiser experience. We own end-to-end the advertising experience including placements, creative, ad serving, advertiser experience, and marketing. We're looking for entrepreneurial, innovative individuals who thrive on solving tough problems. We are investing in a deep technical team to pursue a transformation opportunity. The successful candidate will build upon core program management successes and develop breadth across a range of problem domains. This role can be performed near any US AWS office in the following cities: New York, Santa Monica, Seattle, Toronto. **About the team Sponsored Display is a self-service, display advertising solution for endemic and non-endemic advertisers to grow their business with Amazon at scale by engaging audiences across the shopping and entertainment journeys both on/off Amazon, powered by our first-party data and closed loop measurements. Basic qualifications 1+ years of experience contributing to the system design or architecture (architecture, design patterns, reliability and scaling) of new and current systems. 2+ years of non-internship professional software development experience Programming experience with at least one software programming language. Additional qualifications (optional) 3+ years professional experience in software development Computer Science fundamentals in object-oriented design Computer Science fundamentals in data structures Computer Science fundamentals in algorithm design, problem solving, and complexity analysis Proficiency in, at least, one modern programming language such as C, C++, Java, or Perl **Preferred qualifications Bachelor’s Degree in Computer Science or related field ** - Strong sense of ownership, urgency, and drive Strong knowledge of data structures, algorithms, and designing for performance, scalability, and availability Experience with UI frameworks such as Spring MVC, GWT, jQuery, Swing, etc. Experience with Amazon Web Services Coding skills in Java and/or C++ coupled with strong base in object-oriented design and development Experience in software development and full product life-cycles Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "preferredTimezones": "Pacific Time, Central Time",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "4+ years",
    "skills": [
      "Python",
      "Java",
      "Machine Learning",
      "Natural Language Processing",
      "Perl"
    ],
    "hiringContact": {
      "name": "Kyle Hughes",
      "position": "Employee"
    },
    "company": {
      "name": "Amazon",
      "description": "Earth's most customer-centric company",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/37683-b109108b8062148bcf51903a54d5eb92-medium_jpg.jpg",
      "size": "5000+ employees",
      "url": "https://wellfound.com/company/amazon",
      "badges": [
        {
          "text": "Same investor as Amazon"
        }
      ],
      "markets": [
        "E-Commerce",
        "Consumer Goods",
        "Advertising",
        "Internet Infrastructure",
        "Mobile Advertising",
        "Advertising Platforms",
        "Online Video Advertising"
      ],
      "locations": ["Austin", "Boston", "Boulder"],
      "totalRaised": "$8M"
    }
  },
  {
    "url": "https://wellfound.com/company/code-climate/jobs/2692929-sr-software-engineer-ii",
    "title": "Sr. Software Engineer II  at Code Climate",
    "location": "New York",
    "compensation": "140k – 190k Wellfound Est.",
    "published": "1 month ago",
    "description": "Code Climate empowers software engineering organizations to achieve excellence across people, process, and code with data-driven insights. Our Engineering intelligence products are trusted by thousands of organizations- from enterprises to startups - helping align engineering initiatives with strategic priorities, accelerate software delivery, and drive continuous improvement. Code Climate is based in New York and was founded in 2011, by engineering leaders who were frustrated by decisions being made in the dark or by gut instinct. Code Climate envisions a world where technology leaders can drive business success through increased transparency, efficiency, and actionable data. Since the launch of our company, our automated code review tool, Quality, has helped over 100,000 developers improve their code bases. After nearly a decade, we launched our flagship product, Velocity. Velocity enables technology leaders to make confident, data-driven decisions that fuel elite team performances at scale. The Engineering Team at Code Climate is responsible for building our polished customer-facing experiences and the underlying technology platform, which processes about two billion lines of source code every weekday across more than 10 programming languages (including Java, JavaScript, Ruby, Go, Python and Swift). We are a small but growing and highly effective team, whereas every team member is vital to the success of the company. We are certain that you will have the opportunity to take on significant ownership of technical projects and grow tremendously as an engineer through the unique challenges we face as the company grows immensely in 2022. Examples of Problems You’ll Be Solving: Work across the stack to deliver new features for Quality and Velocity. Collaborate with Product and Design to develop engaging and usable UIs for both our products. Improve the performance of our scaling platform. Monitor all of the above in a scalable way. We all do ops, so we depend on automation. Contribute to our agile development process by participating in code reviews, stand-ups, sprint planning, and retrospectives. Develop your solution incrementally and deploy often, sometimes several times a day, using CI/CD. Interact with a wide range of technologies like AWS, Docker, Kafka, MongoDB and more! You’re Awesome Because: You love solving big problems. You care about working in and fostering a positive and collaborative environment. You have a strong sense of product, and empathy for the human who is using it. You want to have an impact on the software engineering community. You are passionate about building maintainable, efficient, clean code. You enjoy being with peers who strive for engineering excellence. You like working in a fast paced environment. You always want to learn more and constantly improve as an engineer. Desired Qualifications: Fluent in UML. 10+ years of Ruby on Rails experience is a huge plus. 5+ years of ReactJS experience. Good understanding of Docker. You’ve been part of a team that works on large-scale distributed systems and are comfortable working in JavaScript. Working at Code Climate New York-headquartered startup with a hybrid working environment. Fast paced, high growth, start-up full of talented and mission driven individuals that love what they do. Competitive salary and meaningful stock options. Health, dental and vision insurance. We pay 100% of the premium for employees and 50% of the premium for dependents. Flexible and generous paid time off including an open vacation policy and parental leave. Opportunities to continue your professional development, including attending conferences. The best technology to get your job done. Base Salary - 185k-230k / year Backed by leading VC firms, including PSG, Union Square Ventures, Foundry Group, Lerer Hippeau Ventures, and NextView Ventures, Code Climate has raised $66M in funding to date having closed a Series C round in August 2021. Code Climate is an equal opportunity employer. Consistent with our mission of serving a diverse and global audience, we value a diverse workforce and inclusive culture which reflects that. We encourage applications from all qualified individuals without regard to race, color, religion gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Bryan Helmkamp",
      "position": "CEO • 13 years"
    },
    "company": {
      "name": "Code Climate",
      "description": "Giving you the insights you need to make lasting improvements to your team’s productivity",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/141031-a0a5921bd4348d315f0f7bbaa70cb6c1-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/code-climate",
      "badges": [
        {
          "text": "Same investor as Twitter"
        }
      ],
      "markets": [
        "SaaS",
        "B2B",
        "Analytics",
        "Business Intelligence",
        "Developer Tools",
        "Software Engineering"
      ],
      "locations": ["New York City", "New York"],
      "totalRaised": "$15M"
    }
  },
  {
    "url": "https://wellfound.com/company/fathom-health/jobs/2392143-software-engineer-infrastructure",
    "title": "Software Engineer, Infrastructure at Fathom",
    "location": "New York",
    "compensation": "$120k – $190k Wellfound Est.",
    "published": "3 weeks ago",
    "description": "Fathom is on a mission to use AI to understand and structure the world’s medical data, starting by making sense of the terabytes of clinician notes contained within the electronic health records of the world’s largest health systems. Our deep learning engine automates the translation of patient records into the billing codes used for healthcare provider reimbursement, a process today that costs hospitals in the US $15B+ annually and tens of billions more in errors and denied claims. We are a venture-backed company that completed a Series B round of financing for $46M in late 2022. Fathom is hiring for a Software Engineer, Infrastructure to join our expanding team in New York. This opportunity is worth exploring if you are someone who is passionate about intelligent automation and you get excited about being the 10X multiplier on your team. You will be leading the way for us in devops and security. To that end, we are looking for experienced candidates who are comfortable operating with autonomy. We need you to utilize your combination of strong software engineering experience and cloud service mastery savvy to design, deploy, and monitor all operational aspects of our platform. Please note that New York area opportunities are hybrid only and require 3 days in office weekly at our financial district location in Manhattan. Your role and responsibilities will include: Working to ensure the stability, security, and performance of Fathom’s platform Developing dependable internal tools that aid our machine learning and software engineers more efficient, in everything from infrastructure deployment, to continuous integration and testing Maintaining and configuring internal development and access control systems Collaborating with our product and engineering teams to identify strategic long-term projects and preempt infrastructure needs in advance We are looking for a teammate with: 2+ years of development experience in a company/production setting Experience with building, controlling, and monitoring secure cloud-based platforms An ability to define, defend, and drive technical infrastructure decisions and initiatives Basic operational familiarity with databases (SQL and NoSQL) and ability to help pick and implement the right tool for a given job A desire to collaborate in office 3 days weekly Bonus points if you have: Fluency in Python Knowledge of Google Cloud Experience with tools like Docker, Kubernetes and/or Spark Familiarity with continuous integration systems like CircleCI or Jenkins and/or continuous delivery systems such as Spinnaker Skills in devops in support of machine learning Interest in machine learning and/or healthcare Salary range: $100 000 - $160 000 USD",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Monica Sasinouan",
      "position": "Recruiter • 4 years"
    },
    "company": {
      "name": "Fathom",
      "description": "deep learning to automate medical coding",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/652436-f20a414513062c63eb3b71ae98dc4776-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/fathom-health",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        }
      ],
      "markets": [
        "Healthcare",
        "Machine Learning",
        "Artificial Intelligence",
        "Natural Language Processing"
      ],
      "totalRaised": "$46M"
    }
  },
  {
    "url": "https://wellfound.com/company/amazon/jobs/2335637-senior-software-engineer",
    "title": "Senior Software Engineer at Amazon",
    "location": "Remote • Austin • Boston • Chicago • Houston • New York City • Seattle • Washington DC • Minneapolis • Charlotte • San Francisco Bay Area",
    "compensation": "",
    "published": "11 months ago",
    "description": "JOB SUMMARY: The Amazon Devices team designs and engineers high-profile consumer electronics, including the best-selling Kindle family of products. We have also produced groundbreaking devices like Fire tablets, Fire TV, Amazon Dash, and Amazon Echo. What will you help us create? Be part of a fast-paced, agile and innovative team who is bringing new multi-modal, integrated voice with GUI, experiences to FireTV in a startup like environment. We are looking for passionate, hard-working, and talented software engineers who have experience building innovative, mission critical, high volume applications that customers love. This is a high visibility team where you will get a chance to make a positive impact on customer experience. The Amazon Kindle, Kindle Fire, Echo and FireTV are revolutionary consumer devices that have become the #1 best-selling Amazon products. They are among the most innovative and fastest growing businesses at both Amazon and the entire consumer electronics industry. We are looking for talented software engineers to join our team in building application software. This is an enormous opportunity to lead the design, architecture, and implementation of products used every day by people you know. In this role, you will: Do back-end services and mobile application software design and development Contribute expert-level development skills to develop performant consumer facing experiences for TV Write clean, maintainable code and performing peer code-reviews Work with other team members to investigate design approaches, prototype new technology and evaluate technical feasibility Work in an Agile/Scrum environment to deliver high quality software against aggressive schedules Establish architectural principles, select design patterns and then mentor team members on their appropriate application Work closely with internal teams to prioritize, design and build custom applications Interact directly with internal and external partners to identify app requirements As a Senior Software Developer, you will be a tech lead for a team of engineers in design, development, and testing of a range of products an d features. A successful candidate will have an established background in developing user-facing experiences, strong technical abilities, excellent task management skills, great communication skills, and a motivation to achieve results in a high impact environment. You will be helping to hire and develop your team and systems. In this role, you will: Prioritize well, communicate clearly, and have a consistent track record of delivery Contribute to the overall systems development lifecycle of key product subsystems Manage and execute against project plans and delivery commitments Manage day-to-day activities within an Agile/Scrum environment Work closely with the engineers to architect and develop the best technical design and approach Report on status of development, quality, operations, and system performance to management BASIC QUALIFICATIONS: Bachelor’s degree in Computer Science, Computer Engineering or related field 5+ years of non-internship professional software development experience 3+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems. 3+ years of demonstrated experience in Computer Science fundamentals in object-oriented design, data structures, algorithm design, and problem solving. Experience in Java, Linux/UNIX, Android, or relevant technologies. Experience building cloud APIs preferred Experience with full-stack development preferred. PREFERRED QUALIFICATIONS: Ability to learn and adapt to new, complex development environments Analytical and creative design skills and excellent communication skills Solid coding practices including good design documentation, unit testing, peer code reviews, and a preference for agile methods Experience mentoring more junior team members Experience with best practices in Android/Mobile App Development Experience with large-scale systems, distributed systems · Proven ability to design, develop, and deploy software in production as an individual contributor in an early-stage of product life-cycle Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "hiresRemotelyIn": "United States",
    "preferredTimezones": "Pacific Time, Mountain Time, Central Time, Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "6+ years",
    "skills": [
      "Java",
      "Android",
      "Mobile Development",
      "Linux",
      "Unix",
      "REST APIs"
    ],
    "hiringContact": {
      "name": "Natalie Hugdahl",
      "position": "Employee"
    },
    "company": {
      "name": "Amazon",
      "description": "Earth's most customer-centric company",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/37683-b109108b8062148bcf51903a54d5eb92-medium_jpg.jpg",
      "size": "5000+ employees",
      "url": "https://wellfound.com/company/amazon",
      "badges": [
        {
          "text": "Same investor as Amazon"
        }
      ],
      "markets": [
        "E-Commerce",
        "Consumer Goods",
        "Advertising",
        "Internet Infrastructure",
        "Mobile Advertising",
        "Advertising Platforms",
        "Online Video Advertising"
      ],
      "locations": ["Austin", "Boston", "Boulder"],
      "totalRaised": "$8M"
    }
  },
  {
    "url": "https://wellfound.com/company/fathom-health/jobs/2392138-senior-software-engineer-backend",
    "title": "Senior Software Engineer, Backend at Fathom",
    "location": "New York",
    "compensation": "$145k – $195k Wellfound Est.",
    "published": "3 weeks ago",
    "description": "Fathom is on a mission to use AI to understand and structure the world’s medical data, starting by making sense of the terabytes of clinician notes contained within the electronic health records of the world’s largest health systems. Our deep learning engine automates the translation of patient records into the billing codes used for healthcare provider reimbursement, a process today that costs hospitals in the US $15B+ annually and tens of billions more in errors and denied claims. We are a venture-backed company that completed a Series B round of financing for $46M in late 2022. We are looking for a Senior Software Engineer, Backend to work on data products that drive the core of our business. We want to work with teammates in New York City, who are excited about learning how to build and support machine learning pipelines that scale not just computationally, but in ways that are flexible, iterative, and geared for collaboration. If you are a backend expert able to unify data, and build systems that scale from both an operational and an organizational perspective, Fathom is an opportunity worth exploring! Please note that New York area opportunities are hybrid only and require 3 days in office weekly at our financial district location in Manhattan. Your role and responsibilities will include: Developing data infrastructure to ingest, sanitize and normalize a broad range of medical data, such as electronics health records, journals, established medical ontologies, crowd-sourced labelling and other human inputs Building performant and expressive interfaces to the data Creating infrastructure to help us not only scale up data ingest, but large-scale cloud-based machine learning We are looking for a teammate with: 5+ years of development experience in a company/production setting Experience building data pipelines from disparate sources Hands-on experience building and scaling up compute clusters A solid understanding of databases and large-scale data processing frameworks like Hadoop or Spark and the ability to evaluate which tools to use on the job A unique combination of creative and analytic skills apt of designing a system capable of pulling together, training, and testing dozens of data sources under a unified ontology A desire to collaborate in office 3 days weekly Bonus points if you have: Know-how of developing systems to do or support machine learning, including experience working with NLP toolkits like Stanford CoreNLP, OpenNLP, and/or Python’s NLTK Expertise with wrangling healthcare data and/or HIPAA Experience with managing large-scale data labelling and acquisition, through tools such as through Amazon Turk or DeepDive Salary range: $160 000 - $220 000 USD",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Monica Sasinouan",
      "position": "Recruiter • 4 years"
    },
    "company": {
      "name": "Fathom",
      "description": "deep learning to automate medical coding",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/652436-f20a414513062c63eb3b71ae98dc4776-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/fathom-health",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        }
      ],
      "markets": [
        "Healthcare",
        "Machine Learning",
        "Artificial Intelligence",
        "Natural Language Processing"
      ],
      "totalRaised": "$46M"
    }
  },
  {
    "url": "https://wellfound.com/company/wingspanapp/jobs/2679934-senior-software-engineer-platform",
    "title": "Senior Software Engineer - Platform at Wingspan",
    "location": "Remote • New York",
    "compensation": "$155k – $180k",
    "published": "1 month ago",
    "description": "Who We Are In today’s economy, an increasing number of workers are choosing to freelance. By 2027, half the U.S. workforce will be independent contractors. Yet there is no system of record for this vast self-employed community and the legions of businesses that increasingly rely on it. A new paradigm is needed to accommodate the future of work that is suddenly no longer in the future. That is what Wingspan is building. Wingspan is the first payroll platform designed specifically for independent contractors and their businesses. We make onboarding, payments, and compliance easy for flexible workforces of all sizes. Whether you’re a one-person business or a large enterprise, Wingspan has you covered. We’re a Series A startup based in NYC with backing from some of the best VCs and operators around, including Andreessen Horowitz (a16z) and the CEOs and founders of Warby Parker, Harry’s, Allbirds, Invision, and Flatiron Health. Now we're hiring for you: an ambitious individual ready to help build, design, and support enterprise-grade software scaled to millions of individuals. Are you ready to be part of a team redefining the future of work? Apply now! Impact of the Role: As a Senior Software Engineer at Wingspan, you will play a pivotal role in shaping the future of technology by developing cutting-edge solutions that empower businesses and improve people's lives. You will work alongside a team of passionate and talented engineers, helping us maintain our position as industry leaders and ensuring our products continue to outperform the competition. What you'll do: Design, develop, and implement high-quality, scalable software solutions that meet client needs and exceed expectations Collaborate with cross-functional teams to ensure seamless integration and timely delivery of projects Continuously improve and optimize existing software systems by identifying inefficiencies, refactoring code, and implementing best practices Participate in agile development processes, including sprint planning, daily standups, and retrospectives, to ensure project success and team alignment Contribute to the growth of our engineering culture by sharing knowledge, mentoring new engineering hires, and actively participating in code reviews and technical discussions Stay current with industry trends, emerging technologies, and best practices, and proactively identify opportunities to incorporate these into our tech stack Qualifications: Extensive experience with at least one back-end programming language (we use Node) Strong communication and collaboration skills, with a track record of working effectively in cross-functional teams and adapting to diverse perspectives Experience in proactively identifying opportunities for process improvements and driving the adoption of best practices to optimize cross-functional collaboration and overall team productivity. Track record of promoting a culture of continuous learning and innovation, encouraging the exploration of new technologies and techniques to enhance backend system performance and capabilities. Proven ability to lead and manage complex projects end-to-end, from initial planning and scoping to successful implementation and delivery, ensuring timely completion and alignment with business objectives. Requirements: 5+ years of professional software development experience, with a strong background in object-oriented programming Solid understanding of data structures, algorithms, and software design principles Familiarity with software testing methodologies, including unit, integration, and system testing Knowledge of industry trends, emerging technologies, and best practices in software development Experience with agile development processes, such as sprint planning, daily standups, and retrospectives Must be authorized to work in the United States. At this time we are unable to transfer or sponsor visas Compensation At Wingspan, we pride ourselves on offering a competitive and comprehensive compensation package that reflects our commitment to attracting top talent. The annual base salary for this role ranges from $155,000-$180,000 and is accompanied by a target equity package and an extensive suite of benefits, including medical, dental, and vision insurance. All figures cited are in USD and pertain to workers located in the United States. We understand that each candidate brings a unique combination of skills, experience, and qualifications to the table, which is why we tailor our compensation packages based on factors such as expertise, years of experience, certifications, and other factors. Join us in our mission to innovate and excel, knowing that you will be valued and recognized for your job-related knowledge, skills, and experience. Our comprehensive benefits and rewards are designed to help you thrive both professionally and personally, as we work together to shape the future of our industry. Benefits &amp; Perks Unlimited vacation Competitive stock option package $300 one-time WFH stipend Medical, dental, and vision benefits Top of the line 14\" Macbook Pro Travel stipend for team off-sites We appreciate candidates who are open and honest about what they’re looking for so we can ensure it’s a fit on both sides. To all recruitment firms we do not work with: Wingspan does not permit the submission of agency-provided resumes. Kindly refrain from sending resumes to our job-related email addresses and Wingspan staff members. Wingspan will not be held accountable for any charges associated with unsought resumes. At Wingspan, we are an equal opportunity employer passionately dedicated to fostering a diverse and inclusive workplace. We wholeheartedly believe that embracing diversity of perspectives and backgrounds is essential to building the best products and providing delightful experiences for our users and team members. We are proud to maintain an environment free from discrimination, retaliation, and harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, ancestry, ethnicity, marital status, pregnancy, disability, genetic information, protected veteran status, or any other characteristic protected by law or ordinance. As we strive for excellence, we are committed to ensuring fair employment practices and business dealings and rejecting any form of discrimination or retaliation. These protections and commitments extend to all management practices and decisions, including recruitment and hiring, appraisal systems, promotions, training, and career development programs. Consistent with these obligations, Wingspan also provides reasonable accommodations to employees and applicants with disabilities and for sincerely held religious beliefs, observances, and practices. If you would like to request an accommodation as part of the application process, please contact [Clifton Jadoo at [email protected]]. Join us in our mission to create a company and products we love, as we celebrate our diverse workforce and promote an inclusive work environment that drives innovation and success.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "5+ years",
    "skills": ["Node.js"],
    "hiringContact": {
      "name": "Clifton Jadoo",
      "position": "Employee"
    },
    "company": {
      "name": "Wingspan",
      "description": "Gusto for freelancers",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7156140-6667dcb19da8daa2fb728715a670670d-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/wingspanapp",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        },
        {
          "text": "Recently funded"
        }
      ],
      "markets": [
        "Financial Services",
        "Payments",
        "Banking",
        "Finance Technology",
        "Freelancers",
        "Hr Tech",
        "Fin Tech",
        "Insurtech"
      ],
      "locations": ["New York City", "Remote"],
      "totalRaised": "$14M"
    }
  },
  {
    "url": "https://wellfound.com/company/fathom-health/jobs/2392139-software-engineer-backend",
    "title": "Software Engineer, Backend at Fathom",
    "location": "New York",
    "compensation": "$110k – $155k Wellfound Est.",
    "published": "3 weeks ago",
    "description": "Fathom is on a mission to use AI to understand and structure the world’s medical data, starting by making sense of the terabytes of clinician notes contained within the electronic health records of the world’s largest health systems. Our deep learning engine automates the translation of patient records into the billing codes used for healthcare provider reimbursement, a process today that costs hospitals in the US $15B+ annually and tens of billions more in errors and denied claims. We are a venture-backed company that completed a Series B round of financing for $46M in late 2022. We are looking for a Software Engineer, Backend to work on data products that drive the core of our business. We want to work with teammates in New York City, who are excited about learning how to build and support machine learning pipelines that scale not just computationally, but in ways that are flexible, iterative, and geared for collaboration. If you are a backend expert able to unify data, and build systems that scale from both an operational and an organizational perspective, Fathom is an opportunity worth exploring! Please note that New York area opportunities are hybrid only and require 3 days in office weekly at our financial district location in Manhattan. Your role and responsibilities will include: Developing data infrastructure to ingest, sanitize and normalize a broad range of medical data, such as electronics health records, journals, established medical ontologies, crowd-sourced labelling and other human inputs Building performant and expressive interfaces to the data Creating infrastructure to help us not only scale up data ingest, but large-scale cloud-based machine learning We are looking for a teammate with: 2+ years of development experience in a company/production setting Experience building data pipelines from disparate sources Hands-on experience building and scaling up compute clusters A solid understanding of databases and large-scale data processing frameworks like Hadoop or Spark and the ability to evaluate which tools to use on the job A unique combination of creative and analytic skills apt of designing a system capable of pulling together, training, and testing dozens of data sources under a unified ontology A desire to collaborate in office 3 days weekly Bonus points if you have: Know-how of developing systems to do or support machine learning, including experience working with NLP toolkits like Stanford CoreNLP, OpenNLP, and/or Python’s NLTK Expertise with wrangling healthcare data and/or HIPAA Experience with managing large-scale data labelling and acquisition, through tools such as through Amazon Turk or DeepDive Salary range: $100 000 - $160 000 USD",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "skills": [],
    "hiringContact": {
      "name": "Monica Sasinouan",
      "position": "Recruiter • 4 years"
    },
    "company": {
      "name": "Fathom",
      "description": "deep learning to automate medical coding",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/652436-f20a414513062c63eb3b71ae98dc4776-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/fathom-health",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        }
      ],
      "markets": [
        "Healthcare",
        "Machine Learning",
        "Artificial Intelligence",
        "Natural Language Processing"
      ],
      "totalRaised": "$46M"
    }
  },
  {
    "url": "https://wellfound.com/company/grow-therapy/jobs/1814927-staff-software-engineer",
    "title": "Staff Software Engineer at Grow Therapy",
    "location": "Remote • New York City • United States",
    "compensation": "$180k – $220k • No equity",
    "published": "1 month ago",
    "description": "About the Role As a staff software engineer at Grow Therapy, you’ll have a huge amount of scope and autonomy. You get to see a number of different product surface areas (provider portal, marketplace, client experience, infrastructure, and enabling operations) in addition to working full-stack (Flask/Python on the backend, React/TypeScript on the frontend, infrastructure on AWS). What you'll do Making a robust cost estimation and eligibility checking platform - You’ll pull in data from different sources and implement the logic and infrastructure that allows us to give cost estimates for every insurance type our providers accept. Creating a world-class note-taking experience for providers - Notes are where our providers spend most of their day! You’ll own the full-stack experience of notes syncing, intelligent prefilling, and caching notes to create a best-in-class experience. Optimizing search ranking and performance at scale - there are hundreds and soon to be thousands of providers who accept many different insurance types, have unique backgrounds, and differing amounts of availability. Help us create a search algorithm that matches clients with the right therapist for them! Who you are 5+ years in engineering. You’ve built and scaled systems, made complex engineering decisions, and have proved out your technical skills in industry. Entrepreneurial spirit. You have worked in a startup or on your own side projects and built products from the ground up. Product thinker. You want to build through a user-centric lens and be involved not only in engineering decisions but product and design decisions as well. Leader. You have experience mentoring younger engineers formally and informally. You help set best practices for the team. Team Player. You are collaborative by nature, relish in camaraderie and group wins, and are looked to by colleagues as a steadfast partner and source of encouragement Highly Motivated. You want ownership of your work. Bonus Points Experience with React, TypeScript, and GraphQL Python and Flask Experience Interesting side projects! The salary range for this position is $186 - 220K per year.",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "hiresRemotelyIn": "United States",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "7+ years",
    "skills": ["Python"],
    "hiringContact": {
      "name": "Rachel Kovan",
      "position": "Employee"
    },
    "company": {
      "name": "Grow Therapy",
      "description": "Grow enables therapists to launch their own in-network teletherapy practices",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8042601-c1415caa16e3346735fdefa1429ee606-medium_jpg.jpg",
      "size": "51-200 employees",
      "url": "https://wellfound.com/company/grow-therapy",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": ["Software", "Health and Insurance", "Mental Health"],
      "totalRaised": "$90M"
    }
  },
  {
    "url": "https://wellfound.com/company/wingspanapp/jobs/2679935-senior-devops-engineer",
    "title": "Senior DevOps Engineer at Wingspan",
    "location": "Remote • New York",
    "compensation": "$155k – $180k",
    "published": "1 month ago",
    "description": "Who We Are In today’s economy, an increasing number of workers are choosing to freelance. By 2027, half the U.S. workforce will be independent contractors. Yet there is no system of record for this vast self-employed community and the legions of businesses that increasingly rely on it. A new paradigm is needed to accommodate the future of work that is suddenly no longer in the future. That is what Wingspan is building. Wingspan is the first payroll platform designed specifically for independent contractors and their businesses. We make onboarding, payments, and compliance easy for flexible workforces of all sizes. Whether you’re a one-person business or a large enterprise, Wingspan has you covered. We’re a Series A startup based in NYC with backing from some of the best VCs and operators around, including Andreessen Horowitz (a16z) and the CEOs and founders of Warby Parker, Harry’s, Allbirds, Invision, and Flatiron Health. Now we're hiring for you: an ambitious individual ready to help build, design, and take us to the next level. Are you ready to be part of a team redefining the future of work? Apply now! Impact of the Role As a Senior DevOps Engineer at Wingspan, you will play a pivotal role in shaping the future of technology by building cutting-edge solutions that empower businesses and improve people's lives. You will work alongside a team of passionate and talented engineers, helping us maintain our position as industry leaders and ensuring our products continue to outperform the competition. What you'll do: Collaborate with development teams to enhance CI/CD pipelines and cloud infrastructure Develop and maintain documentation for infrastructure, deployment, and automation processes Monitor and optimize the performance of infrastructure hosted on Google Cloud. Implement and maintain security best practices for cloud infrastructure, including IAM policies, encryption, network security, and compliance Enhance our existing databases while also introducing new databases to match future needs Manage platform configuration and credentials such as SSL Certificates and API secrets Ensure infrastructure credentials are rotated frequently Ensure infrastructure software is patched frequently Qualifications Experience in application architecture, distributed hosting, and security Hands-on experience with GCP services such as GCE, GCS, Could SQL General knowledge of event driven architecture Expertise with hosting via Serverless Frameworks such as Google Cloud Functions or AWS Lambda. Strong communication and collaboration skills with a focus on teamwork and knowledge sharing Requirements 6+ years of hands-on experience in cloud infrastructure design and management Experience with managing a persistent database such as MySQL, PostGres and MongoDB Experience with managing a caching layer as hosted via technologies such as Redis or Memcached. Demonstrated proficiency in one or more programming languages for automation (ie Python, Typescript, Node.JS, Go) Experience with containerization and orchestration using Docker and Kubernetes Experience with CI/CD pipelines using tools such as Jenkins, Git, Ansible, Google Cloudbuild and Terraform Experience with load balancing technologies Strong hands on expertise in Systems/Network on a Cloud Service Provider such as Google Cloud Platform, AWS or Microsoft Azure Strong communication and collaboration skills with a focus on teamwork and knowledge sharing Compensation At Wingspan, we pride ourselves on offering a competitive and comprehensive compensation package that reflects our commitment to attracting top talent. The annual base salary for this role ranges from $155,000-$180,000, and is accompanied by a target equity package and an extensive suite of benefits, including medical, dental, and vision insurance. All figures cited are in USD and pertain to workers located in the United States. We understand that each candidate brings a unique combination of skills, experience, and qualifications to the table, which is why we tailor our compensation packages based on factors such as expertise, years of experience, certifications, and other factors. Join us in our mission to innovate and excel, knowing that you will be valued and recognized for your job-related knowledge, skills, and experience. Our comprehensive benefits and rewards are designed to help you thrive both professionally and personally, as we work together to shape the future of our industry. Benefits &amp; Perks Unlimited vacation Competitive stock option package $300 one-time WFH stipend Medical, dental, and vision benefits Top of the line 14\" Macbook Pro Travel stipend for team off-sites We appreciate candidates who are open and honest about what they’re looking for so we can ensure it’s a fit on both sides. To all recruitment firms we do not work with: Wingspan does not permit the submission of agency-provided resumes. Kindly refrain from sending resumes to our job-related email addresses and Wingspan staff members. Wingspan will not be held accountable for any charges associated with unsought resumes. At Wingspan, we are an equal opportunity employer passionately dedicated to fostering a diverse and inclusive workplace. We wholeheartedly believe that embracing diversity of perspectives and backgrounds is essential to building the best products and providing delightful experiences for our users and team members. We are proud to maintain an environment free from discrimination, retaliation, and harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, ancestry, ethnicity, marital status, pregnancy, disability, genetic information, protected veteran status, or any other characteristic protected by law or ordinance. As we strive for excellence, we are committed to ensuring fair employment practices and business dealings and rejecting any form of discrimination or retaliation. These protections and commitments extend to all management practices and decisions, including recruitment and hiring, appraisal systems, promotions, training, and career development programs. Consistent with these obligations, Wingspan also provides reasonable accommodations to employees and applicants with disabilities and for sincerely held religious beliefs, observances, and practices. If you would like to request an accommodation as part of the application process, please contact [Clifton Jadoo at [email protected]]. Join us in our mission to create a company and products we love, as we celebrate our diverse workforce and promote an inclusive work environment that drives innovation and success.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "5+ years",
    "skills": ["DevOps", "Kubernetes"],
    "hiringContact": {
      "name": "Clifton Jadoo",
      "position": "Employee"
    },
    "company": {
      "name": "Wingspan",
      "description": "Gusto for freelancers",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7156140-6667dcb19da8daa2fb728715a670670d-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/wingspanapp",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        },
        {
          "text": "Recently funded"
        }
      ],
      "markets": [
        "Financial Services",
        "Payments",
        "Banking",
        "Finance Technology",
        "Freelancers",
        "Hr Tech",
        "Fin Tech",
        "Insurtech"
      ],
      "locations": ["New York City", "Remote"],
      "totalRaised": "$14M"
    }
  },
  {
    "url": "https://wellfound.com/company/k-health-1/jobs/2658928-senior-ios-engineer",
    "title": "Senior iOS Engineer at K Health",
    "location": "New York City",
    "compensation": "$175k – $205k",
    "published": "2 months ago",
    "description": "About the role: Join our mission as a Senior iOS Engineer that will lead our iOS mobile strategy as we build new applications and experiences aimed at revolutionizing healthcare for the better. By regularly shipping a variety of products, you will directly and meaningfully impact the experience of millions of people. With an engaged community of users, you'll then have opportunities to improve your work based on the feedback and data you've collected to help measure your success. We believe in constantly evolving and improving through user research, testing, iteration, and experimentation. We are seeking iOS engineers who have significant experience building robust mobile applications from the ground-up with attention to accessibility, maintainability, and efficiency. As an experienced iOS engineer seeking an opportunity to help shape the future of one of the world's largest digital healthcare platforms, we hope you'll consider joining K Health! What you'll be doing: Lead architecture and design of features, from conception to launch Collaborate with product designers, product managers, and other software engineers to deliver excellent user experiences with high quality Work with team members to investigate design approaches, prototype technology and evaluate technical feasibility Make critical engineering decisions considering risks, trade offs, and alternative solutions Spearhead investigations, production issues and bugs Identify tech debt before it becomes an issue and work with the team to prioritize it appropriately Mentor other mobile engineers and improve engineering processes to increase team effectiveness What we're looking for: 5+ years experience developing, releasing, and maintaining customer-facing iOS applications Proficiency in Swift 5.0+, SwiftUI, and the latest UIKit / Foundation Frameworks Experience with Cocoa, Objective-C and declarative UI frameworks Experience writing testable code and automating test regressions Experience with REST architecture for web services Knowledge full software development life cycle best practices, including coding standards, code reviews, source control management, continuous deployments, testing and operations Strong problem solving and analytical/reasoning skills Excellent verbal and written communication skills Bonus Experience in mobile design patterns (MVVM, MVI, VIPER), building mobile frameworks / SDKs, building custom UX widgets and optimizing apps for performance Experience with automated mobile build / release pipelines, multi-module application development Experience with embedded databases Benefits &amp; Perks: #LI-Hybrid Hybrid work schedule with weekly lunches and stocked fridges Monthly social committees for company events 20 paid vacation days &amp; 5 sick days per year 10+ Holidays plus 10 additional 3-day weekends per year Stock options for every full-time employee Paid parental leave 401k benefit Commuter Benefits Competitive health, dental, and vision insurance options",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "skills": [],
    "hiringContact": {
      "name": "Elliot Parauda",
      "position": "Employee"
    },
    "company": {
      "name": "K Health",
      "description": "The first medical app that uses AI to deliver primary care better, faster, and cheaper",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7784387-1078e2c5a7b36705ad2478d0b4fd4e1f-medium_jpg.jpg",
      "size": "201-500 employees",
      "url": "https://wellfound.com/company/k-health-1",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Healthcare",
        "Artificial Intelligence",
        "Personal Health",
        "Health and Wellness",
        "Mobile Health",
        "Digital Health",
        "Telemedicine",
        "Artificial Intelligence / Machine Learning"
      ],
      "locations": ["Indianapolis", "New York City", "Tel Aviv-Yafo"],
      "totalRaised": "$273M"
    }
  },
  {
    "url": "https://wellfound.com/company/k-health-1/jobs/2677096-senior-software-engineer",
    "title": "Senior Software Engineer at K Health",
    "location": "New York City",
    "compensation": "$175k – $240k",
    "published": "1 month ago",
    "description": "About the role: Join our mission as a Senior Software Engineer that will lead development and delivery of new features aimed at revolutionizing healthcare for the better. By regularly shipping a variety of products, from small internal tools to large-scale web applications, you will directly and meaningfully impact the experience of millions of people. With an engaged community of users, you'll then have opportunities to improve your work based on the feedback and data you've collected to help measure your success. We believe in constantly evolving and improving through user research, testing, iteration, and experimentation. K Health is seeking engineers who have significant experience working on highly-scalable, distributed systems, building robust services that interface with internal and external service providers, and consuming/instrumenting big data for analytics and reporting. As an experienced engineer seeking an opportunity to help shape the future of one of the world's largest digital healthcare platforms, we hope you'll consider joining K Health! What you'll do: Lead design and implementation of technical solutions for various initiatives, ensuring the system design meets scalability, performance, and security requirements Collaborate with product designers, product managers, and other software engineers to deliver customer facing features with high quality Work with team members to investigate design approaches, prototype technology and evaluate technical feasibility Make critical engineering decisions considering risks, trade offs, and alternative solutions Drive continuous improvement in our software and development process within an agile development team Write automated unit and integrations test as appropriate to support our continuous integration pipelines, with a focus on DevOps and robust automation Spearhead investigations, production issues and bugs Identify tech debt before it becomes an issue and work with team to prioritize it appropriately Mentor other engineers and improve engineering processes to increase team effectiveness What we're looking for: 5+ years of software engineering experience building web/backend systems Experience in designing and developing services with APIs that are efficient, well-tested, and easy to maintain Experience with building APIs using GraphQL and Apollo Federation Proficiency in NodeJS and Typescript, experience with modern service frameworks such as NestJS and ExpressJS Experience with modern cloud technologies such as Docker, Kubernetes, Kafka, GCP/AWS suite Knowledge of full software development life cycle best practices, including coding standards, code reviews, source control management, continuous deployments, testing and operations Strong problem solving and analytical/reasoning skills, excellent verbal and written communication skills Self-driven, ability to thrive in a fast-paced startup environment Ability to deliver with little supervision Bonus Experience with Python service development and Fast API framework Experience with FHIR Experience in building mobile applications Mentoring skills Benefits &amp; Perks: #LI-Hybrid Hybrid work schedule with weekly lunches and stocked fridges Monthly social committees for company events 20 paid vacation days &amp; 5 sick days per year 10+ Holidays plus 10 additional 3-day weekends per year Stock options for every full-time employee Paid parental leave 401k benefit Commuter Benefits Competitive health, dental, and vision insurance options",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "skills": [],
    "hiringContact": {
      "name": "Elliot Parauda",
      "position": "Employee"
    },
    "company": {
      "name": "K Health",
      "description": "The first medical app that uses AI to deliver primary care better, faster, and cheaper",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7784387-1078e2c5a7b36705ad2478d0b4fd4e1f-medium_jpg.jpg",
      "size": "201-500 employees",
      "url": "https://wellfound.com/company/k-health-1",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Healthcare",
        "Artificial Intelligence",
        "Personal Health",
        "Health and Wellness",
        "Mobile Health",
        "Digital Health",
        "Telemedicine",
        "Artificial Intelligence / Machine Learning"
      ],
      "locations": ["Indianapolis", "New York City", "Tel Aviv-Yafo"],
      "totalRaised": "$273M"
    }
  },
  {
    "url": "https://wellfound.com/company/tiptopxyz/jobs/2216005-sr-software-engineer-data",
    "title": "Sr. Software Engineer, Data at TipTop",
    "location": "Remote • Austin • Los Angeles • New York City • Portland • Seattle • United States • San Francisco",
    "compensation": "$150k – $200k • 0.25% – 0.5%",
    "published": "4 weeks ago",
    "description": "*We’re inviting individuals with a deep knowledge in data engineering to join the TipTop core team. Are you a curious thinker who likes to solve complex challenges in a rewarding environment where your contributions are valued and have a direct impact? Your work will sit at the core of the product and have a direct impact on customers, partners, and the platform. * About us We’re building consumer and enterprise systems at the intersection of e-commerce, fintech, and logistics that will change our relationship with the things we purchase. We’re pre-market, envisioning an entirely new consumer finance paradigm and developing its first version. Note that we’re a distributed team collaborating remotely and meet up in person quarterly. Postmates founder banks $23 million for his new crypto startup TipTop | TechCrunch (we're not necessarily a crypto startup 😉) TipTop Funding Information | AngelList Talent You Will Build reliable data services and robust ingestion pipelines for both structured and unstructured data sources Design and ship ETL pipelines that transform, aggregate, normalize, and master messy data Develop and automate large scale, high-performance data processing systems (batch and/or streaming) Define data models for optimal storage with a keen eye for model development, analysis, and optimization over time Have the opportunity to build and lead a team You Have 5+ years of experience as a software engineer architecting, building, launching and maintaining end-to-end data systems from whiteboard to production Demonstrated ability turning business and product ideas into engineering solutions. You can go from zero to one A highly analytical mindset and eagerness to solve technical problems with data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools. Strong programming experience in Python | SQL Familiarity with modern data stores, pipeline and orchestration tools Even Better Experience working closely with Machine Learning and Data Scientists An advanced degree (M.S., PhD.) in Mathematics, Statistics, Computer Science, Quantitative Finance, Physics, or a related technical field Passion for building, bias for action, and are excited by uncertainty You are autonomous &amp; adaptable – own the work, move fast, react quickly Curiosity in evolving ML platforms and technologies like ChatGPT Tech You'll Use Python Go SQL/Postgres Dataflow / Airflow DBT TensorFlow/PyTorch/Spark GCP How To Apply Please share a copy of your resume or LinkedIn, your GitHub (if you’ve got one), and any projects you think we should see.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "preferredTimezones": "Hawaii, Alaska, Pacific Time, Mountain Time, Central Time, Eastern Time, Atlantic Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "5+ years",
    "skills": [
      "Python",
      "Machine Learning",
      "Databases",
      "ETL",
      "Engineering",
      "Go (Golang)"
    ],
    "hiringContact": {
      "name": "Pasha Petukhov",
      "position": "Founding Engineer • 1 year"
    },
    "company": {
      "name": "TipTop",
      "description": "Stealth",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8889400-27042869faf5be6ac965cf1de99d8926-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/tiptopxyz",
      "badges": [],
      "markets": [
        "Financial Services",
        "E-Commerce",
        "Logistics",
        "Finance Technology"
      ],
      "locations": ["Los Angeles", "New York City", "Seattle"],
      "totalRaised": "$23.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/fintron/jobs/2730567-senior-software-engineer-back-end",
    "title": "Senior Software Engineer, Back End at FinTron",
    "location": "Remote • California • New York City • Pennsylvania • Texas • Utah • Connecticut • New Jersey • New York",
    "compensation": "$160k – $200k",
    "published": "3 days ago",
    "description": "About Us FinTron Invest is a fast-growing FinTech startup, SEC registered, FINRA member broker-dealer with over 12,000 clients and nearly $10M in funding. FinTron is on a mission to make investing, banking, and personal financial management more accessible and appealing to young consumers. FinTron is deeply rooted in the belief that investing has been intimidating for too long, and that anyone should be able to take control of their finances (not just the 1%). FinTron operates a direct-to-consumer FinTech app, an EdTech platform, and B2B embedded technology solutions. We are an agile, tech-enabled company, we are committed to educating and serving Gen Y &amp; Z. The Role We are seeking a Senior Software Engineer who has rich experience in modern frontend and backend technologies and is passionate about writing clean, well-tested, and maintainable code. We are looking for a highly experienced developer who is eager to join our team in building a modern event Driven microservice architecture to support our auto-scalable and highly available multi-tenant SaaS platform. Design efficient and reusable components that power our multiple websites and mobile application. Collaborate with the development team to architect our backend systems to scale and resolve performance issues. The developer will be reporting directly to the CTO and working in close collaboration with the existing dev team. You Are: Creative problem solver with a passion for testing, debugging, and overall code quality Hands-on senior developer capabilities, individualistic contributor, and a team player Detail-oriented self-starter that is comfortable working in a fast-paced startup environment Proactive in monitoring live systems and troubleshooting production issues Enjoys mentoring other team members on engineering best practices You’ll be utilizing several languages and technologies such as: Go Python Pytest and other testing frameworks Protocol Buffers GraphQL SigNoz gRPC AWS (VPC, EC2, RDS, S3, Glacier, CloudTrail, Route 53, Inspector, Systems Manager, and GuardDuty) Jenkins Github Actions PostgreSQL RedPanda or Kafka Must-Have Qualifications Proven 6+ years of industry experience as a senior software engineer 2+ years of hands-on development with Golang Startup experience strongly preferred in the fintech space Experience with end-to-end full-stack mobile, web, and QA testing Strong command of SQL and other databases (PostgreSQL, Oracle, MongoDB, etc) Familiar with the software development life cycle (SDLC) from analysis to deployment Excellent verbal and written communication Manage time efficiently and is highly collaborative Preferred: BSc/BA in Computer Science, Engineering or a related field; MBA or other relevant graduate degree is a plus Why join the FinTron Team? Competitive cash/equity blend compensation Unlimited room for self-growth and opportunity with a scaling fintech startup Remote friendly Located in Stamford, CT less than 1 mile from the train station Casual dress code &amp; holistic workplace environment Pet-friendly office environment On-premise gym membership Opportunity to be a part of a close-knitted &amp; quirky company culture, immerse yourself in highly interactive work with a talented, energetic and passionate team! FinTron is proud to be an Affirmative Action Equal Opportunity Employer and is committed to building an inclusive environment for people of all backgrounds. We celebrate people of all race, color, religion, age, sex, national origin, disability status, genetics, veteran status, sexual orientation, gender identity, expression, or any other status protected by law.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "preferredTimezones": "Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "6+ years",
    "skills": [
      "Python",
      "SaaS",
      "PostgreSQL",
      "DevOps",
      "Backend Development",
      "AWS/EC2/ELB/S3/DynamoDB",
      "FinTech",
      "Go (Golang)",
      "Microservices",
      "Python/Django/Flask",
      "Grpc",
      "GraphQL",
      "Multitenancy",
      "Pytest",
      "Redpanda"
    ],
    "hiringContact": {
      "name": "Kristina DiNardo",
      "position": "Director of Human Resources • 3 years"
    },
    "company": {
      "name": "FinTron",
      "description": "Accelerating personal finance for the Mobile-First Generation!",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7076095-1e97075f5eb0a2b2509e102a242b32dc-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/fintron",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Mobile",
        "Financial Services",
        "Education",
        "Personal Finance",
        "Application Platforms",
        "Apps",
        "Banking",
        "Finance Technology",
        "E Banking",
        "Education Technology",
        "Mobile Application",
        "Edtech",
        "Website",
        "Fin Tech"
      ],
      "locations": ["Connecticut", "Stamford", "Fairfield County"],
      "totalRaised": "$7.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/amazon/jobs/2152719-software-engineer",
    "title": "Software Engineer at Amazon",
    "location": "Boulder • New York City • Toronto",
    "compensation": "$130k – $200k • No equity",
    "published": "11 months ago",
    "description": "Job Summary DESCRIPTION Amazon has come a long way since opening on the World Wide Web in July 1995. Today, we operate retail websites in multiple countries across geographies, offering products in many categories (books, media, digital, electronics etc.) worldwide, and we still like to work hard, have fun and make history! The Amazon.com brand has become synonymous with a superior level of convenience, selection, low prices, and customer service. Basic Qualifications Programming experience with at least one software programming language. 2+ years of experience in software development Key Responsibilities include:- Ability to code right solutions starting with broadly defined problems, Understand basic Algorithm fundamentals Development of code in object oriented languages like C++ and java and build large scale robust distributed systems Candidates For This Role Must Have A solid grounding in Computer Science fundamentals (based on a BS or MS in CS or related field) Understanding of the tools of the trade, including an understanding of any of modern programming languages (Java / JavaScript / C/C++). Proven educational track record with sound data structure and algorithm knowledge Preferred Qualifications Bachelors/Masters in Computer Science or Engineering Strong, object-oriented design and coding skills (C/C++ and/or Java preferably on a UNIX or Linux platform) Knowledge of Perl or other scripting languages a plus Experience with distributed (multi-tiered) systems, algorithms, and relational databases Experience in optimization mathematics (linear programming, nonlinear optimization) Ability to effectively articulate technical challenges and solutions Deal well with ambiguous/undefined problems; ability to think abstractly Previous technical internship(s) preferred Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "remoteWorkPolicy": "In office - WFH flexibility",
    "experience": "2+ years",
    "skills": ["Python", "C++", "Java"],
    "hiringContact": {
      "name": "Bryan Walsh",
      "position": "Employee"
    },
    "company": {
      "name": "Amazon",
      "description": "Earth's most customer-centric company",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/37683-b109108b8062148bcf51903a54d5eb92-medium_jpg.jpg",
      "size": "5000+ employees",
      "url": "https://wellfound.com/company/amazon",
      "badges": [
        {
          "text": "Same investor as Amazon"
        }
      ],
      "markets": [
        "E-Commerce",
        "Consumer Goods",
        "Advertising",
        "Internet Infrastructure",
        "Mobile Advertising",
        "Advertising Platforms",
        "Online Video Advertising"
      ],
      "locations": ["Austin", "Boston", "Boulder"],
      "totalRaised": "$8M"
    }
  },
  {
    "url": "https://wellfound.com/company/tiptopxyz/jobs/2443744-sr-backend-engineer-payments",
    "title": "Sr. Backend Engineer (Payments) at TipTop",
    "location": "Remote • Los Angeles • New York City • San Francisco",
    "compensation": "$150k – $200k • 0.25% – 0.5%",
    "published": "1 month ago",
    "description": "We’re inviting experienced, generalist senior backend engineers to join the core TipTop team. We are looking for a self-starter who is a highly motivated and autonomous operator. Are you a seasoned engineer with previous experience in a fast paced, blue sky, startup environment who can solve problems from a blank slate? About us We’re building consumer and enterprise systems at the intersection of e-commerce, fintech, and logistics that will change our relationship with the things we purchase. We’re pre-market, envisioning an entirely new consumer finance paradigm and developing its first version. Note that we’re a distributed team collaborating remotely and meet up in person quarterly. Postmates founder banks $23 million for his new crypto startup TipTop | TechCrunch (we're not necessarily a crypto startup 😉) TipTop Funding Information | AngelList Talent You Will Solve complex challenges building software systems for products and verticals that don’t yet exist Develop scalable services that manage sensitive financial data and critical business logic Scope and build new payment and e-commerce integrations with autonomy Partner and collaborate closely with product designers, blockchain, infrastructure, and machine learning teams Contribute to the development of consumer facing experimentation &amp; risk platforms Have the opportunity to build and lead a team You Have 5+ years of experience as a software engineer architecting, building, launching, and maintaining end-to-end services from whiteboard to production Proven experience leading and implementing complex payment systems and integrations in a scalable way Deep understanding of charges, payouts, chargebacks, declines, refunds, and checkout integrations Demonstrated ability turning business and product ideas into engineering solutions – you can go from zero to one Strong CS fundamentals and programming experience in Go and Python A desire to experiment, test assumptions, and challenge hypotheses rapidly The ability to see complex problems as solvable challenges Even Better Lead contributor to previous implementations of Stripe, Square, Plaid, Affirm, or similar Passion for building, bias for action, and are excited by uncertainty You are autonomous &amp; adaptable – own the work, move fast, react quickly Interest and ability to pick up new technologies quickly Curiosity in evolving ML platforms and technologies like ChatGPT Tech You'll Use Go Python SQL/Postgres GCP Docker Kubernetes How To Apply Send us an email with a copy of your resume or LinkedIn, your GitHub, and any projects you think we should see to [email protected]",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "hiresRemotelyIn": "United States",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "5+ years",
    "skills": ["Python", "Go (Golang)"],
    "hiringContact": {
      "name": "Gregory B Carlson",
      "position": "Product"
    },
    "company": {
      "name": "TipTop",
      "description": "Stealth",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8889400-27042869faf5be6ac965cf1de99d8926-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/tiptopxyz",
      "badges": [],
      "markets": [
        "Financial Services",
        "E-Commerce",
        "Logistics",
        "Finance Technology"
      ],
      "locations": ["Los Angeles", "New York City", "Seattle"],
      "totalRaised": "$23.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/fintron/jobs/2734545-staff-software-engineer-frontend",
    "title": "Staff Software Engineer, Frontend at FinTron",
    "location": "Remote • California • New York City • Pennsylvania • Texas • Utah • Massachusetts • Connecticut • New Jersey",
    "compensation": "$190k – $230k",
    "published": "today",
    "description": "About Us FinTron Invest is a fast-growing FinTech startup, SEC registered, FINRA member broker-dealer. FinTron is on a mission to make investing, banking, and personal financial management more accessible and appealing to young consumers. FinTron is deeply rooted in the belief that investing has been intimidating for too long, and that anyone should be able to take control of their finances (not just the 1%). FinTron operates a direct-to-consumer FinTech app, an EdTech platform, and B2B embedded technology solutions. We are an agile, tech-enabled company, we are committed to educating and serving Gen Y &amp; Z. Job Description As a frontend Staff Software Engineer you will work with developers, designers, and operational staff to play a critical role in the development of FinTron’s B2B offering and maintaining FinTron’s direct-to-consumer application. You will be working on significant critical projects and will take responsibility for all facets of the development process. You will support and mentor other team members to improve team performance and velocity. We are looking for someone who is going to be an individual contributor who is eager to dive into a highly collaborative and fast-paced environment to build innovative financial products while mentoring and growing your peers. Job Responsibilities Hands-on senior developer capabilities, individualistic contributor, and a team player Design, develop, and maintain complex, high-performance mobile and web applications using React, React Native, TypeScript, and GraphQL. Ability to own the end-to-end delivery of products from inception to production Lead a team of engineers and have strong conflict-resolution skills Optimize application performance by identifying and addressing bottlenecks, implementing best practices, and leveraging modern mobile and web development tools and techniques. Conduct code reviews, provide constructive feedback to team members, and ensure adherence to best practices and coding standards. Can coordinate releases in a timely manner and maintain deadlines Creative problem solver with a passion for testing, debugging, and overall code quality Participate in agile development processes, including sprint planning, daily stand-ups, and sprint retrospectives. Effectively communicate technical concepts and progress updates to both technical and non-technical stakeholders. The engineer will be reporting directly to the Director of Frontend Engineering; working in close collaboration with the existing development team. The developer should be well-versed in current technological trends and familiar with a variety of languages and databases as outlined below. You’ll be utilizing several languages and technologies such as: React Native React.js TypeScript JavaScript Redux XCode Git GraphQL gRPC Nice to have: Flutter Desired Qualification &amp; Background 10+ years of programming experience with significant experience in frontend frameworks and technologies 3+ years as an engineering manager Familiarity with back-end technologies and RESTful / GraphQL API integration. Startup experience strongly preferred in the fintech space Experience with end-to-end full-stack mobile, web, and QA testing Strong command of SQL, PostgreSQL, and MongoDB Excellent verbal and written communication with C-suite Manage time efficiently and is highly collaborative Strong leadership skills and ability to manage a team of developers Ability to meet tight deadlines under pressure Preferred: BSc/BA in Computer Science, Engineering, or a related field; MBA or other relevant graduate degree is a plus Why join the FinTron Team? Remote friendly Competitive cash/equity blend compensation Unlimited room for self-growth and opportunity with a scaling fintech startup Located in Stamford, CT less than 1 mile from the train station Casual dress code &amp; holistic workplace environment Opportunity to be a part of a close-knitted &amp; quirky company culture, immerse yourself in highly interactive work with a talented, energetic and passionate team! PTO Health Insurance Program Gym Membership On-Site Salary and stock options package commensurate with experience. Actual salaries will vary and will be based on various factors, such as the candidate’s qualifications, skills, experience, and competencies, as well as internal equity and alignment with market data for companies of our size and industry. FinTron is proud to be an Affirmative Action Equal Opportunity Employer and is committed to building an inclusive environment for people of all backgrounds. We celebrate people of all race, color, religion, age, sex, national origin, disability status, genetics, veteran status, sexual orientation, gender identity, expression, or any other status protected by law.",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "preferredTimezones": "Eastern Time",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "10+ years",
    "skills": [
      "Javascript",
      "Git",
      "Frontend Development",
      "Xcode",
      "TypeScript",
      "React.js",
      "React Native",
      "Grpc",
      "GraphQL",
      "Redux",
      "Flutter"
    ],
    "hiringContact": {
      "name": "Kristina DiNardo",
      "position": "Director of Human Resources • 3 years"
    },
    "company": {
      "name": "FinTron",
      "description": "Accelerating personal finance for the Mobile-First Generation!",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/7076095-1e97075f5eb0a2b2509e102a242b32dc-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/fintron",
      "badges": [
        {
          "text": "Actively Hiring"
        }
      ],
      "markets": [
        "Mobile",
        "Financial Services",
        "Education",
        "Personal Finance",
        "Application Platforms",
        "Apps",
        "Banking",
        "Finance Technology",
        "E Banking",
        "Education Technology",
        "Mobile Application",
        "Edtech",
        "Website",
        "Fin Tech"
      ],
      "locations": ["Connecticut", "Stamford", "Fairfield County"],
      "totalRaised": "$7.2M"
    }
  },
  {
    "url": "https://wellfound.com/company/traba-3/jobs/2602410-senior-software-engineer",
    "title": "Senior Software Engineer at Traba",
    "location": "New York City",
    "compensation": "$145k – $190k Wellfound Est.",
    "published": "1 week ago",
    "description": "Traba’s mission is to empower workers and businesses to reach their full productivity and potential. We are revolutionizing the broken staffing industry through a marketplace that connects workers with flexible, meaningful opportunities while providing businesses with reliable, on-demand talent. By connecting both, we unlock new levels of productivity, earning potential, and avenues for growth. We’re proud to be backed by the world’s best investors, such as Founders Fund, Khosla Ventures, and General Catalyst. We are seeking an experienced &amp; entrepreneurial full-stack engineer to join the founding team to help build our core suite of products—the React Native worker mobile app, the React/Node.js business web app, and a React/Node.js tools platform for our ops team. You'll partner with our CTO to help make key architectural decisions, iterate on the product roadmap, own product decisions, and architect &amp; build our foundational tech platform. About You: Voracious learner. You love diving into new areas and exploring new languages, frameworks, and technologies, and can discuss product with a UX designer one minute and deployment infrastructure with tech leads the next. Value clear communication. You recognize the importance of clear communication, documented planning, and transparent, frequent feedback. Sweat the small stuff. You have strong opinions on design patterns, IDEs, tabs vs. spaces—you understand that how you do one thing is how you do everything, so you care about the details. Deep experience building full-stack web applications. You have designed and built performant, scalable applications, and have expertise in developing APIs, data modeling, &amp; deploying &amp; scaling distributed systems. You Will: Architect and lead the development of our React/Typescript web apps and Firebase/Node.js APIs Architect &amp; document our tech platform and advise key product &amp; infrastructure decisions Implement our CI/CD workflows, using Docker &amp; Github Build analytics &amp; monitoring to help understand our user experience &amp; application health Contribute in a ton of other ways to a scrappy founding team building the future of flexible light industrial staffing! You Have: 5+ years experience with Typescript, Javascript, React Native, React, Node.js, Nest.js, and noSQL Experience with Firebase &amp; Docker Experience building APIs Experience working in an early-stage engineering team, working through ambiguity, and being a self-starter A passion for helping people find meaningful work that works for them Benefits: Founding Equity in Traba 100% healthcare, dental, and vision Dinner provided in office + a fully stocked kitchen! Health Advocate coverage, Gympass, OneMedical, Teladoc Virtual, TalkSpace Mental Health Therapy Our Values Dream BIG - We are on a path to change the world for the better. We create and communicate a bold direction that inspires a life-changing vision. We don’t sacrifice long-term value for short-term results. Olympian’s Work Ethic - Changing the world never comes easy. We work harder, longer, and smarter, not just two out of three. We put everything we have on the field. Growth Mindset - We confront the toughest challenges head-on and persevere. Sometimes we fail, but we brush ourselves off, adapt, learn, and push forward with resilience. Customer Obsession - We go the extra mile for our workers and businesses. We remain focused on delivering high-quality products and services that solve these often overlooked communities’ problems. What is light industrial labor? Light industrial flexible staffing is a $40B labor market that encompasses entry-level jobs in warehouses &amp; distribution centers. These workers pack boxes, load trucks, and manage warehouse operations to keep supply chains running at peak efficiency. Our workers also help event companies set up and take down equipment (such as chairs, tables, or a concert stage).",
    "jobType": "Full Time",
    "visaSponsorship": "Not Available",
    "remoteWorkPolicy": "In office",
    "skills": [],
    "hiringContact": {
      "name": "",
      "position": ""
    },
    "company": {
      "name": "Traba",
      "description": "Traba connects you to vetted and proven workers with open shifts",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/9413568-13482b87426021829e2ed84449b563d0-medium_jpg.jpg",
      "size": "11-50 employees",
      "url": "https://wellfound.com/company/traba-3",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Growing fast"
        },
        {
          "text": "Same investor as Airbnb"
        }
      ],
      "markets": ["Technology", "Staffing Firms"],
      "locations": ["Miami", "New York City"],
      "totalRaised": "$23.6M"
    }
  },
  {
    "url": "https://wellfound.com/company/valon-2/jobs/2616578-senior-software-engineer",
    "title": "Senior Software Engineer at Valon",
    "location": "Remote • New York City • United States",
    "compensation": "$175k – $205k • No equity",
    "published": "2 weeks ago",
    "description": "Engineering at Valon We are building a world-class engineering team to automate one of the most regulated spaces in the financial sector - the mortgage and housing industry. We come from companies like Google, Facebook, Spotify, Oscar Health, and Twilio. You’ll join a small, tight-knit group of engineers who are developing flexible backend architecture to accurately handle billions of dollars at scale. In addition, our team of engineers is fulfilling Valon’s mission by creating a great user experience to help homeowners manage their mortgages through a platform that delivers new features quickly and with quality. Our tech stack is built on Python, React, Docker, Kubernetes, and Google Cloud Platform. Responsibilities Learn new concepts and technologies quickly and apply them to challenging problems Design and build robust and extensible infrastructure to handle evolving and complex federal, state, and agency regulations Dive deep to understand the inner workings of a highly complex industry Work with Product and Design to define the best experience for our customers Ideal Background 4+ years of software engineering experience building quality software applications at scale Strong communicator. Able to work cross-functionally to balance product and technical requirements Great at building scalable systems from scratch with a fast turnaround Experience with one or more of the following: web application development, mobile application development, building large-scale distributed systems, or infrastructure management Time management skills that will maximize efficiency in a fast paced startup environment Benefits Base Compensation Band: $175,000 - $205,000 Compensation; competitive salary with a meaningful stake in the company via equity and our performance bonus program Health &amp; well-being; we’ll invest in your physical and mental well-being with comprehensive medical, dental, &amp; vision benefits, One medical membership, and Talkspace to provide mental health support Food &amp; meal allowance; in-office snacks, drinks, Tuesday dinners, and $400 monthly stipend towards your lunches or groceries Grow together; learning &amp; development opportunities including regular review cycles that feature 360 degree feedback Equipment; we’ll provide you with the equipment you need to be successful and a one-time $200 stipend for your initial desk setup Generous time off; paid time off, uncapped sick days, and 11 company holidays Baby bonding time!; 3 months off for birthing parents and 2 months off for non-birthing parents - fully paid so you can focus your energy on your newest addition",
    "jobType": "Full Time",
    "visaSponsorship": "Available",
    "hiresRemotelyIn": "United States",
    "remoteWorkPolicy": "Onsite or remote",
    "experience": "4+ years",
    "skills": ["Python", "React.js"],
    "hiringContact": {
      "name": "Stewart Kato",
      "position": "Employee"
    },
    "company": {
      "name": "Valon",
      "description": "The partner you can trust with your home and your future",
      "logoUrl": "https://wellfound.com/cdn-cgi/image/width=92,height=92,fit=scale-down,gravity=0.5x0.5,quality=90,format=auto/https://photos.wellfound.com/startups/i/8414848-56565f427f74299df97698e815b68e87-medium_jpg.jpg",
      "size": "201-500 employees",
      "url": "https://wellfound.com/company/valon-2",
      "badges": [
        {
          "text": "Actively Hiring"
        },
        {
          "text": "Same investor as Airbnb"
        }
      ],
      "markets": [
        "Enterprise Software",
        "Technology",
        "Finance Technology",
        "Mortgage"
      ],
      "locations": ["New York City", "Phoenix", "San Mateo"],
      "totalRaised": "$57.6M"
    }
  }
]
